{
    "companyName": "Knabe Law Firm Co., L.P.A. - Lakewood, OH",
    "address1": "14222 Madison Avenue",
    "address2": "",
    "city": "Lakewood",
    "state": "OH",
    "zip": "44107",
    "website": "http://www.KLFOhio.com",
    "phone": "216-228-7200",
    "fax": "216-228-7207",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1628157/pid_1/knabe_law_firm_co_lpa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Motor Vehicle Accidents|Personal Injury|Bicycle Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.KLFOhio.com?refPageViewId=6c3f021c464721eb\" class=\"profile-website-body\" target=\"new\"> http://www.KLFOhio.com </a> (NEW)"
        },
        {
            "lawyersAtKnabeLawFirmCo.,L.P.A.SelectedForASuperLawyers®List": "<ul><li> Knabe, Kenneth J. <a href=\"/profile/lawyer/kenneth-j-knabe/oh/lakewood/MTkwMzUwOV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Motor Vehicle Accidents|Personal Injury|Bicycle Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/knabe-law-firm-co-lpa/oh/lakewood/MTYyODE1N18x/PP?refPageViewId=6c3f017a355feefe",
    "description": "<p>Highly qualified, super rated caring and compassionate law firm.</p><p>When a car or bike accident leaves people seriously injured or grieving the loss of a loved one, our boutique law office in Lakewood is here to help. At Knabe Law Firm Co., L.P.A., we represent clients in the Greater Cleveland area who are injured by unsafe drivers. Additionally, we represent victims of serious and catastrophic bicycle accidents caused by unsafe drivers. Lead Attorney Knabe is an avid cyclist himself. He sponsors many local community bike organizations and events. He is involved in safety education, publication and Vision Zero legislation in the city of Cleveland. In several instances, he was able to negotiate well over six figures for cyclist clients who were struck by cars, even for one struck by a hit and run driver that left the scene by accessing the injured cyclist's own uninsured motorist coverage.</p><p>While we have an extensive history of success in generating six- and seven-figure settlements, we are also aggressive litigators. In a recent Cuyahoga County case, a client was hurt in a car accident and the at-fault insurer's final offer was $2,500.00. Knowing their offer was too low to cover the extent of injuries, our law office went to trial and won a jury verdict of $75,000 - 30 times more than what was offered.</p><p>Our law office represents car accident victims in the Greater Cleveland area including, but not limited to: Lakewood, Cleveland, Fairview Park, North Olmsted, Bay Village, Westlake, Rocky River, Cleveland Heights, Shaker Heights, Euclid, Solon, and Lorain County. Timely advice and counsel from an experienced injury firm is necessary in a personal injury or wrongful death case. An injured person cannot afford to wait - evidence will be lost and mistakes will be made! That is why we offer a free initial consultation and case evaluation to all prospective clients. Knabe Law Firm Co., L.P.A. takes all cases on a contingency basis; in other words, no fee unless you succeed!</p>"
}