{
    "companyName": "Brien Roche Law - McLean, VA",
    "address1": "8355 Greensboro Dr.",
    "address2": "",
    "city": "McLean",
    "state": "VA",
    "zip": "22102",
    "website": "http://www.brienrochelaw.com",
    "phone": "703-584-7210",
    "fax": "703-790-9462",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1489196/pid_1/brien_roche_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Slip &amp; Fall|Premises Liability|Drug Injuries|Professional Liability|Nursing Home|Construction Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.brienrochelaw.com?refPageViewId=6c4b108d0678098e\" class=\"profile-website-body\" target=\"new\"> http://www.brienrochelaw.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.brienrochelaw.com/blog/?refPageViewId=6c4b108d0678098e\"> http://www.brienrochelaw.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/brienroche-law/va/alexandria/NTA0Mzc1OV8x/PP\"> BrienRoche Law </a><span class=\"pp_card_street\"> 4607 Newcombe Pl. </span><span class=\"pp_card_street\"><span>Alexandria</span>, <span>VA</span><span> 22304 </span></span><span class=\"pp_card_street\"> 703-584-7210 </span></p>"
        },
        {
            "lawyersAtBrienRocheLawSelectedForASuperLawyers®List": "<ul><li> Roche, Brien A. <a href=\"/profile/lawyer/brien-a-roche/va/mclean/MTE2NDgyM18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Slip &amp; Fall|Premises Liability|Drug Injuries|Professional Liability|Nursing Home|Construction Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/brien-roche-law/va/mclean/MTQ4OTE5Nl8x/PP?refPageViewId=6c4b101eb4f3225d#otherlocations",
    "description": "<p><strong><strong>Serving Personal Injury Victims Throughout Northern Virginia</strong></strong></p><p>At BrienRoche Law in McLean, Virginia, we devote our time and resources to helping innocent accident victims and their families recover the damages they incurred as the result of another party's negligent, reckless or unlawful actions. </p><p>Serving all of Northern Virginia, as well as Washington, D.C., and the surrounding areas of Maryland, attorney Brien Roche and our law firm provide the personalized assistance and compassionate support our clients deserve when dealing with legal claims involving personal injury, wrongful death, medical malpractice and other types of civil litigation.</p><p><strong>The Experience You Need On Your Side</strong></p><p>Mr. Roche began his legal career in 1975, and he spent the early part of his career defending insurance companies against liability claims and litigation. Since shifting his focus to representing plaintiff victims, Mr. Roche has used this past experience to devise more effective strategies on behalf of our plaintiff clients, earning his reputation as one of the top personal injury attorneys in the region. </p><p>An accomplished author, he has published several books and numerous articles on topics ranging from basic legal knowledge to effective trial tactics.</p><p><strong>Highly Rated, Effective Counsel</strong></p><p>Holding a perfect 10 out of 10 rating on Avvo, as well as an AV Preeminent peer review rating* from Martindale-Hubbell, Mr. Roche can help you obtain the compensation and benefits you deserve so that you can focus on your recovery and rebuild your life. From this high level of client commitment, our law firm receives many positive referrals from satisfied clients, and we are proud of the services we offer to those throughout our community.</p><p><strong>Focused On You, Your Family And Your Needs</strong></p><p>If you suffered an injury or lost a loved one in an accident that was not your fault, you have rights. BrienRoche Law can help you assert those rights to hold the responsible parties accountable for their actions and help you obtain the justice you seek.</p><p>For more information regarding your specific case, you can call our law office to schedule a free initial consultation.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}