{
    "companyName": "Law Office of Stephen P. Rapp - Quincy, IL",
    "address1": "4531 Maine Street",
    "address2": "Suite B",
    "city": "Quincy",
    "state": "IL",
    "zip": "62305",
    "website": "https://www.representinginjuredpeople.com",
    "phone": "866-223-0087 (Toll Free)",
    "fax": "217-223-4577",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1544965/pid_1/law_office_of_stephen_p_rapp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.representinginjuredpeople.com?refPageViewId=6bcbbcd757a709da\"> https://www.representinginjuredpeople.com </a>"
        },
        {
            "honors": "<ul><li> Million Dollar Advocates Forum \"Top Trial Lawyers in America\" </li><li> American Institute of Personal Injury Attorneys 10 Best in Illinois, Client Service </li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "<ul><li> Million Dollar Advocates Forum \"Top Trial Lawyers in America\" </li><li> American Institute of Personal Injury Attorneys 10 Best in Illinois, Client Service </li></ul>",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-office-of-stephen-p-rapp/il/quincy/MTU0NDk2NV8x/PP?refPageViewId=6bcbbc49e37d67d4",
    "description": "<p>At The Law Office of Stephen P. Rapp located in Quincy, Illinois, we are fully committed to helping you secure the maximum amount of damages you incurred as the result of someone else's negligence or wrongdoing.</p><p>Serving clients in Quincy and throughout West Central Illinois, Attorney Stephen P. Rapp delivers unmatched advocacy and support to those in need. We concentrate in injury cases only. We just don't \"serve\" Quincy and West Central Illinois, we live and maintain an office located in Quincy. A native of Quincy, Mr. Rapp genuinely cares about the legal matters that affect the members of our community, and he established our law firm to provide personalized, effective representation to individuals and families dealing with injury related legal challenges involving any of the following:</p><p>• Personal injury and wrongful death claims resulting from automobile and commercial vehicle and semi-truck accidents, motorcycle accidents, dog bites and animal attacks, and other injury claims<br>• Workers' compensation<br>• Social Security Disability benefits</p><p>Backed by our 25 years of legal experience and a vast network of professional resources, we have achieved unprecedented success fighting insurance companies on behalf of our plaintiff clients in order to help them obtain the compensation to which they are entitled. Over the years, we have recovered millions of dollars in settlements and awards, earning our membership into the Million Dollar Advocates Forum, and solidifying our reputation as one of the region's top injury practices. We are a local law firm concentrating in personal injury law.</p><p>If you suffered an injury or loss due to an accident that was not your fault, you have rights, and you can trust The Law Office of Stephen P. Rapp to protect your rights in order to help you obtain the compensation you deserve. For more information concerning your claim, you can contact The Law Office of Stephen P. Rapp to take advantage of our law firm's free initial consultation. Put our experience to work for you - call The Law Office of Stephen P. Rapp as soon as possible after an accident. Don't let an insurance adjuster tell you your rights or how much you are entitled to. Have a firm handling only Injury Law work for you. Call us at 217-223-4570.</p>"
}