{
    "companyName": "Donna-Marie Cote Law Offices PLLC - Manchester, NH",
    "address1": "814 Elm Street",
    "address2": "Suite 400",
    "city": "Manchester",
    "state": "NH",
    "zip": "03101",
    "website": "https://www.cotelawnh.com",
    "phone": "603-413-6677",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4898579/pid_1/donnamarie_cote_law_offices_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Motor Vehicle Accidents"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.cotelawnh.com?refPageViewId=6c0cc9b124ecef32\"> https://www.cotelawnh.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Motor Vehicle Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/4898579_1?refPageViewId=6c0cc93a622a67ea",
    "description": "<p>Attorney Donna-Marie Cote founded our Manchester law firm, Donna-Marie Cote Law Offices, PLLC, with the goal of providing high-quality legal representation to the residents of Hillsborough County and surrounding southeastern New Hampshire. We offer legal services in three areas: personal injury law, employment law and landlord-tenant matters. We represent both landlords and tenants in disputes involving residential or commercial property; however, in the areas of personal injury and employment and labor law, we represent only victims of negligence or those who have endured illegal employment practices.</p><p>Ms. Cote began her legal career in 2000 after earning her law degree from Northeastern University School of Law and her admission to the New Hampshire Bar Association. Over the past 15 years, she has earned a reputation as a dedicated client advocate, which her long record of success supports.</p><p>Whether you sustained injuries in a car accident, suffered discrimination in the workplace or need an attorney to represent your interests in a property-related dispute, you can turn to Donna-Marie Cote Law Offices, PLLC, for assistance. Our experienced attorney will carefully examine the details of your situation and build a legal strategy to help you reach your goals. If you would like to learn more about our law firm, you can do so during an initial consultation at our Manchester law office.&nbsp;</p><p>&nbsp;</p>"
}