{
    "companyName": "Law Office of Christine M. Smith, R.N., M.S.N. - Manchester, NH",
    "address1": "37 Salmon Street",
    "address2": "",
    "city": "Manchester",
    "state": "NH",
    "zip": "03104",
    "website": "http://christinemsmithlaw.com/",
    "phone": "603-261-2299",
    "fax": "603-685-4785",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4956424/pid_1/law_office_of_christine_m_smith_rn_msn.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Wrongful Death|Car Accidents"
        },
        {
            "classesAndSeminars": "Trial Academy: Closing Argument, 2012, New Hampshire Association for Justice<br>|Medical Record: Keeping the Monkey Off Your Back, 2012, Association of Occupational Health Nurses<br>|Voir Dire of Experts at Trial, 2011, Committee for Public Counsel Service<br>|Medical Malpractice A to Z, 2010, National Business Institute<br>|New Hampshire Trial Academy - Cross Examining Experts, 2009, New Hampshire Association for Justice"
        },
        {
            "proBonoActivities": "<ul><li> Advisory Board NHTI Concord Para Legal Program , 2014 - Present </li></ul>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://christinemsmithlaw.com/?refPageViewId=6c0ccad6c44d02f1\" class=\"profile-website-body\" target=\"new\"> http://christinemsmithlaw.com/ </a>"
        },
        {
            "representativeClients": "<ul><li> Car Accident, Head Injury- Settlement for a family involved in a 35 car pile-up on 93 in New Hampshire. The father and son sustained a head injury. </li><li> Car Accident, Neck Surgery- Settlement for a husband and wife who were side swiped on 93 in New Hampshire. The husband required extensive neck surgery and the wife sustained a head injury. </li><li> Car Accident, Fibromyalgia- Settlement for a family T-boned in their vehicle. The young mother went on to develop fibromyalgia. </li><li> Medical Negligence, Acoustic Neuroma (noncancerous growth in the brain)- Settlement for a man who lost hearing in one ear because radiologist failed to identify a noncancerous growth in his brain. Because of the physicians failure to diagnose the growth it was allowed to grow very large over several years. </li><li> Negligence, Severe Burns- Settlement for a young man who was severely burnt when a fire log exploded as he placed it in the fire place. He sustained first and second degree burns to his face, neck, and arms. </li><li> Medical Negligence, Wrongful Death- Jury verdict for a man who died after gastric bypass surgery. </li><li> Medical Negligence, Collapsed Lung- Settlement for a woman who suffered a collapsed lung during acupuncture. </li><li> Negligence, Fractured Tibia Settlement for a man who slipped and fell on ice that was allowed to accumulate at a condominium development. He suffered a fractured leg. </li><li> Negligence, Aggravation of Pre-existing Condition- Settlement for a woman who slipped and fell on water allowed to accumulate in a store during a rain storm. This aggravated her per-existing low back pain and sciatica. </li><li> Negligence, Failure to Plow and Shovel Properly- Settlement for a woman who fell and fractured her wrist due to the failure of a plow company to properly plow, shovel and sand a parking lot. </li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Wrongful Death|Car Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-office-of-christine-m-smith-rn-msn/nh/manchester/NDk1NjQyNF8x/PP?refPageViewId=6c0cca89961a02e0",
    "description": "<p>I am Attorney Christine M. Smith, and I founded my law firm, the Law Office of Christine M. Smith, R.N., M.S.N., J.D., LLC with the intent of providing &nbsp;my clients with high-quality legal representation, and individual attention.</p><p>What sets my law firm apart from the competition is that I am also a Registered Nurse with over 25 years of experience which gives me what I call “the power of perspective.”&nbsp; While I am familiar with the litigation process, and the medicine involved in a personal injury case, I understand that it can be intimidating and confusing. I want my clients to know that I am here working for them, and they should always feel comfortable to call me with any questions.</p><p>I have successfully handled complex civil litigation involving medical issues either through settlement or jury trials. I place a high value on my individual clients and take great pride in the attention given to the legal matters of clients as I represent them.</p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Currently I handle legal matters involving:</p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Personal injury, such as car accidents or falls</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Medical malpractice injuries</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Wrongful death</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Nursing Home abuse and neglect</p><p>&nbsp;</p><p>To all of my clients I promise prompt, professional legal services.</p>"
}