{
    "companyName": "Hach & Rose, LLP - New York, NY",
    "address1": "112 Madison Ave",
    "address2": "10th Fl",
    "city": "New York",
    "state": "NY",
    "zip": "10016",
    "website": "https://www.unionlawfirm.com",
    "phone": "646-741-3838",
    "fax": "212-779-0028",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4302673/pid_1/hach_rose_llp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "languages": "English"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> Mon-Fri: 9:00am - 5:00pm <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.unionlawfirm.com?refPageViewId=6b6d4a4741a40a1e\" class=\"profile-website-body\" target=\"new\"> https://www.unionlawfirm.com </a> (Hach &amp; Rose, LLP Website) <a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.unionlawfirm.com/blog/?refPageViewId=6b6d4a4741a40a1e\"> https://www.unionlawfirm.com/blog/ </a> (Hach &amp; Rose, LLP Blog)"
        },
        {
            "lawyersAtHach&Rose,LLPSelectedForASuperLawyers®List": "<ul><li> Radchenko, Halina <a href=\"/profile/lawyer/halina-radchenko/ny/new-york/NDM4OTEwOF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Rose, Michael A. <a href=\"/profile/lawyer/michael-a-rose/ny/new-york/MjkyMjc2NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        },
        {
            "representativeCases": "<ul><li> $1,200,000 – construction worker injured when he slipped on door laying on ground that had pipe hidden underneath it. </li><li> $13,000,000 – Jury verdict obtained on behalf of an injured union painter who fell from a ladder and sustained a traumatic brain injury </li><li> $3,525,000 – For construction supervisor who fell from a makeshift ladder injuring his back. </li><li> $1,625,000 – Settlement obtained for a carpenter just prior to trial in which the client stepped off a ladder and tripped on debris. </li><li> $1,500,000 – A school fireman who suffered burns as a result of steam accumulation from a defective sump pump. </li><li> $400,000 – Jury verdict for woman injured in a car accident. She sustained back injury but did not report it to her doctors for nine months following the accident. </li><li> $8,000,000 – Jury verdict obtained for the victim of a motorcycle accident. </li><li> $2,500,000 – Settlement for a laborer who injured his neck in an accident on a construction site. </li><li> $3,475,000 – For a carpenter who was injured after falling from a temporary roof. </li><li> $1,700,000 – For an operating engineer who was injured in a motorcycle accident. </li><li> $1,800,000 – Settlement obtained (co-counsel) for an engineer that suffered from lung cancer due to his work in and around asbestos. He is currently retired and is in complete remission. His case is remarkable because it was rejected by a major New York asbestos law firm. </li><li> $6,058,000 – Jury verdict for a phlebotomist diagnosed with Reflex Sympathetic Dystrophy (RSD) as a result of striking her knee. </li><li> $2,500,000 – Settlement for worker who was killed while being driven in a car from a company parking lot. </li><li> $2,000,000 – Settlement for an operating engineer who was injured after he fell from a ladder while repairing a garage door. </li><li> $1,500,000 – Settlement for school operating engineer who suffered severe burns because of a leaking sump pump. </li><li> $1,000,000 – Settlement obtained for the family of a main who died as a result of a negligently performed gastric bypass surgery. </li><li> $2,500,000 – Settlement amount obtained for a member of sheet metal workers local who was injured when he slipped and fell on an unsecured board at a construction site. </li><li> $1,450,000 – Jury verdict obtained for a 60-year-old, self-employed woman who slipped and fell on water in a cafeteria while at a conference. </li><li> $2,100,000 – For a school fireman who was injured when he fell from a poorly constructed permanent ladder. </li><li> $1,350,000 – For a man injured in an automobile collision with a tractor trailer whose operator was driving under the influence of alcohol. </li><li> $1,175,000 – For a janitor who was injured when poorly stacked soda bottles toppled over and struck her when she was in the process of cleaning the cafeteria. </li><li> $2,300,000 – Jury verdict obtained for a pedestrian who was struck by a New York City Transit Authority bus. </li><li> $1,300,000 – Settlement obtained during trial for a woman injured in an automobile accident. </li><li> $3,200,000 – Settlement obtained for a carpenter who was injured in a fall at work. </li><li> $2,100,000 – Obtained for construction worker who was struck by a Bobcat operated by a co-worker. </li><li> $2,500,000 – Settlement for a worker who was injured when a piece of construction debris fell from a building. </li><li> $2,300,000 – For the family of a operating engineer that was killed in the course of his employment. </li><li> $1,200,000 – Settlement obtained (co-counsel) for a union worker that suffered from lung cancer due to his work in and around asbestos. He continues to work in his job and is in complete remission. </li><li> $2,225,000 – Settlement obtained for an engineer who was injured in a motor vehicle accident. </li><li> $2,200,000 – Jury verdict obtained for a man who suffered a back injury following an automobile accident. </li><li> $2,000,000 – Settlement for construction worker injured by falling pipe. </li><li> $3,500,000 – For stone mason who was injured when another worker threw a piece of sheetrock out a window striking him on the ground below. </li><li> $800,000 – For a construction worker who fell from a ladder positioned on scaffolding. </li><li> $750,000 – For bus driver injured when she tripped and fell on a misleveled elevator in the building where she worked </li><li> $325,000 – For a garage worker struck by an elevator door in the course of his employment </li><li> $275,000 – For a heavy equipment operator who was hit by a bus in a hit and run accident </li><li> $143,000 – For a operating engineer who injured his knee when he tripped on a misleveled elevator </li><li> $225,000 – For a union electrician who injured his wrist when he fell from his ladder on a construction project </li><li> $500,000 – For a young woman who injured her back when struck by an automobile </li><li> $135,000 – For a woman injured by an underinsured driver </li><li> $995,000 – Arbitration award for an injured couple involved in an automobile accident </li><li> $125,000 – For truck driver injured by an underinsured motor vehicle </li><li> $750,000 – For a plumber when he fell down a staircase due to an unsecured floor covering </li><li> $180,000 – For operating engineer who was injured when he fell down a staircase while in the course of his employment </li><li> $225,000 – For woman injured in an automobile accident </li><li> $500,000 – For woman injured in shopping mall due to negligent crowd control </li><li> $190,000 – For operating engineer injured on construction site </li><li> $250,000 – For operating engineer injured due to failure of building to provide safe way to enter or exit a cooling tower </li><li> $70,000 – For operating engineer injured on construction site </li><li> $250,000 – Due to trip and fall on defective sidewalk </li><li> $100,000 – Due to a slip and fall on ice </li><li> $105,000 – Due to a trip on a defective step </li><li> $150,000 – For a woman who slipped in a school parking lot that was not cleared of snow and ice on her way to her </li><li> $60,000 – For a construction work who was injured when he slipped on ice on a construction site (a violation of Labor Law Section 241(6) while in a designated walkway. </li><li> $75,000 – For a woman injured when she tripped in a poorly maintained public parking lot. </li><li> $70,000 – For a sheet metal worker injured when he tripped on construction debris </li><li> $210,000 – For a child who was struck by an automobile while crossing the street in the middle of a block </li><li> $200,000 – For a construction worker who was injured when he tripped on a defective sidewalk on his way to work. </li><li> $225,000 – For a construction worker with a wrist injury suffered when he fell from a ladder. The Appellate Court and New York found defendants liable as a matter of law. </li><li> $65,000 – For a person who slipped and fell on water in a pharmacy </li><li> $750,000 – For a worker injury when she tripped on a misleveled elevator in the building where she worked </li><li> $67,000 – For a pedestrian struck by an automobile </li><li> $65,000 – For a bus driver injured in an automobile accident </li><li> $75,000 – For a woman injured in a motor vehicle accident </li><li> $185,000 – For a woman who was an assistant on a school bus injured when the bus was in an accident </li><li> $190,000 – For a man injured on a dock that was not properly secured by the marina </li><li> $85,000 – For a woman who was injured on a sidewalk due to an unsafe construction </li><li> $80,000 – For the wife of a union member who was injured </li><li> $500,000 – For a woman injured in an automobile accident who had a prior injury to the same body part she injured in the accident </li><li> $600,000 – For a construction worker who fell from a ladder during a renovation project </li><li> $800,000 – For an operating engineer injured when installing a drop ceiling </li><li> $75,000 – For a woman injured due to a defective elevator </li><li> $65,000 – For a man injured on an unsafe premises </li><li> $190,000 – For a man injured by a construction elevator. </li><li> $59,000 – For a man injured in an automobile accident </li><li> $125,000 – For a construction worker injured on a jobsite </li><li> $100,000 – For a woman injured during a home construction project </li><li> $375,000 – For a municipal employee injured when he slipped on stairs that had just been mopped and there were no warning signs posted </li><li> $95,000 – For a utility worker injured during a road construction project </li><li> $250,000 – For a man injured due to an unsafe ladder at a storage facility </li><li> $85,000 – For a woman injured when she tripped on a defective sidewalk </li><li> $60,000 – For a police office injured in the course of her employment </li><li> $185,000 – For a woman injured on a defective sidewalk caused by a metal gate. </li><li> $140,000 – For a woman injured due to unsafe steps at a school. </li><li> $225,000 – For a man who was struck by a car while riding a scooter </li><li> $145,000 – For a union member injured by a defective product </li><li> $55,000 – For a woman injured in an automobile accident </li><li> $85,000 – For a man injured in an automobile accident in addition to receiving no fault benefits </li><li> $200,000 – For an operating engineer injured at work when he fell from an unsafe ladder </li><li> $225,000 – For a man injured when he slipped and fell on a floor at a catering hall due to the failure of the hall to clean the premises </li><li> $200,000 – For a union member injured in the course of his employment due to Labor Law violations </li><li> $673,000 – For a man injured in a train collision on his way to work </li><li> $650,000 – For man who was injured due to an unsafe indoor soccer field. </li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "English",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Mon-Fri: 9:00am - 5:00pm <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/hach--rose-llp/ny/new-york/NDMwMjY3M18x/PP?refPageViewId=6b6d48b8575667bd",
    "description": "<p>Hach &amp; Rose, LLP, is a dedicated personal injury law firm serving clients across the New York City area. Our experienced attorneys have spent years honing their skills — both inside and outside the courtroom — in an effort to provide the best possible service to clients. Having worked for years in their field, our lawyers have an intimate understanding of personal injury law. We fully understand how the negligent or reckless acts of another party can cause unnecessary pain and anguish to you and your family. If you have been injured in an accident, you may be able to obtain recompense for your injuries.</p><p>Don't hesitate to contact our superb firm, which can provide vociferous, professional representation for an array of personal injury cases involving:</p><ul><li style=\"box-sizing: border-box\">Construction Accidents</li><li style=\"box-sizing: border-box\">Work-Related Injuries</li><li style=\"box-sizing: border-box\">Car Accidents</li><li style=\"box-sizing: border-box\">Truck Accidents</li><li style=\"box-sizing: border-box\">Motorcycle Accidents</li><li style=\"box-sizing: border-box\">Train Accidents</li><li style=\"box-sizing: border-box\">Aviation Accidents</li><li style=\"box-sizing: border-box\">Product Liability</li><li style=\"box-sizing: border-box\">Defective Drugs</li><li style=\"box-sizing: border-box\">FELA</li><li style=\"box-sizing: border-box\">Exposure to Toxic Substances</li><li style=\"box-sizing: border-box\">Nursing Home Abuse</li><li style=\"box-sizing: border-box\">Premises Liability</li><li style=\"box-sizing: border-box\">Slip and Fall Accidents</li><li style=\"box-sizing: border-box\">Medical Malpractice</li><li style=\"box-sizing: border-box\">Class Actions</li><li style=\"box-sizing: border-box\">Wrongful Death</li><li style=\"box-sizing: border-box\">Asbestos</li><li style=\"box-sizing: border-box\">Workers’ Rights</li><li style=\"box-sizing: border-box\">Fires and Explosions</li></ul><p>Our well-researched, methodical approach has worked for many clients, allowing us to obtain more than $100 million in the last few years alone. Additionally, our firm has consistently achieved some of the top results in New York. We were named a top 10 attorney nationwide by Noapia, made US News's list of Best Law Firms in 2018 and our attorneys consistently are named by Super Lawyers as top personal injury attorneys. </p><p>Call 646-741-3838 to speak with the candid personal injury attorneys at Hach &amp; Rose, LLP.</p>"
}