{
    "companyName": "Janet, Janet & Suggs, LLC - New York, NY",
    "address1": "19 West 44th St.",
    "address2": "Suite 1500",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "website": "http://www.jjsjustice.com",
    "phone": "(877) 692-3862",
    "fax": "(410) 653-9030",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5048098/pid_1/janet_janet_suggs_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Birth Injury|Cerebral Palsy"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.jjsjustice.com?refPageViewId=6b701c5271b50a22\" class=\"profile-website-body\" target=\"new\"> http://www.jjsjustice.com </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/5048102_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 1500 Market Street </span><span class=\"pp_card_street\"> 12th Floor, East Tower </span><span class=\"pp_card_street\"><span>Philadelphia</span>, <span>PA</span><span> 19102 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5194167_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 2225 Sycamore Street </span><span class=\"pp_card_street\"><span>Harrisburg</span>, <span>PA</span><span> 17111 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/lawfirm/janet-janet--suggs-llc/md/baltimore/MzQxMDk0OF8x/PP\"> Janet, Janet &amp; Suggs, LLC </a> (Main Office) <span class=\"pp_card_street\"> 4 Reservoir Circle </span><span class=\"pp_card_street\"> Suite 200 </span><span class=\"pp_card_street\"><span>Baltimore</span>, <span>MD</span><span> 21208 </span></span><span class=\"pp_card_street\"> (410) 653-3200 </span></p><p><a href=\"/profile/view/5048107_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 1725 I Street N.W. </span><span class=\"pp_card_street\"> Suite 300 </span><span class=\"pp_card_street\"><span>Washington</span>, <span>DC</span><span> 20006 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5194168_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 2000 Duke Street </span><span class=\"pp_card_street\"> Suite 300 </span><span class=\"pp_card_street\"><span>Alexandria</span>, <span>VA</span><span> 22314 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5194166_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 1522 N. 6th Avenue </span><span class=\"pp_card_street\"><span>Altoona</span>, <span>PA</span><span> 16601 </span></span><span class=\"pp_card_street\"> (814) 944-6111 </span></p><p><a href=\"/profile/lawfirm/janet-janet--suggs-llc/sc/columbia/MjU5NzcxOF8x/PP\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 801 Gervais Street </span><span class=\"pp_card_street\"> Suite B </span><span class=\"pp_card_street\"><span>Columbia</span>, <span>SC</span><span> 29201 </span></span><span class=\"pp_card_street\"> (803)726-0050 </span></p><p><a href=\"/profile/view/5048095_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 70 West Madison St. </span><span class=\"pp_card_street\"> Three First National Plaza, Suite 1400 </span><span class=\"pp_card_street\"><span>Chicago</span>, <span>IL</span><span> 60602 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5048105_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 445 Minnesota Street </span><span class=\"pp_card_street\"> Suite 1500 </span><span class=\"pp_card_street\"><span>St. Paul</span>, <span>MN</span><span> 55101 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5057698_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 100 South Fifth Street </span><span class=\"pp_card_street\"> 19th Floor </span><span class=\"pp_card_street\"><span>Minneapolis</span>, <span>MN</span><span> 55402 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p><p><a href=\"/profile/view/5059280_1\"> Janet, Janet &amp; Suggs, LLC </a><span class=\"pp_card_street\"> 699 Walnut Street </span><span class=\"pp_card_street\"> 4th Floor </span><span class=\"pp_card_street\"><span>Des Moines</span>, <span>IA</span><span> 50309 </span></span><span class=\"pp_card_street\"> (877) 692-3862 </span></p>"
        },
        {
            "lawyersAtJanet,Janet&Suggs,LLCSelectedForASuperLawyers®List": "<ul><li> Janet, Howard A. <a href=\"/profile/lawyer/howard-a-janet/md/baltimore/MTA0MTkyMV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Manley, Giles H. <a href=\"/profile/lawyer/giles-h-manley/md/baltimore/NDA0MTA3M18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Serbin, Richard M. <a href=\"/profile/lawyer/richard-m-serbin/pa/altoona/MTY3NTMzNV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Suggs, Kenneth M. <a href=\"/profile/lawyer/kenneth-m-suggs/sc/columbia/NTA1MTcyMV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Ward, Roxanne L. <a href=\"/profile/lawyer/roxanne-l-ward/md/baltimore/MTMwMzc1Ml8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Birth Injury|Cerebral Palsy",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5048098_1?refPageViewId=6b701ae5e3d02257",
    "description": "<p><strong>JJS Justice: Practicing Law with Excellence and Compassion</strong></p><p></p><p><strong>Why Hire Us</strong></p><p></p><p>JJS Justice has uncovered the truth and won over <strong>three billion dollars in verdicts and settlements</strong> for clients across a wide range of serious, complex, and high profile cases. Our team of trial attorneys has a proven track record of taking on tough cases involving some of the nation's largest and most powerful organizations - and winning.</p><p></p><p>We have legal teams focusing on high-stakes <strong>medical malpractice, legal malpractice, birth injury, cerebral palsy, catastrophic injury</strong> (including birth-related cerebral palsy, cancer misdiagnosis, paralysis, brain damage, amputation, rampant infection, facial disfigurement, and death), <strong>product liability, nursing home abuse, and sexual abuse cases</strong>. </p><p></p><p>Our attorneys have been awarded dozens of national accolades for competence and ethics - and bring a record of delivering \"historic\" justice not only in clear-cut cases, but in cases that other preeminent law firms have missed or failed to put together. </p><p></p><p>As a national law firm with a 40-year track record, we have the wherewithal to advance hundreds of thousands or millions of dollars of case costs on behalf of our clients in order to put them in the best possible position to recover the compensation they deserve. </p><p></p><p>We're the experts you can trust.</p><p></p><p><strong>Medical Malpractice</strong></p><p>Our medical malpractice team includes 2020 Super Lawyer, Giles H. Manley, who has more than 20 years of experience as a board-certified physician. He joined the legal profession to help families whose children were injured at birth. Dr. Manley has extensive medical-legal experience and has served as an expert witness and has testified many times in both depositions and trials.</p><p></p><p>Kenneth Suggs, 13-time Super Lawyer recipient and the leader of our military medical malpractice team, has long been considered one the nation's premier plaintiff's attorneys, and served as President of the Association of Trial Lawyers of America (now known as American Association of Justice), the leading plaintiff's bar association.</p><p></p><p>Tens of millions in settlements and verdicts obtained in delayed diagnosis and misdiagnosis of cancer cases. These cases involved lung, breast, prostate, and numerous other forms of cancer.</p><p></p><ul class=\"unIndentedList\"><li><strong>$11.5 million settlement</strong> on behalf of a family whose child suffered acute hypoxic ischemic brain injury as a result of delayed resuscitation at a U.S. Naval Hospital in Guam.</li><li><strong>$9 million settlement</strong> reached in a case involving the misinterpretation of a prenatal sonogram that resulted in the birth of a child with severe, life-long brain damage.</li></ul><p></p><p><strong>Cerebral Palsy and Birth Injury</strong></p><p>Having been consulted by more than 30,000 families about potential cerebral palsy cases, Managing Principal Howard Janet is recognized as one of the preeminent cerebral palsy lawyers in the nation. He has won numerous awards for his work and is a 14-time Super Lawyer recipient. Partners Kenneth Suggs and Dov Apfel are also nationally recognized for their legal expertise in birth injury cases. Apfel is nationally known as a child advocate and often consults with families and lawyers throughout the country about standard of care and causation issues arising from birth injury claims. He is also a 12-time Super Lawyer recipient.</p><p></p><p>Together, our medical malpractice, birth injury and cerebral palsy lawyers have a proven record of identifying cerebral palsy cases caused by negligence and fighting for the maximum compensation our clients deserve.</p><p></p><p></p><ul class=\"unIndentedList\"><li><strong>$33.5 million verdict</strong> for a child who suffered brain damage and cerebral palsy because of delays in performing an urgently needed C-section.</li><li><strong>$24 million verdict</strong> - the largest malpractice verdict recovered in the District of Columbia - for a child who suffered cerebral palsy and brain damage after doctors failed to diagnose and respond to an airway obstruction.</li><li><strong>$18 million verdict</strong> for a child who developed spastic quadriplegic cerebral palsy after the mother was taken off of continuous electronic fetal monitoring and placed on intermittent monitoring despite known risk factors.</li></ul><p></p><p>In addition to being a fighting force in the courtroom and at the settlement table, our cerebral palsy attorneys are committed to defending the rights of cerebral palsy patients in all aspects of their lives. We have lengthened the time limits for filing claims for victims of fraudulent physicians, expanded the right for children to be compensated for their injuries and helped create the Cerebral Palsy Family Network which provides information and resources to families living with CP.</p><p></p><p><strong>Sexual Abuse</strong></p><p>We, at JJS, have spent decades representing thousands of survivors of sexual abuse and assault in complex, national cases against churches, organizations and large corporations who often shelter abusers while ignoring victims. Our Sexual Abuse Division is currently representing students who suffered sexual abuse while being treated at university-run medical facilities, survivors of sexual abuse by Catholic clergy and by leaders within the Boy Scouts of America. </p><p></p><p>Richard M. Serbin, a crusader in the fight against sexual abuse, leads the JJS Sexual Abuse Division. Serbin tried, and won, the first case in Pennsylvania against a diocese bishop and child predator. That case, Hutchison v Luddy and the Diocese of Altoona-Johnstown, et al, created new law in the field of sexual abuse. It gave survivors the right to bring a claim against the church for negligent retention and supervision of a pedophile priest, along with the right to recover punitive damages for the outrageous acts of covering up and moving from parish to parish known child predators.</p><p></p><ul class=\"unIndentedList\"><li><strong>$190 million settlement</strong> on behalf of more than 8,000 women who were abused by Dr. Nikita Levy. The class action settlement was called \"a historic day\" not only for the victims but for the United States civil justice system. The settlement is one of the largest of its kind in U.S. history. </li><li><strong>7-figure settlement</strong> on behalf of one of those abused by Penn State University football coach and serial molester Jerry Sandusky. </li><li><strong>$1.88 million settlement</strong> for a survivor of childhood sexual abuse by a Catholic clergymember. This was the first, and only, successful litigation in Pennsylvania against a Catholic diocese, bishop and child predator which resulted in the creation of a new law in the field of sexual abuse.</li></ul><p></p><p><strong>Trusted Representation</strong></p><p>Having represented individuals throughout the country, we understand the current and future needs of clients and their families and are committed to fighting for the maximum compensation they need for a secure future. We always strive to provide personalized attention to each and every case we handle to ensure that the best interests of our clients are at the forefront of everything we do. </p><p></p><p>At JJS Justice, we practice with compassion and dignity, while providing world-class representation for our clients. </p>"
}