{
    "companyName": "Stockham Law Group - Sarasota, FL",
    "address1": "1800 2nd Street",
    "address2": "Suite 919",
    "city": "Sarasota",
    "state": "FL",
    "zip": "34236",
    "website": "http://stockhamlawgroup.com/",
    "phone": "941-217-7580",
    "fax": "941-217-7581",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4998309/pid_1/stockham_law_group.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Property Insurance Litigation and Nursing Home Abuse|Nursing Home Negligence|Medical Malpractice"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://stockhamlawgroup.com/?refPageViewId=6b2e664352dd67e0\" class=\"profile-website-body\" target=\"new\"> http://stockhamlawgroup.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/stockham-law-group/fl/tampa/NDc2MDcxMF8x/PP\"> Stockham Law Group </a> (Main Office) <span class=\"pp_card_street\"> 109 S. Edison Avenue </span><span class=\"pp_card_street\"><span>Tampa</span>, <span>FL</span><span> 33606 </span></span><span class=\"pp_card_street\"> 813-867-4455 </span></p><p><a href=\"/profile/view/5232831_1\"> Stockham Law Group </a><span class=\"pp_card_street\"> 1 East Broward Blvd. </span><span class=\"pp_card_street\"> Suite 700 </span><span class=\"pp_card_street\"><span>Fort Lauderdale</span>, <span>FL</span><span> 33301 </span></span><span class=\"pp_card_street\"> 954-947-8861 </span></p><p><a href=\"/profile/view/5232833_1\"> Stockham Law Group </a><span class=\"pp_card_street\"> 791 Bayou Pines East Drive </span><span class=\"pp_card_street\"> Suite 7 </span><span class=\"pp_card_street\"><span>Lake Charles</span>, <span>LA</span><span> 70601 </span></span><span class=\"pp_card_street\"> 337-488-6090 </span></p><p><a href=\"/profile/view/5232832_1\"> Stockham Law Group </a><span class=\"pp_card_street\"> 5718 Westheimer Road </span><span class=\"pp_card_street\"> Suite 1000 </span><span class=\"pp_card_street\"><span>Houston</span>, <span>TX</span><span> 77057 </span></span><span class=\"pp_card_street\"> 346-266-2997 </span></p>"
        },
        {
            "lawyersAtStockhamLawGroupSelectedForASuperLawyers®List": "<ul><li> Stockham, Donna DeVaney <a href=\"/profile/lawyer/donna-devaney-stockham/fl/tampa/MjYwMTk4OV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Property Insurance Litigation and Nursing Home Abuse|Nursing Home Negligence|Medical Malpractice",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/4998309_1?refPageViewId=6b2e65dfd5e667ed#otherlocations",
    "description": "<p>The Sarasota, Florica office of Stockham Law Group, P.A. is a focused practice in property insurance claims litigation, nursing home abuse, medical malpractice and personal injury. At Stockham Law Group, P.A., we offer a free initial consultation to prospective clients regardless of their goals. As the lead attorney in our Sarasota office, Vanessa Ross will advise clients regarding questions involving insurance coverage issues and handle complex litigation involving all types of property damage and liability claims.</p><p><strong>Property Insurance Claims Litigation</strong></p><p>Because of the unique nature of some properties, insurance companies often fail to pay what a property is worth, deny a claim or attempt to pass blame onto the homeowner who was away at the time of the loss. Attorneys at the Stockham Law Group are experienced in determining whether there is insurance coverage for a property loss and recovering the full value of damaged property based on the insurance policy provisions and the law. Based on the insurance contract, insurance companies are required to replace property with like kind and quality and return the property to its pre-loss condition. Property owners deserve to be paid the full value of the property that was lost and should not have to accept an inferior repair. Property insurance litigation is a specialized and complex area of the law and insurance companies employ large staffs of attorneys to defend their positions. As a policyholder, you deserve the same representation. We are zealous advocates for our clients and work hard to ensure they get a fair resolution to their insurance claim.</p><p><strong>Medical Malpractice and Nursing Home Abuse</strong></p><p>Even innocent mistakes made by doctors yield tragic consequences for patients and their families. Our law office, Stockham Law Group, medical malpractice and nursing home abuse attorney, James Ragano, advocates for people in Sarasota, Florida, who have been harmed by medical malpractice. James and his staff are serious about holding unethical and negligent medical practitioners liable for damage, even when they are armed with an aggressive defense.</p><p>In addition to negotiating settlements for victims of medical malpractice, we provide focused representation for clients hurt by nursing home abuse. Assisted living and long-term care facilities are legally required to deliver appropriate and adequate treatment under state law. When they fail to do so by administering inappropriate amounts of pain medication, insufficient fluids or unsafe medical procedures, our law office uses our deep knowledge and negotiation skills to protect elderly clients and family members. We never let a profit-oriented insurance company dictate the outcome of a case. When a settlement offered does not meet our client’s needs, we bring the conflict to the courtroom.</p><p>Regardless of the specific challenges prospective clients face or what they wish to achieve, Stockham Law Group, P.A., is there to help. We invite you to call or contact us for a free case review with a seasoned attorney that will help you understand your legal options.</p><p></p>"
}