{
    "companyName": "D'Intino Law Firm, LLC - Philadelphia, PA",
    "address1": "200 South Broad Street",
    "address2": "Suite 400",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19102",
    "website": "https://www.dintinolaw.com/",
    "phone": "267-684-0705",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3527024/pid_1/dintino_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Defense 40%|Real Estate 35%|Personal Injury 25%"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> Office Hours: Monday-Friday 8:00 a.m.-8:00 p.m. Weekends by appointment only. <br> Phones Answered 24/7 </p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.dintinolaw.com/?refPageViewId=6c43870fa1322281\" class=\"profile-website-body\" target=\"new\"> https://www.dintinolaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.dintinolaw.com/blog/?refPageViewId=6c43870fa1322281\"> https://www.dintinolaw.com/blog/ </a>"
        }
    ],
    "practiceAreas": "Criminal Defense 40%|Real Estate 35%|Personal Injury 25%",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Office Hours: Monday-Friday 8:00 a.m.-8:00 p.m. Weekends by appointment only. <br> Phones Answered 24/7 </p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/dintino-law-firm-llc/pa/philadelphia/MzUyNzAyNF8x/PP?refPageViewId=6c4385f5e04202e0",
    "description": "<p>Mr. D’Intino handles a full spectrum of real estate: Contracts &amp; Leases for Residential &amp; Commercial Properties; Buying &amp; Selling Real Estate; Landlord/Tenant Disputes; Foreclosures &amp; Short Sales</p><p>Despite the court closings and restrictions, D’Intino Law Firm, LLC will be open for business. Please contact me directly at 267-491-9111 or john@dintinolaw.com with any questions or needs during this unprecedented time. I will be in and out of the office, but always available via phone or email. Please be safe and cautious in this uncertain time. This to shall pass. </p><p>At the D'Intino Law Firm, LLC, in Philadelphia, we focus on real estate, personal injury and criminal defense law, so we can help you with a variety of legal issues and challenges that you might be facing.</p><p>With more than a decade of experience, we have the requisite knowledge, skill, background and dedication to make us your law firm of choice not only in Philadelphia, but also in all the surrounding counties. In addition, we constantly engage in continued professional education and growth. Consequently, you can be assured that we are up to date on changes in the law and familiar with all the legal precedents coming down from the Supreme Court of Pennsylvania, the U.S. Court of Appeals and the Supreme Court of the United States.</p><p><strong>Our Three Focus Areas</strong></p><p>We handle the following types of cases in our three focus areas:</p><p>• Real estate law: residential and commercial purchases and sales, contract drafting and review, resolution of landlord and tenant disputes and resolution of foreclosures and short sales<br>• Personal injury law: motor vehicle accidents, slip-and-falls, construction accidents, medical malpractice and faulty medical devices<br>• Criminal defense law: misdemeanors, felonies, expungements and charges involving drug, theft, domestic crimes and disorderly conduct</p><p>We also aggressively and compassionately represent grieving families who have lost a loved one to a wrongful death brought about by someone's negligence or wrongdoing.</p><p>Our mission is to give you and all our clients our tireless best efforts to achieve your goals and obtain your ideal outcome, whether at the negotiation table or in the courtroom.</p><p>D'Intino Law Firm, LLC, offers free initial consultations and accepts all major credit cards for our clients' maximum convenience in paying our very reasonable and highly competitive legal fees.</p>"
}