{
    "companyName": "Freiwald Law - Philadelphia, PA",
    "address1": "1500 Walnut Street",
    "address2": "18th Floor",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19102",
    "website": "https://freiwaldlaw.com/",
    "phone": "215-234-1151",
    "fax": "215-875-8575",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4930633/pid_1/freiwald_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Catastrophic Injury|Car Accidents|Birth Injury|Medical Malpractice|Nursing Home Abuse"
        },
        {
            "languages": "English (Primary)|Spanish"
        },
        {
            "previousLawFirmName": "<ul><li> Layser Freiwald</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://freiwaldlaw.com/?refPageViewId=6c43871d97340975\" class=\"profile-website-body\" target=\"new\"> https://freiwaldlaw.com/ </a>"
        },
        {
            "lawyersAtFreiwaldLawSelectedForASuperLawyers®List": "<ul><li> Freiwald, Aaron J. <a href=\"/profile/lawyer/aaron-j-freiwald/pa/philadelphia/MjA2Mzg0MV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        },
        {
            "honors": "<ul><li> Mr. Freiwald has an AV rating from Martindale Hubbell, the organization’s highest rating. </li><li> His peers have repeatedly recognized Mr. Freiwald as a “Pennsylvania Super Lawyer.” </li><li> Mr. Freiwald is a Fellow of the American Academy of Trial Counsel. </li><li> Law Dragon Publications has named Mr. Freiwald to its list of the 500 leading Plaintiff’s lawyers in America. </li></ul>"
        }
    ],
    "practiceAreas": "Catastrophic Injury|Car Accidents|Birth Injury|Medical Malpractice|Nursing Home Abuse",
    "litigation": "",
    "languages": "English (Primary)|Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "<ul><li> Mr. Freiwald has an AV rating from Martindale Hubbell, the organization’s highest rating. </li><li> His peers have repeatedly recognized Mr. Freiwald as a “Pennsylvania Super Lawyer.” </li><li> Mr. Freiwald is a Fellow of the American Academy of Trial Counsel. </li><li> Law Dragon Publications has named Mr. Freiwald to its list of the 500 leading Plaintiff’s lawyers in America. </li></ul>",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/freiwald-law/pa/philadelphia/NDkzMDYzM18x/PP?refPageViewId=6c4385f5e04202e0",
    "description": "<p>Here at Freiwald Law in Philadelphia, Pennsylvania, we are fully prepared to do whatever we can to help you achieve the justice you deserve following a preventable tragedy caused by another party's negligent, careless or unlawful actions.</p><p>A nationally ranked trial lawyer with decades of legal experience, attorney Aaron J. Freiwald has achieved remarkable success advocating on behalf of his clients. He leads a dedicated team of some of the best and brightest minds in the profession to help you obtain the favorable outcomes you seek for your legal challenges involving any of the following:</p><p></p><ul><li>Health care errors, such as medical malpractice, nursing home abuse, brain and spinal cord injuries, cancer misdiagnoses, prescription drug errors, and other similar claims</li><li>Major injuries involving defective products, toxic exposure, auto accidents, workplace accidents and more</li><li>Victims' rights, including sexual abuse and assault, discrimination and harassment, whistleblower</li></ul><p></p><p>To date, we have recovered tens of millions of dollars in total compensation for our clients, including many multimillion-dollar settlements and verdicts. Honored for our success, Mr. Freiwald is \"AV Preeminent\" peer-review rated,* the highest rating, through Martindale-Hubbell, and we have earned many other top rankings and endorsements from our peers. Our law firm has also received countless testimonials and referrals from our satisfied clients.</p><p>As a result of our success, our legal practice has become one of the premier law firms in our area for individuals and families in need. To receive the help and support you need, you can contact Freiwald Law to take advantage of our law firm's free initial consultation, and we offer virtual as well as in-person consultations to help keep you safe and healthy.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}