{
    "companyName": "Michael H. Applebaum - Philadelphia, PA",
    "address1": "Constitution Place",
    "address2": "325 Chestnut St.",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19106",
    "website": "http://www.applebaumandassociates.com",
    "phone": "215-372-8579",
    "fax": "215-245-4280",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4123262/pid_1/michael_h_applebaum.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Defense|DUI"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.applebaumandassociates.com?refPageViewId=6c438682c03767d8\" class=\"profile-website-body\" target=\"new\"> http://www.applebaumandassociates.com </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/michael-h-applebaum/pa/bensalem/MjQxNzQ5MF8x/PP\"> Michael H. Applebaum </a> (Main Office) <span class=\"pp_card_street\"> 3910 Bristol Pike </span><span class=\"pp_card_street\"><span>Bensalem</span>, <span>PA</span><span> 19020 </span> - 5925 </span><span class=\"pp_card_street\"> 215-372-8579 </span></p><p><a href=\"/profile/lawfirm/michael-h-applebaum/pa/doylestown/NDEyMzIzM18x/PP\"> Michael H. Applebaum </a><span class=\"pp_card_street\"> 107 East Court Street </span><span class=\"pp_card_street\"><span>Doylestown</span>, <span>PA</span><span> 18901 </span></span><span class=\"pp_card_street\"> 215-372-8579 </span></p><p><a href=\"/profile/lawfirm/michael-h-applebaum/pa/quakertown/NDEyMzE5Nl8x/PP\"> Michael H. Applebaum </a><span class=\"pp_card_street\"> 328 West Broad Street </span><span class=\"pp_card_street\"> Old Borough Hall </span><span class=\"pp_card_street\"> 2nd Floor </span><span class=\"pp_card_street\"><span>Quakertown</span>, <span>PA</span><span> 18951 </span></span><span class=\"pp_card_street\"> 215-372-8579 </span></p><p><a href=\"/profile/lawfirm/michael-h-applebaum/pa/allentown/NDcyNjUzNF8x/PP\"> Michael H. Applebaum </a><span class=\"pp_card_street\"> 527 Hamilton Street </span><span class=\"pp_card_street\"> Lower Level </span><span class=\"pp_card_street\"><span>Allentown</span>, <span>PA</span><span> 18101 </span></span><span class=\"pp_card_street\"> 215-372-8579 </span></p>"
        }
    ],
    "practiceAreas": "Criminal Defense|DUI",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/michael-h-applebaum/pa/philadelphia/NDEyMzI2Ml8x/PP?refPageViewId=6c4385df928502e0#otherlocations",
    "description": "<p><strong>1. Bensalem, PA</strong></p><p>The Pennsylvania law firm of Applebaum &amp; Associates offers a full range of legal services to help individuals and families with their most important and serious legal challenges. With five offices in southeastern Pennsylvania, including our office in Bensalem, our law firm serves clients throughout the region with all of their legal needs related to criminal defense, personal injury and family law.</p><p>With a legal career that spans over 48 years, our founder, Michael H. Applebaum, has extensive trial experience as a criminal defense attorney, having handled thousands of cases in both state and federal courts. Fully committed to protecting his clients' rights and liberties, he works hard to devise effective defense strategies to get his clients' charges dismissed or reduced. Regardless of the seriousness of the crime, he strives to obtain the most favorable outcomes possible for those he serves.</p><p>In addition to criminal law, our law firm represents innocent accident victims with all types of personal injury claims. Through our efforts, we have secured awards and settlements in excess of $55 million, earning our reputation as one of Pennsylvania's top personal injury practices. Moreover, we also represent families with legal issues related to divorce, child custody and support, alimony, property division, and virtually all areas of family law.</p><p>Whether your legal challenge is a result of a recent arrest, an impending divorce or an injury you suffered due to another party's negligence, Applebaum &amp; Associates can be your dependable legal advocate. For more information, contact our law firm to schedule a free case evaluation. Se habla español.</p><p><strong>2. Allentown, PA</strong></p><p>The Applebaum &amp; Associates law firm has five offices across southeastern Pennsylvania to conveniently serve clients throughout the region. From our office in Allentown, we represent individuals and families with all of their legal needs involving criminal defense, personal injury claims and family law matters.</p><p>Our founder, attorney Michael H. Applebaum, has over 48 years of experience practicing law. Through our law firm, he defends clients against all types of felony and misdemeanor charges, including DUI, drug crimes, violent offenses, traffic violations and more. Having successfully handled thousands of criminal law cases throughout his career, he has the skills and resources to obtain the most favorable outcomes possible for those he serves.</p><p>Along with criminal defense, our law firm advocates on behalf of personal injury victims and their families who suffered harm or lost a loved one as the result of another party's negligent, careless or reckless actions. We have recovered over $55 million in settlements and awards on behalf of our clients. We also offer a full range of services to help those going through divorce or who have other family law issues they need to address.</p><p>For competent, effective representation for your serious and pressing legal challenges, you can trust Applebaum &amp; Associates for the assistance and support you need. Our law firm offers free initial consultations as a no-risk way for you to find out more about how we can help you through your difficult time. Se habla español.</p><p>&nbsp;</p><p><strong>3. Doylestown, PA</strong></p><p>The law firm of Applebaum &amp; Associates offers a comprehensive range of services to help individuals and families throughout southeastern Pennsylvania with their most serious and life-altering legal challenges. With five offices throughout the region, including one in Doylestown, our law firm provides dependable, effective representation to those with legal needs related to any of the following:</p><ul><li>Criminal defense against all types of felony and misdemeanor charges, including DUI and traffic violations, drug crimes, violent crimes, and more</li><li>Personal injury claims involving automobile and truck accidents, premises liability, work site injuries, medical malpractice, wrongful death, and many other types of tortious claims</li><li>Family law issues involving divorce, child custody and support, alimony and spousal support, property division, domestic violence, paternity issues, and other domestic relations matters</li></ul><p>Having practiced law since 1968, our founder, attorney Michael H. Applebaum, has tried thousands of criminal cases over his nearly 50-year legal career. Always dedicated to protecting his clients' rights and freedom, he uses every tool at his disposal to fight to achieve the most favorable outcomes possible, regardless of the severity of the charges.</p><p>Moreover, Mr. Applebaum has secured substantial settlements and awards on behalf of personal injury victims, and he has helped countless families through sensitive and emotional family law issues.</p><p>No matter the legal challenge you face regarding your freedom, your financial security or your family's future, you can rely on Applebaum &amp; Associates to protect your best interests. For more information, contact our law firm to schedule a free initial consultation. Se habla español.</p><p><strong>4. Quakertown, PA</strong></p><p>Offering high-quality, effective legal counsel for your most serious and pressing legal challenges, Applebaum &amp; Associates provides full representation for all types of criminal defense, personal injury and family law matters. With five offices in southeastern Pennsylvania, including our office in Quakertown, our law firm serves clients throughout the region by providing personalized attention and compassionate counsel to those in need.</p><p>Beginning his legal career in 1968, our founder, Michael H. Applebaum, has extensive trial experience with a long record of successfully defending his clients against all types of criminal charges. From violent felony offenses and federal crimes to DUI and relatively minor traffic violations, Mr. Applebaum has the skills and resources to achieve the most positive results possible for his clients.</p><p>For those who suffered an injury or loss due to another party's negligence, our law firm advocates strongly to protect our clients' rights and entitlements, helping recover the compensation and benefits they need to support themselves and their families. Having secured more than $55 million in settlements and awards, we have gained a reputation as one of Pennsylvania's top personal injury practices.</p><p>Additionally, our law firm handles all aspects of family law, including divorce, child custody and support, alimony, property division, and post-judgment modifications. We can also help draft and enforce prenuptial agreements, and we offer effective defense against domestic violence charges and other related offenses.</p><p>For more information about how Applebaum &amp; Associates can help you or your family through your difficult legal situation, you can contact our Quakertown office to schedule a free initial consultation. Se habla español.</p><p>&nbsp;</p><p><strong>5. Philadelphia, PA</strong></p><p>With five offices across southeastern Pennsylvania, including our office in Philadelphia, the Applebaum &amp; Associates law firm is dedicated to assisting clients throughout the region with the legal issues that affect their lives the most. With a legal career that spans almost 50 years, our law firm's founder, Michael H. Applebaum, has extensive experience that he uses to devise the most effective strategies and solutions possible to help clients with legal needs related to any of the following:</p><ul><li>Felony and misdemeanor criminal defense, including drug violations, sex offenses, white collar crimes, violent crimes, property crimes and juvenile offenses</li><li>DUI defense and defense against other types of traffic violations</li><li>Injuries suffered in car and truck accidents, pedestrian and bicycle accidents, slip-and-fall accidents and other premises liability claims, workplace and construction accidents, medical malpractice, defective products claims, and wrongful death claims</li><li>Divorce, child support and custody issues, paternity and fathers' rights, property division, alimony, and all other areas of family law, including domestic violence defense</li></ul><p>Always devoted to protecting our clients' rights and best interests, the attorneys at our law firm work hard to ensure that we do all we can to obtain the most positive outcomes possible for those we serve. Along with securing numerous acquittals and dismissals of serious criminal charges, we have recovered over $55 million in settlements and awards on behalf of personal injury victims. Additionally, we have helped countless families through sensitive and emotional legal challenges regarding their families.</p><p>Regardless of the legal challenge you face, whether it be a recent arrest, an injury or loss caused by another party's negligence, an impending divorce, or another domestic relations issue, you can contact Applebaum &amp; Associates to schedule a free case evaluation. Se habla español.</p><p><br clear=\"all\"> &nbsp;</p><p>&nbsp;</p>"
}