{
    "companyName": "The Law Offices of Michael M. Kaplan - Framingham, MA",
    "address1": "1661 Worcester Rd.",
    "address2": "",
    "city": "Framingham",
    "state": "MA",
    "zip": "01701",
    "website": "http://www.kaplanslaw.com",
    "phone": "(508) 875-1410",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2751787/pid_1/the_law_offices_of_michael_m_kaplan.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Motor Vehicle Accidents -- Plaintiff|Personal Injury -- Plaintiff|Car Accidents|Truck Accidents|Pedestrian Injuries|Motorcycle Accidents|Construction Site Injuries|Slip and Fall|Negligence|Misdiagnosis|Workers' Compensation Law"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.kaplanslaw.com?refPageViewId=6be19ff7109002ed\"> http://www.kaplanslaw.com </a><br>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/2750909_1\"> Law Offices of Michael M. Kaplan, P.C. </a> (Main Office) <span class=\"pp_card_street\"> 291 Main Street </span><span class=\"pp_card_street\"> Suite 101 </span><span class=\"pp_card_street\"><span>Milford</span>, <span>MA</span><span> 01757 </span> - 2506 </span><span class=\"pp_card_street\"> (508) 473-1161 </span></p>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Motor Vehicle Accidents -- Plaintiff|Personal Injury -- Plaintiff|Car Accidents|Truck Accidents|Pedestrian Injuries|Motorcycle Accidents|Construction Site Injuries|Slip and Fall|Negligence|Misdiagnosis|Workers' Compensation Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/2751787_1?refPageViewId=6be19fd2e50c67cc",
    "description": "<p><b>Confidence</b></p><p>Confidence directly impacts an attorney's ability to get the best result for his client. I am an experienced personal injury trial attorney, and I have recovered over $6 million tax-free for injured victims since 1994. Opposing attorneys know that when I prepare for trial is not an idle threat or simply settlement posturing.</p><p>I seek to maximize the recovery in the client's best interest through aggressive and ethical lawyering. My firm brings in expert witnesses to properly lay the groundwork for litigation, which in turn solidifies the client's claim and increases the value of the claim. In order to maximize your claim and obtain an effective and successful result, your attorney must be willing to put in the preparation, time, and expense that is necessary.</p><p><b>Communication</b></p><p>An attorney must be able to effectively communicate with clients, witnesses, opposing attorneys, court personnel, and judges. Effective communication is the result of experience and preparation. All calls to my offices are answered within twenty four hours, if they are not able to be answered immediately. I recognize that injuries can occur at any time of day or night, so my firm has evening and weekend staff available to answer your calls and immediately address your legal concerns. All of my clients receive my home number, and there is always a way to reach me twenty four hours, seven days a week.</p><p><b>Caring</b></p><p>Getting the best possible results for each client often requires going the extra mile. My firm carefully screens all prospective clients so that we can be sure that I only represent individuals who have truly been harmed. This screening process has given my firm a reputation as credible personal injury practice, and cases that I accept are taken seriously by insurance companies and opposing attorneys.</p><p>You and your case are important to us. Each client is treated like family, and I spend the time with each client to better understand each individual's needs and objectives.</p><p>My firm also cares about the community in which we live and work. My firm is involved in local charity work, including the Milford Hospital Pediatric Unit and providing holiday gifts to local families who are in need. Personally, I have been a coach for town soccer, baseball, and basketball teams, and I serve as an assistant Cub Scout Master.</p>"
}