{
    "companyName": "Lynn Law Firm, LLC - Syracuse, NY",
    "address1": "101 South Salina Street",
    "address2": "M&T Bank Building - Suite 802",
    "city": "Syracuse",
    "state": "NY",
    "zip": "13202 - 4983",
    "website": "http://www.lynnlaw.com",
    "phone": "315-760-5708",
    "fax": "(315) 474-4514",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1676480/pid_1/lynn_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "litigation": "<ul><li>80%</li></ul>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lynnlaw.com?refPageViewId=6b7011a8d42967bd\" class=\"profile-website-body\" target=\"new\"> http://www.lynnlaw.com </a>"
        },
        {
            "lawyersAtLynnLawFirm,LLCSelectedForASuperLawyers®List": "<ul><li> Benson, Walter F. <a href=\"/profile/lawyer/walter-f-benson/ny/syracuse/Mjc5ODcyN18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Lynn-Ford, Patricia A. <a href=\"/profile/lawyer/patricia-a-lynn-ford/ny/syracuse/Mjk1NzA2Nl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "<ul><li>80%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lynn-law-firm-llc/ny/syracuse/MTY3NjQ4MF8x/PP?refPageViewId=6b7010ee72a7098e",
    "description": "<p>1. Syracuse, NY</p><p>Attorney William F. Lynn founded our Syracuse-based law office, Lynn Law Firm, with the goal of protecting the rights of injured victims living in Central New York. Today, Mr. Lynn and the rest of our legal team have reputations as dedicated client advocates. Their dedication, along with our firm's long record of success, brings countless victims and families to our door each year for assistance pursuing personal injury and wrongful death compensation in cases related to the following:</p><ul><li>Motor vehicle accidents</li><li>Product liability</li><li>Premises liability</li><li>Snowmobile accidents</li><li>Construction site accidents</li><li>Workplace accidents</li></ul><p>In addition to our primary practice area, we also represent clients in nonpersonal injury and commercial torts and bad faith insurance.</p><p>If you or someone you love sustained an injury due to the negligence of another individual, business or professional, you can put your trust in the experienced attorneys at Lynn Law Firm. Our legal team will work with you and our network of resources to build a case to support your claim for personal injury compensation. To learn more about how we can help you recover the compensation you need, you can take advantage of our offer for a free initial consultation at our law office in Syracuse. </p><p>2. Skaneateles, NY</p><p>Since our firm's doors first opened in Central New York, the attorneys at Lynn Law Firm have worked to build a reputation as one of the region's leading personal injury firms. Today, decades later, we still fight diligently to protect the rights of injured victims living in the Syracuse area, resulting in continuous growth. We now have two office locations in the area, including our branch law office in Skaneateles. At both locations, clients can get the help they need pursuing personal injury and wrongful death compensation.</p><p>From motor vehicle accidents to workplace accidents, our attorneys have the experience to help our clients protect their financial futures in the aftermath of accidents. We work from the first meeting to gather evidence to support claims for compensation.</p><p>Regardless of the negligent party who was responsible for your injuries or loss, the legal team at Lynn Law Firm will work to ensure you have the compensation you need to allow you to recover and live a secure life. By taking advantage of our offer for a free initial consultation at our law office in Skaneateles, you can learn why so many people in Central New York choose our firm to represent them in civil matters.</p>"
}