{
    "companyName": "Myones Legal, PLLC - Fort Lauderdale, FL",
    "address1": "1005 W State Rd 84",
    "address2": "#514",
    "city": "Fort Lauderdale",
    "state": "FL",
    "zip": "33312",
    "website": "https://www.myoneslegal.com/",
    "phone": "954-715-7888",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5189973/pid_1/myones_legal_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Car Accidents|Slip &amp; Fall|Wrongful Death|Insurance Law|Property Damage|Hurricane Damage"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.myoneslegal.com/?refPageViewId=6b479da5b5af3712\" class=\"profile-website-body\" target=\"new\"> https://www.myoneslegal.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.myoneslegal.com/blog/?refPageViewId=6b479da5b5af3712\"> https://www.myoneslegal.com/blog/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Car Accidents|Slip &amp; Fall|Wrongful Death|Insurance Law|Property Damage|Hurricane Damage",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/myones-legal-pllc/fl/fort-lauderdale/NTE4OTk3M18x/PP?refPageViewId=6b479d39974e02ed",
    "description": "<p>Myones Legal, PLLC, is proud to help people protect their interests and receive compensation for their injuries. Our law office serves the Fort Lauderdale, Florida, area and beyond with customized personal injury services.</p><p>Personal injury</p><p>When people go out in public, they have a legal obligation to act in a way that does not injure others. The same is true for property owners when they invite or allow others to enter the land or buildings that they own.</p><p>If negligent or malicious actions harm people, the perpetrators could be liable to pay for a variety of damages. Our law office helps injured people understand what they deserve and pursue full compensation through negotiations and court.</p><p>Specifically, these cases come from a variety of specific events. Examples include car crashes, poorly maintained premises, animal bites, medical malpractice, nursing home abuse, trucking accidents, railroad worker accidents, workers' compensation and wrongful death.</p><p>Property damage</p><p>It is no secret that Florida weather often damages property. Insurance companies that operate in the state should know this, and they should charge reasonable premiums for the coverage they offer.</p><p>Unfortunately, this is not always the case. Myones Legal, PLLC, helps property owners negotiate with and, if necessary, litigate against insurance companies that do not live up to agreements. This could include denied claims, bad faith insurance cases and so on.</p><p>While it is almost always best to start as soon as possible, we handle cases at any stage. We also take issues as far as they may go, including to higher courts for appeals. Our law office provides free, no-obligation consultations for new clients. Virtual appointments are also available.</p>"
}