{
    "companyName": "Leighton Law, P.A. - Orlando, FL",
    "address1": "121 South Orange Avenue",
    "address2": "",
    "city": "Orlando",
    "state": "FL",
    "zip": "32801",
    "website": "https://leightonlaw.com/",
    "phone": "",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5106795/pid_1/leighton_law_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Serious Injuries|Catastrophic|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://leightonlaw.com/?refPageViewId=6b2e400af20f1283\" class=\"profile-website-body\" target=\"new\"> https://leightonlaw.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/leighton-law-pa/fl/miami/NDgyNDE4MF8x/PP\"> Leighton Law, P.A. </a> (Main Office) <span class=\"pp_card_street\"> 1401 Brickell Avenue </span><span class=\"pp_card_street\"> Suite 900 </span><span class=\"pp_card_street\"><span>Miami</span>, <span>FL</span><span> 33131 </span></span><span class=\"pp_card_street\"> 800-566-6398 </span></p>"
        },
        {
            "lawyersAtLeightonLaw,P.A.SelectedForASuperLawyers®List": "<ul><li> Leighton, John Elliott <a href=\"/profile/lawyer/john-elliott-leighton/fl/miami/MTExODgwNl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Serious Injuries|Catastrophic|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/leighton-law-pa/fl/orlando/NTEwNjc5NV8x/PP?refPageViewId=6b2e3efe943b370f",
    "description": "<p>At Leighton Law in Orlando, Florida, we are fully committed to helping you obtain the justice you deserve for the injuries and losses you sustained as the result of someone else's negligence or wrongdoing.</p><p>Led by experienced, award-winning attorney John Elliott Leighton, our law firm has two offices in Florida, and we serve plaintiff clients across the state adversely affected by car, truck and other motor vehicle accidents, defective products, slip-and-fall accidents, and accidents that happened in theme parks, on cruise ships or any other popular destination for tourists. What's more, we are one of the leading law firms for claims involving medical malpractice and negligent security, and we also have notable experience handling cases resulting from sexual assault and abuse.</p><p>A board-certified civil trial lawyer and prolific legal author and lecturer, Mr. Leighton has earned a reputation as a leader in his field over the course of his more than 33 years of legal practice. During that time, he has secured millions of dollars in settlements and awards for our clients, including some of the largest verdicts and settlements ever awarded in the state. Recognized for his success, Mr. Leighton holds perfect ratings on Avvo, and Florida Trend magazine voted him among the state's Legal Elite in 2018.</p><p>This means you can expect to receive the highest level of advocacy and support possible from an attorney you can trust to always look out for your best interests and help you recover the maximum amount of compensation you need to cover your medical bills, lost wages and other associated expenses so you can focus on your recovery.</p><p>For a free initial consultation concerning your claim, you can contact Leighton Law by phone or through the form located on our law firm's website to schedule an appointment.</p>"
}