{
    "companyName": "Attorney Mark Rufo PC - Nashua, NH",
    "address1": "131 W. Hollis St.",
    "address2": "",
    "city": "Nashua",
    "state": "NH",
    "zip": "03060",
    "website": "https://www.markrufo.com",
    "phone": "603-546-7260",
    "fax": "603-882-2503",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1745464/pid_1/attorney_mark_rufo_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Workers’ Compensation|Pedestrian Accidents|Motorcycle Accidents|Dog Bites|Injuries to Children|Slip and Fall Accidents|Wrongful Death"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.markrufo.com?refPageViewId=6c0cc9d3c1e402ed\"> https://www.markrufo.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Workers’ Compensation|Pedestrian Accidents|Motorcycle Accidents|Dog Bites|Injuries to Children|Slip and Fall Accidents|Wrongful Death",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/attorney-mark-rufo-pc/nh/nashua/MTc0NTQ2NF8x/PP?refPageViewId=6c0cc93a622a67ea",
    "description": "<p>At the law office of Injury Attorney Mark Rufo, we provide dedicated personal injury and workers' compensation guidance and counsel. Serving clients in Nashua, New Hampshire, as well as in Claremont, Concord, Derry, Keene, Laconia, Manchester and Salem and throughout Belknap, Cheshire, Hillsborough, Merrimack, Rockingham and Sullivan counties, our attorney generally handles cases involving motor vehicle and motorcycle accidents, slip-and-falls, dog bites, medical malpractice, work accidents and wrongful death claims. </p><p>Having more than 30 years of legal experience, our attorney has assisted clients with a range of personal injury and work-related accident matters. We have helped those injured as a result of the negligent actions of others or in the workplace to recover the maximum compensation in cases involving head and neck injuries, back injuries, repetitive motion injuries, amputations and permanent scarring. To best serve our clients, our law office offers free initial consultations.</p><p>Despite their catchy slogans, we know that insurance companies are often looking out for their own financial interests, not the needs of those who have been injured and are entitled to compensation. Negotiating on their behalf, our attorney seeks to recover damages for the losses people have already suffered due to their injuries, as well as for their associated future medical needs.</p><p>In addition to handling accident injury cases, our team at the law office of Injury Attorney Mark Rufo accepts sexual abuse cases. Sensitive to the private nature of these matters, we provide the compassionate representation our clients need and deserve while aggressively advocating on their behalf to help them achieve financial justice.</p>"
}