{
    "companyName": "Baratta, Russell & Baratta - Media, PA",
    "address1": "1000 N. Providence Rd.",
    "address2": "",
    "city": "Media",
    "state": "PA",
    "zip": "19063",
    "website": "https://www.barattarussell.com/",
    "phone": "215-914-2222",
    "fax": "215-914-2118",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5170230/pid_1/baratta_russell_baratta.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Estate Planning"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.barattarussell.com/?refPageViewId=6c43905ff21302d6\" class=\"profile-website-body\" target=\"new\"> https://www.barattarussell.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.barattarussell.com/blog/?refPageViewId=6c43905ff21302d6\"> https://www.barattarussell.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/baratta-russell--baratta/pa/huntingdon-valley/MzQxNTE1MF8x/PP\"> Baratta, Russell &amp; Baratta </a> (Main Office) <span class=\"pp_card_street\"> The Loft at Woodmont </span><span class=\"pp_card_street\"> 3500 Reading Way </span><span class=\"pp_card_street\"><span>Huntingdon Valley</span>, <span>PA</span><span> 19006 </span></span><span class=\"pp_card_street\"> 215-914-2222 </span></p>"
        },
        {
            "lawyersAtBaratta,Russell&BarattaSelectedForASuperLawyers®List": "<ul><li> Baratta, Anthony J. <a href=\"/profile/lawyer/anthony-j-baratta/pa/huntingdon-valley/MTk1NzEyM18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Estate Planning",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/baratta-russell--baratta/pa/media/NTE3MDIzMF8x/PP?refPageViewId=6c438f8a740367c8#otherlocations",
    "description": "<p><span>Located in Media, Pennsylvania, Baratta, Russell &amp; Baratta, provides unmatched advocacy and support to those who suffered an injury or lost a loved one as the result of someone else's negligence or wrongdoing. In addition to handling all types of personal injury, medical malpractice, workers' compensation and wrongful death claims, the attorneys at our law firm also offer comprehensive estate planning and administration services to help you establish your final wishes and to protect your assets and family members for the future.</span></p><p><span>Combined, our attorneys possess decades of legal experience, and we have a Board-Certified Civil Trial Advocate as a member of our team. This means you can expect to receive the highest level of advocacy and support possible for your serious and pressing legal challenges as we work diligently to help increase your chances of securing the maximum amount of compensation you deserve.</span></p><p><span>Likewise, you can rely on our counsel and support to help you draft effective, enforceable plans for your estate in order to provide you and your family with some peace of mind after your passing or during a time when you can no longer make decisions for yourself. No matter how complex your estate, you can trust us to devise customized solutions aimed at helping you achieve your goals.</span></p><p><span>Recognized for our impeccable professionalism and outstanding service, our attorneys have earned AV Preeminent peer review ratings* from Martindale-Hubbell along with \"Superb\" client ratings and the Clients' Choice Award from Avvo. Moreover, we are lifetime members of the Million Dollar Advocates Forum, and we have received recognition for having secured some of the largest verdicts and settlements for personal injury claims in the country.</span></p><p><span>For more information on how we can best assist you and your family during this difficult and uncertain time, you can contact Baratta, Russell &amp; Baratta, by calling our law office or visiting our website to schedule a free initial consultation.</span></p><p><span>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating™ fall into two categories – legal ability and general ethical standards.</span></p>"
}