{
    "companyName": "Hollis Law Firm - Overland Park, KS",
    "address1": "8101 College Blvd.",
    "address2": "Ste. 260",
    "city": "Overland Park",
    "state": "KS",
    "zip": "66210",
    "website": "https://hollislawfirm.com/",
    "phone": "913-380-0427",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1607315/pid_1/hollis_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Mass Torts (Defective Products and Prescription Drugs)|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://hollislawfirm.com/?refPageViewId=6bd90033418d0325\" class=\"profile-website-body\" target=\"new\"> https://hollislawfirm.com/ </a>"
        }
    ],
    "practiceAreas": "Mass Torts (Defective Products and Prescription Drugs)|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/hollis-law-firm/ks/overland-park/MTYwNzMxNV8x/PP?refPageViewId=6bd90012c4b4031c",
    "description": "<p>Injuries, illness or death resulting from harmful prescription drugs or dangerous medical devices may be the most egregious betrayals of trust a patient can experience. At Hollis Law Firm in Overland, Kansas, we understand the amount of faith our clients place in the doctors and medical professionals who treat them and the prescriptions and devices those professionals recommend to improve their health. When those treatments result in injury, someone must be held accountable.</p><p>At our law firm, we believe it is not enough to know the laws related to personal injury claims, medical malpractice and consumer protection. We fight for our clients by having a thorough and current knowledge of the science and medicine behind the drugs and devices that cause harm. In addition to our tireless research, we obtain much of our information about the consequences of defective products by listening carefully to our clients and looking for patterns in injuries from certain products.</p><p>In addition to pharmaceutical injuries and class action cases, our law firm also represents clients who have suffered injuries through no fault of their own in any of the following circumstances and more: </p><ul><li>Animal attacks</li><li>Asbestos exposure</li><li>Motor vehicle accidents involving cars, trucks, bicycles, pedestrians, boats, ATVs and others</li><li>Scooter injuries</li><li>Railroad accidents</li><li>Premises liability, including falls, elevator and escalator defects </li></ul><p>Serious injuries often mean months or years of physical, emotional and financial struggles. The experienced attorneys at Hollis Law Firm offer a free initial consultation to review your case and give you an honest evaluation of your potential claim. Our law office is located in Overland, but we also offer virtual consultations if you are concerned about your health or if you live outside of the area.</p>"
}