{
    "companyName": "Lormand Law Firm - Baton Rouge, LA",
    "address1": "3909 Plaza Tower Drive",
    "address2": "",
    "city": "Baton Rouge",
    "state": "LA",
    "zip": "70816",
    "website": "http://www.lormandlaw.com",
    "phone": "225-960-6694",
    "fax": "225-292-5905",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3986755/pid_1/lormand_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Nursing Home Abuse|Car Accidents"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lormandlaw.com?refPageViewId=6bd976c7b650228a\" class=\"profile-website-body\" target=\"new\"> http://www.lormandlaw.com </a>"
        },
        {
            "representativeCases": "<ul><li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.westlaw.com\"> Etcher v. Neuman, 806 So.2d 826 (La. App 1st Cir. 2001) </a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Nursing Home Abuse|Car Accidents",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lormand-law-firm/la/baton-rouge/Mzk4Njc1NV8x/PP?refPageViewId=6bd9767962a967b6",
    "description": "<p>Here at the Lormand Law Firm in Baton Rouge, Louisiana, we have a mission to hold negligent health care providers responsible for the pain and harm they have caused to others while helping to ensure they never make the same mistakes again.</p><p>Serving clients throughout the state, our law firm's founder, attorney Bobby Lormand, has more than 20 years of legal experience. During his time in practice, he has helped establish our law office has the trusted source for individuals and families across our region who are suffering needlessly as the result of any of the following:</p><p></p><ul><li>Medical malpractice</li><li>Nursing home abuse</li><li>Wrongful death</li><li>Other preventable tragedies caused by someone else's negligence or wrongdoing</li></ul><p></p><p>Mr. Lormand has gained a reputation as one of the leading advocates in our region for all areas of medical and health care negligence, and our law firm has recovered millions of dollars in total compensation for our plaintiff clients. We are intensely passionate about fighting for the rights and entitlements of those in need, and you can rely on us to aggressively pursue the favorable outcomes you expect and the justice you deserve.</p><p>Honored for our impeccable professionalism and service, Mr. Lormand has earned a Martindale-Hubbell Distinguished* peer review rating along with consistent recognition from his peers as being among the top lawyers in our region. He has also received superb client ratings on Aveo, and our law firm has enjoyed countless testimonials and referrals from those we have served.</p><p>To find out more about how we can best help you during this difficult and stressful time in your life and to increase your chances of obtaining the maximum amount of compensation you need, you can contact the Lormand Law Firm to schedule a free initial consultation. We also currently offer virtual consultations in an attempt at keeping you and your loved ones safe and healthy.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}