{
    "companyName": "DJ Chapman Law, P.C. - Fargo, ND",
    "address1": "3523 45th Street S.",
    "address2": "#100",
    "city": "Fargo",
    "state": "ND",
    "zip": "58104",
    "website": "https://www.djchapmanlaw.com",
    "phone": "701-800-2656",
    "fax": "701-540-0569",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3404837/pid_1/dj_chapman_law_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Personal Injury|Immigration"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.djchapmanlaw.com?refPageViewId=6c3a19fa043f67ba\"> https://www.djchapmanlaw.com </a>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Personal Injury|Immigration",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/dj-chapman-law-pc/nd/fargo/MzQwNDgzN18x/PP?refPageViewId=6c3a19d0f6420996",
    "description": "<p>In Fargo, North Dakota, we are proud to represent clients who turn to us at the DJ Chapman Law Firm. Our qualified attorneys handle personal injury matters, including wrongful death, trucking accidents, professional malpractice, premises liability, medical malpractice, legal malpractice, car accidents, assault and battery, and asbestos and mesothelioma. We are also experienced in immigration law, constitutional law, and defamation and privacy law.</p><p>For almost two decades, our law firm has been working with the people in the area to provide high-quality legal representation when it is needed most. Since our doors opened, we have helped businesses, employers and individuals through a long list of legal issues before both federal and state courts.</p><p>Because we want our clients to be involved in the way their case plays out, we do all we can to keep them up to date and informed on what is happening in the process. For those who cannot travel to our physical location at the DJ Chapman Law Firm, we provide virtual appointments, and we accept credit card payments for our services. We have high expectations for professionals and how they treat our clients, and we are not afraid to seek maximum compensation when an injury or a misstep occurs.</p><p>We strive to be a champion and protector of our clients' best interests. We understand the value of negotiation when it comes to a personal injury case, but we are not afraid to go up against large insurance companies in court if necessary, to protect our clients and allow them to recover both financially and physically after an injury.</p>"
}