{
    "companyName": "Cortina, Mueller & Frobish, P.C. - Morris, IL",
    "address1": "124 W. Washington St.",
    "address2": "",
    "city": "Morris",
    "state": "IL",
    "zip": "60450",
    "website": "http://www.cortinamueller.com/",
    "phone": "815-513-4016",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2239287/pid_1/cortina_mueller_frobish_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Workers' Compensation|Family Law|Divorce|Criminal Defense"
        },
        {
            "languages": "English"
        },
        {
            "previousLawFirmName": "<ul><li> Cortina, Mueller &amp; O'Brien</li><li> Cortina &amp; Mueller, P.C.</li></ul>"
        },
        {
            "mergersAndAcquisitions": "<ul><li>Law Office of Frank J. Cortina &amp; Associates</li><li>Mueller &amp; Garretson</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.cortinamueller.com/?refPageViewId=6bcbc8b7446702c6\" class=\"profile-website-body\" target=\"new\"> http://www.cortinamueller.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Workers' Compensation|Family Law|Divorce|Criminal Defense",
    "litigation": "",
    "languages": "English",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/cortina-mueller--frobish-pc/il/morris/MjIzOTI4N18x/PP?refPageViewId=6bcbc868535202ae",
    "description": "<p>Having more than 85 combined years of experience, our team at the law office of Cortina, Mueller &amp; Frobish, P.C., assists people in Morris, Illinois, with personal injury and workers’ compensation cases. We lend our legal knowledge and counsel to clients throughout Grundy, LaSalle, Kendall, Will, Livingston and Kankakee counties. Our attorneys will sit down with you during a free initial consultation to help you understand the laws as they pertain to your case. We strive to put you in a position to make informed decisions about your future. Our attorneys also accept family law, criminal defense, real estate law and Social Security Disability cases, among others.</p><p>If you have been injured, whether in a motor vehicle accident, as a result of a dog bite, by a defective product, in a slip-and-fall accident or otherwise, we know that you may be facing a number of challenges. During a time when you should be focusing on your recovery, you may be concerned about mounting medical bills and lost income. Our law office team is committed to providing you with one-on-one attention and helping you pursue the maximum compensation in your personal injury or workers' compensation case.</p><p>In addition to injury cases, you can count on our attorneys at the law office of Cortina, Mueller &amp; Frobish, P.C., to provide you with the effective, compassionate representation whether you are going through a divorce or other family legal issues, buying, selling or developing real estate, or facing misdemeanor, felony or DUI charges. Collectively, our attorneys have represented thousands of individuals in a broad range of complex legal matters. They have the know-how to advocate on your behalf and seek the resolution you need to move forward with your life.</p>"
}