{
    "companyName": "Peel Law Firm - Millington, TN",
    "address1": "8582 U.S. Highway 51 North",
    "address2": "",
    "city": "Millington",
    "state": "TN",
    "zip": "38053",
    "website": "https://www.peellawfirm.com",
    "phone": "(901) 872-4229",
    "fax": "901-872-4272",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1532517/pid_1/peel_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Motor Vehicle Accidents"
        },
        {
            "classesAndSeminars": "Introduction to Law for the Paralegal, State Tech-Millington Campus<br>|Leadership for the New Millennium<br>|Using Medical Records in Legal Matters<br>|Apologetics and the Truth of the Bible<br>|Creation vs. Evolution"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.peellawfirm.com?refPageViewId=6c43e362f70e0a2e\" class=\"profile-website-body\" target=\"new\"> https://www.peellawfirm.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://peellawfirm.com/blog/?refPageViewId=6c43e362f70e0a2e\"> https://peellawfirm.com/blog/ </a>"
        },
        {
            "lawyersAtPeelLawFirmSelectedForASuperLawyers®List": "<ul><li> Peel, David Britton <a href=\"/profile/lawyer/david-britton-peel/tn/millington/Mjg0Mzc1NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Motor Vehicle Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/peel-law-firm/tn/millington/MTUzMjUxN18x/PP?refPageViewId=6c43e316d631036a",
    "description": "<p align=\"left\">If you suffered an injury or loss caused by another party's negligence or wrongdoing, you likely have many questions concerning your situation and your future. How will you pay for the medical expenses? How will you cover the wages you lost from the time you missed from work? Did the insurance company offer you a fair settlement?</p><p align=\"left\">For help answering these questions, you can turn to the legal professionals at the Peel Law Firm in Millington, Tennessee. After we analyze your situation, we will offer the sound advice you need to make the best informed decisions about your case, and we will be there to fight aggressively on your behalf to ensure you receive the maximum amount of compensation possible.</p><p align=\"left\">Serving clients throughout the Memphis metro region and all across Shelby, Tipton and Lauderdale counties, our law firm has achieved notable success helping our plaintiff clients secure the finances they need to support themselves and their families while they focus on their recovery.</p><p align=\"left\">Our founder, David Peel, has more than 20 years of legal experience, and to date, our law firm has secured millions of dollars in settlements and awards, earning our membership into the Million Dollar Advocates Forum and our reputation as one of the top personal injury practices in the region.</p><p align=\"left\">Whether your suffering is the result of a motor vehicle accident that was not your fault, a work-related accident or some other preventable tragedy, you can rely on the Peel Law Firm for the top-notch counsel and representation you deserve. To discuss your situation free of charge, you can contact our law office to schedule a free initial consultation.</p>"
}