{
    "companyName": "Mintz Law Firm - Lakewood, CO",
    "address1": "605 Parfet Street",
    "address2": "Suite 102",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80215",
    "website": "http://www.mintzlawfirm.com",
    "phone": "720-644-1208",
    "fax": "303-233-8999",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1167705/pid_1/mintz_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Car Accidents|Truck Accidents|Workers' Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.mintzlawfirm.com?refPageViewId=6bb1a77cd4cb21d3\" class=\"profile-website-body\" target=\"new\"> http://www.mintzlawfirm.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Car Accidents|Truck Accidents|Workers' Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/mintz-law-firm/co/lakewood/MTE2NzcwNV8x/PP?refPageViewId=6bb1a70640be09ba",
    "description": "<p>At Mintz Law Firm in Lakewood, Colorado, we devote our efforts to helping innocent accident victims who suffered an injury or loss caused by another party's negligence or wrongdoing as well as employees who are dealing with a work-related illness or injury. Serving clients throughout the Denver metro region and Jefferson County and the rest of the state, the attorneys at our law firm provide personalized, compassionate assistance and support to those facing legal challenges involving any of the following:</p><ul><li>Personal injury and wrongful death claims resulting from automobile and commercial truck accidents, motorcycle accidents, premises liability claims and slip-and-fall accidents, defective products, and other similar claims</li><li>Construction and workplace accidents</li><li>Workers' compensation claims</li></ul><p>Our founder, David J. Mintz, has more than 35 years of experience advocating on behalf of personal injury victims and disabled workers. Working alongside a team of dedicated and experienced attorneys, Mr. Mintz and our law firm can help you and your family recover the compensation and benefits you need to support yourself and your family.</p><p>Throughout our history, we have secured substantial settlements and awards on behalf of our clients, including several in excess of a million dollars, and we receive many referrals from satisfied clients.</p><p>For more information on how Mintz Law Firm can best serve you and your family during your time of need, you can contact our law office to schedule a free initial consultation. Working on a contingency basis, we will not collect a fee from you unless we help you obtain the compensation you deserve.</p><p>&nbsp;</p>"
}