{
    "companyName": "Douglass & Runger - Bartlett, TN",
    "address1": "2820 Summer Oaks Dr.",
    "address2": "",
    "city": "Bartlett",
    "state": "TN",
    "zip": "38134",
    "website": "https://www.douglassrunger.com",
    "phone": "901-472-4804",
    "fax": "901-372-8264",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4952687/pid_1/douglass_runger.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Probate and Estate Administration|Wills|Trusts"
        },
        {
            "languages": "English (Primary)|Spanish"
        },
        {
            "officeHours": "<p> Monday - Friday 9am - 5pm, Saturday 9am - 1 pm, Sunday Closed <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.douglassrunger.com?refPageViewId=6c43e33a56682227\" class=\"profile-website-body\" target=\"new\"> https://www.douglassrunger.com </a> (Douglass Runger Website)"
        }
    ],
    "practiceAreas": "Probate and Estate Administration|Wills|Trusts",
    "litigation": "",
    "languages": "English (Primary)|Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "<p> Monday - Friday 9am - 5pm, Saturday 9am - 1 pm, Sunday Closed <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/douglass--runger/tn/bartlett/NDk1MjY4N18x/PP?refPageViewId=6c43e316d631036a",
    "description": "<p>Located in Bartlett, Tennessee, Douglass &amp; Runger, Attorneys at Law, offers comprehensive legal services in several different practice areas in order to help our diverse range of clients with all of their important and serious legal matters. Serving the Memphis metro region and all of Shelby County and the surrounding areas, the attorneys at our law firm provide the personalized assistance and dependable representation our clients deserve when dealing with any of the following legal issues:</p><ul><li>Personal injury claims resulting from another party's negligence or wrongdoing</li><li>Estate planning and administration, including probate</li><li>Family law and divorce, including child custody and support, alimony, property division, and other related matters</li><li>Bankruptcy</li><li>Business formation and planning and commercial litigation</li><li>Criminal defense against all types of felony and misdemeanor charges</li></ul><p>Each of our attorneys is well-versed in his or her respective practice areas, and combined, we have decades of legal experience among us. With such an extensive amount of resources at our disposal, we can handle virtually any legal challenge our clients may face. Committed to ensuring our clients receive the highest level of legal service possible, we work closely with all we serve to help ensure we achieve the positive results our clients expect.</p><p>Through our client-centered approach, our law firm has helped thousands throughout our community by delivering effective solutions tailored to their specific needs and goals, and we are proud of the referrals we receive from satisfied clients. To find out how Douglass &amp; Runger, Attorneys at Law, can best help you, your family or your business with any legal matter you may have, you can contact our law firm to schedule an initial consultation.</p><p class=\"smallText\">We are a debt relief agency. We help people file for bankruptcy relief under the U.S. Bankruptcy Code.</p><p></p>"
}