{
    "companyName": "Wilt & Thompson, PLLC - Lexington, KY",
    "address1": "196 W Lowry Lane",
    "address2": "",
    "city": "Lexington",
    "state": "KY",
    "zip": "40503",
    "website": "https://www.wiltinjurylaw.com/",
    "phone": "800-675-4691",
    "fax": "502-253-9114",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5071784/pid_1/wilt_thompson_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice 60%|Birth Injury 20%|Personal Injury 10%|Brain Injury 10%"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.wiltinjurylaw.com/?refPageViewId=6bd93fdb10bf67d8\" class=\"profile-website-body\" target=\"new\"> https://www.wiltinjurylaw.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/wilt--thompson-pllc/ky/louisville/NTA2NzgzOV8x/PP\"> Wilt &amp; Thompson, PLLC </a> (Main Office) <span class=\"pp_card_street\"> 13113 Eastpoint Park Blvd. </span><span class=\"pp_card_street\"> Suite A </span><span class=\"pp_card_street\"><span>Louisville</span>, <span>KY</span><span> 40223 </span></span><span class=\"pp_card_street\"> 502-253-9110 </span></p>"
        },
        {
            "lawyersAtWilt&Thompson,PLLCSelectedForASuperLawyers®List": "<ul><li> Wilt, Ronald M. <a href=\"/profile/lawyer/ronald-m-wilt/ky/louisville/MTM1NDU5OF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice 60%|Birth Injury 20%|Personal Injury 10%|Brain Injury 10%",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/wilt--thompson-pllc/ky/lexington/NTA3MTc4NF8x/PP?refPageViewId=6bd93f546064370b#otherlocations",
    "description": "<p>Mistakes by medical providers result in serious injury, illness and even loss of life. Such mistakes can result in permanent suffering and the need for a lifetime care. This is especially true when dealing with birth injury and trauma.</p><p>The attorneys at Wilt &amp; Thompson, PLLC, in Louisville, know how to hold hospitals, clinics, medical providers and their insurers accountable for medical malpractice. We have extensive experience in the medical malpractice and personal injury areas. Due to our past experience representing hospitals, doctors and insurance companies in medical malpractice cases, we understand the approach that lawyers will take in defending these cases.</p><p>Our attorneys are seasoned litigators. We are capable of taking on the most challenging medical malpractice matters in court. The matters we try include birth injury, misdiagnosis or failure to diagnose, surgical error and prescription error cases. Besides medical malpractice, we also regularly represent plaintiffs in nursing home abuse cases, products liability cases and a wide variety of serious personal injury matters.</p><p>Our Kentucky law firm will handle your case with devotion and care. When taking on your case, we will devote substantial time and resources toward your matter. As soon as you retain our firm, we will begin investigation of your case and collect evidence favorable to you. We will do what is necessary to move your case forward.</p><p>Wilt &amp; Thompson, PLLC, has a reputation for providing honest and straightforward advice to those we represent. When taking on your case, we will pursue a strategy that best assures success. While we will negotiate for the best possible outcome for you, we are always prepared to take your case to trial when necessary. Wilt &amp; Thompson, PLLC, aggressively pursues your goals and fights for your right to adequate compensation.</p>"
}