{
    "companyName": "Kevin E. Donohoe Law Office - Hailey, ID",
    "address1": "101 East Buillion Street",
    "address2": "Suite 3H",
    "city": "Hailey",
    "state": "ID",
    "zip": "83333",
    "website": "https://kevindonohoe.com/",
    "phone": "877-788-8045",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5073373/pid_1/kevin_e_donohoe_law_office.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://kevindonohoe.com/?refPageViewId=6bb1d0c3c1601287\" class=\"profile-website-body\" target=\"new\"> https://kevindonohoe.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/kevin-e-donohoe-law-office/id/hailey/NTA3MzM3M18x/PP?refPageViewId=6bb1d0acc4d767d8",
    "description": "<p>The Kevin E. Donohoe Law Office never represents insurance companies. We represent injured parties or their survivors. Because the opposition has never been our clients, the people we represent feel more comfortable placing their trust in our team.</p><p><strong>The areas we practice in</strong></p><p>We are personal injury attorneys, but this field is a lot broader than many people realize. These are some of the cases we handle on behalf of our clients:</p><blockquote style=\"margin: 0px 0px 0px 40px; border: none; padding: 0px\"><p></p><ul><li>Truck and car accidents: When collisions are caused by a negligent party, we represent their victims or survivors to secure compensation.</li><li>Workers' compensation: Our law office helps injured workers pursue medical treatment and secure compensation for injuries.</li><li>Construction site accidents: When construction workers suffer injuries on the site, we help them secure damages.</li><li>Commercial premises liability: People who suffer injuries at businesses they do not work at rely on us to hold the responsible party accountable.</li><li>Medical negligence: We represent injured parties or their survivors in cases where people suffer injuries at medical facilities.</li></ul><p></p></blockquote><p><strong>How we choose cases</strong></p><p>Kevin E. Donohoe Law Office would love to accept every personal injury case that comes our way, but we take some time evaluating each one. If we accept your case, then you know we truly believe we have an honest chance of winning and securing the compensation you deserve. There is no cost for the initial meeting and if we choose not to take your case, we will refer you to other personal injury lawyers we believe will serve you well.</p>"
}