{
    "companyName": "Rabb & Rabb, PLLC - Flagstaff, AZ",
    "address1": "822 N Humphreys Street",
    "address2": "",
    "city": "Flagstaff",
    "state": "AZ",
    "zip": "86001",
    "website": "https://1stinjurylaw.com",
    "phone": "928-226-2881",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5129754/pid_1/rabb_rabb_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accident, Injury|Railroad Law|FELA"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://1stinjurylaw.com?refPageViewId=6ba8842c640809da\" class=\"profile-website-body\" target=\"new\"> https://1stinjurylaw.com </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/rabb--rabb-pllc/az/tucson/NTAxMzcxOF8x/PP\"> Rabb &amp; Rabb, PLLC </a> (Main Office) <span class=\"pp_card_street\"> 7442 N La Cholla Blvd </span><span class=\"pp_card_street\"><span>Tucson</span>, <span>AZ</span><span> 85741 </span></span><span class=\"pp_card_street\"> 520-888-6740 </span></p>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accident, Injury|Railroad Law|FELA",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5129754_1?refPageViewId=6ba88407a58f21e7",
    "description": "<p><font size=\"2\">Located in Flagstaff, Arizona, Rabb &amp; Rabb Injury Law, PLLC, offers exceptional advocacy and support to those who suffered an injury or lost a loved one as the result of a workplace accident or through an accident caused by someone else's negligent, careless or unlawful actions. We are a family run practice, and we promise to treat you as a member of our own as we aggressively pursue the favorable outcomes you deserve for your serious injury claims.</font></p><p style=\"margin: 8px 0px\"><font size=\"2\">In addition to our Flagstaff office, our law firm has another location in Tucson, and we serve the rights and entitlements of innocent accident victims and their families all across the Southwest, including Texas, Colorado, New Mexico and California. Through our success, we have become one of the region's leading practices for those who are facing serious and complex legal challenges involving all types of personal injury and wrongful death claims, railroad workers' injury claims, medical malpractice claims, and more. </font></p><p style=\"margin: 8px 0px\"><font size=\"2\">Over the course of our law firm's history, we have recovered millions of dollars in settlements and awards for our plaintiff clients, and we have earned numerous awards and honors for our impeccable professionalism and service. Among our most notable accolades, we have received recognition from Best Lawyers®, and the National Trial Lawyers has voted us among the Top 100 Trial Lawyers in the country. </font></p><p style=\"margin: 8px 0px\"><font size=\"2\">To find out more about how Rabb &amp; Rabb Injury Law, PLLC, can best serve your needs and help you secure a brighter future for yourself and your family, you can contact our office by phone or through our law firm's website to schedule a free initial consultation.</font></p><p></p><p style=\"margin: 0px\"><font face=\"Calibri\" size=\"2\">Best Lawyers® and The Best Lawyers in America© are registered trademarks of BL Rankings, LLC d/b/a Best Lawyers and Co., LLC. The names, logo, and database are protected under the trademark, copyright, and fair use laws of the United States of America. Any use of name, including in electronic form, must be made only by permission and under the guidelines of BL Rankings, LLC d/b/a Best Lawyers and Co., LLC.</font></p><p></p>"
}