{
    "companyName": "Lauderdale, Thompson and Warby, LLP - Annapolis, MD",
    "address1": "1125 West Street",
    "address2": "Suite 319",
    "city": "Annapolis",
    "state": "MD",
    "zip": "21401",
    "website": "http://www.ltwlegal.com",
    "phone": "888-499-6986",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4880464/pid_1/lauderdale_thompson_and_warby_llp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Law|DUI"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.ltwlegal.com?refPageViewId=6bd9d34e47d85724\" class=\"profile-website-body\" target=\"new\"> http://www.ltwlegal.com </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/4995595_1\"> Lauderdale, Thompson and Warby, LLP </a><span class=\"pp_card_street\"> 9701 Apollo Drive </span><span class=\"pp_card_street\"> Suite 301 </span><span class=\"pp_card_street\"><span>Largo</span>, <span>MD</span><span> 20774 </span></span><span class=\"pp_card_street\"> 888-499-6986 </span></p>"
        }
    ],
    "practiceAreas": "Criminal Law|DUI",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lauderdale-thompson-and-warby-llp/md/annapolis/NDg4MDQ2NF8x/PP?refPageViewId=6bd9d316014c67e4",
    "description": "<p><strong>Lauderdale, Thompson &amp; Warby, LLP: Fighting For You</strong></p><p>At Lauderdale, Thompson &amp; Warby, LLP, we pride ourselves in providing zealous advocacy to our clients. Our clients’ concerns are our concerns. You can count on our attorneys to provide you with professional and aggressive representation whether you have had an accident, work injury, or you have been accused of a crime or traffic offense. Lauderdale, Thompson &amp; Warby, LLP, is a litigation firm with practices areas in, among others, personal injury, torts, criminal defense, traffic defense, DUI/DWI defense, workman’s compensation, protective order law, juvenile delinquency defense and Child in Need of Assistance law. With offices in Largo, Annapolis and Waldorf, Lauderdale, Thompson &amp; Warby, LLP serves the entire State of Maryland.</p><p>When you suffer an injury, it can be a painful and stressful experience. Between hospitalization, visits to the doctor, and missing work, you have too much to deal with to also have to worry about protecting your legal rights. That is where Lauderdale, Thompson and Warby can help. Our attorneys will stand by your side. Whether you have had a personal injury, vehicle accident, or work injury, we can help you get the compensation you deserve and keep the collection agents off your back while you recover. You should never try to deal with an insurance company on your own. There is no fee unless we get you compensation, so why not call us today?</p><p>When you have been accused of a crime, it is a frightening experience. A lot is at stake, and even a conviction for a misdemeanor can have lasting consequences. You are facing a legal battle that may change the course of your life, and you are up against a prosecution team backed by the resources of the government with one single purpose - to get a conviction. The attorneys at Lauderdale, Thompson and Warby believe that you are innocent until proven guilty, and we will fight our hardest to make sure that the State is not able to convict you. Our attorneys have handled cases ranging from the smallest citations to serious felonies in which our clients have faced life in prison. Let us put our experience to work for you. Contact us now for aggressive representation.</p><p>Whatever your legal issue, contact the attorneys at Lauderdale, Thompson &amp; Warby, LLP. Our team of attorneys stand ready to help you.</p><p></p>"
}