{
    "companyName": "BrienRoche Law - Alexandria, VA",
    "address1": "4607 Newcombe Pl.",
    "address2": "",
    "city": "Alexandria",
    "state": "VA",
    "zip": "22304",
    "website": "http://www.brienrochelaw.com",
    "phone": "703-584-7210",
    "fax": "703-790-9462",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5043759/pid_1/brienroche_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Slip &amp; Fall|Premises Liability|Drug Injuries|Professional Liability|Nursing Home|Construction Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.brienrochelaw.com?refPageViewId=6c4b2c05333102d2\" class=\"profile-website-body\" target=\"new\"> http://www.brienrochelaw.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.brienrochelaw.com/blog/?refPageViewId=6c4b2c05333102d2\"> http://www.brienrochelaw.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/brien-roche-law/va/mclean/MTQ4OTE5Nl8x/PP\"> Brien Roche Law </a> (Main Office) <span class=\"pp_card_street\"> 8355 Greensboro Dr. </span><span class=\"pp_card_street\"><span>McLean</span>, <span>VA</span><span> 22102 </span></span><span class=\"pp_card_street\"> 703-584-7210 </span></p>"
        },
        {
            "lawyersAtBrienRocheLawSelectedForASuperLawyers®List": "<ul><li> Roche, Brien A. <a href=\"/profile/lawyer/brien-a-roche/va/mclean/MTE2NDgyM18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Slip &amp; Fall|Premises Liability|Drug Injuries|Professional Liability|Nursing Home|Construction Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/brienroche-law/va/alexandria/NTA0Mzc1OV8x/PP?refPageViewId=6c4b2bc3f7601287#otherlocations",
    "description": "<p><strong><strong>High-Level Advocacy For Innocent Accident Victims</strong></strong></p><p>Located in Alexandria, Virginia, BrienRoche Law offers personalized, effective representation to those who suffered an injury or lost a loved one due to another party's negligence or wrongdoing. </p><p>Attorney Brien Roche, our law firm's founder, serves clients throughout all of Northern Virginia and the Washington, D.C., metro region, as well as the surrounding areas of Maryland, by delivering the highest level of legal advocacy possible for those in need. </p><p><strong>Handling All Types Of Personal Injury And Negligence Claims</strong></p><p>Whether your legal claim involves a motor vehicle accident, a defective product, medical malpractice or some other claim of negligence, you can trust Mr. Roche and our law firm to handle the demands of your case regardless of the complexities involved. </p><p><strong>A Recognized Leader In The Field</strong></p><p>Recognized as one of the premiere personal injury attorneys in the region, Mr. Roche has received high ratings from our clients, earning his Top Attorney rating on AVVO. Additionally, he has earned the respect of his peers as evidenced by his AV Preeminent peer review rating* from Martindale-Hubbell. </p><p>In addition, Mr. Roche is an accomplished author who has written several books and articles related to trial tactics, tort law and basic legal knowledge.</p><p>Possessing over 40 years of professional legal experience and having once served as an insurance defense lawyer, Mr. Roche has a unique insight into the tactics insurance companies use to reduce or deny claims. Armed with this knowledge, he can devise the most effective strategies possible to secure the compensation and benefits our clients deserve. </p><p><strong>Devoted To Helping You And Your Family</strong></p><p>Considering how your situation can adversely affect your life and your future, you need the best possible advocate on your side to help you secure the maximum amount for your losses, as well as your pain and suffering. To find out more about how BrienRoche Law can best serve your needs, you can contact our law firm to schedule a free initial consultation.</p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards. "
}