{
    "companyName": "Bankruptcy Advocates - Carbondale, IL",
    "address1": "308 W Walnut St.",
    "address2": "",
    "city": "Carbondale",
    "state": "IL",
    "zip": "62901",
    "website": "https://www.sidebtfree.com",
    "phone": "618-353-1060",
    "fax": "618-549-9805",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5216153/pid_1/bankruptcy_advocates.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Bankruptcy|Medical Malpractice"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> Weekend and Evening Appointments Available <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.sidebtfree.com?refPageViewId=6bcbcc00a2aa09da\"> https://www.sidebtfree.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.sidebtfree.com/blog.html?refPageViewId=6bcbcc00a2aa09da\"> http://www.sidebtfree.com/blog.html </a>"
        }
    ],
    "practiceAreas": "Bankruptcy|Medical Malpractice",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Weekend and Evening Appointments Available <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/bankruptcy-advocates/il/carbondale/NTIxNjE1M18x/PP?refPageViewId=6bcbcbe0b402030a",
    "description": "<p>When oppressive debt threatens individuals’ financial well-being and peace of mind, the law office of Darrell Dunham in Carbondale, Illinois, can guide them toward secure relief through bankruptcy. Bankruptcy is not the taboo process that many individuals make it out to be. Rather, it is a legal way to wipe out most debts and put an end to harassing collections efforts. With the help of bankruptcy, debtors can stop wage garnishments, halt repossession proceedings and stall foreclosure efforts. What is more, bankruptcy helps individuals gain a fresh financial start after which they can rebuild their credit and access new, more affordable loans within just a few years.</p><p class=\"MsoNormal\"><span>Our law office strives to help individuals who find themselves in tough personal situations, regardless of the cause. When personal injuries turn clients’ personal and financial lives upside down, we advocate on their behalf for the compensation they need to pay off medical expenses, make up for lost wages and live comfortably while they heal. Types of cases we competently handle include those involving medical malpractice, birth injuries and animal bites.</span></p><p class=\"MsoNormal\"><span>With over 40 years of experience, attorney Darrell Dunham is intimately familiar with the U.S. Bankruptcy Code and tort law. In addition to representing clients throughout southern Illinois, Mr. Dunham has also served as a law professor, arbitrator and mediator. He is admitted to practice in both federal and state courts, and lawyers from throughout the U.S. routinely turn to him for advice.</span></p><p class=\"MsoNormal\"><span>Mr. Dunham differentiates himself by incorporating his Christian faith into our law office, which he feels better enables him to obtain morally right outcomes. We want clients to feel comfortable with our team and our approach, which is why we offer free initial consultations.</span></p><p class=\"MsoNormal\">We are a debt relief agency. We help people file for bankruptcy relief under the U.S. Bankruptcy Code.</p>"
}