{
    "companyName": "Naumes Law Group, LLC - Milton, MA",
    "address1": "2 Granite Ave",
    "address2": "#425",
    "city": "Milton",
    "state": "MA",
    "zip": "02186",
    "website": "https://www.naumeslaw.com/",
    "phone": "617-982-0064",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4985602/pid_1/naumes_law_group_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Federal Employers Liability Act 80%|Products Liability 10%|Personal Injury 10%"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "languages": "English (Primary)"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> M-F 9am-5pm <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.naumeslaw.com/?refPageViewId=6be1a08ad6c567c9\" class=\"profile-website-body\" target=\"new\"> https://www.naumeslaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.injurylawyer.pro?refPageViewId=6be1a08ad6c567c9\"> http://www.injurylawyer.pro </a>"
        },
        {
            "lawyersAtNaumesLawGroup,LLCSelectedForASuperLawyers®List": "<ul><li> Naumes, Christopher C. <a href=\"/profile/lawyer/christopher-c-naumes/ma/milton/NDEyNjMwMV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Naumes, Robert T. <a href=\"/profile/lawyer/robert-t-naumes/ma/milton/MTA4NzkyNF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Federal Employers Liability Act 80%|Products Liability 10%|Personal Injury 10%",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "English (Primary)",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> M-F 9am-5pm <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/naumes-law-group-llc/ma/milton/NDk4NTYwMl8x/PP?refPageViewId=6be19fe4a6f567cc",
    "description": "<p>At the Naumes Law Group in Boston, Massachusetts, we have been protecting the rights and entitlements of our clients for more than 35 years. Serving individuals and families throughout the state, the attorneys at our law firm possess decades of combined legal experience, enabling us to deliver the highest level of advocacy and support possible to those dealing with legal challenges involving any of the following:</p><p>• Railroad injuries and FELA claims</p><p>• Occupational injuries and diseases, including asbestos exposure and other toxic torts</p><p>• Product liability claims involving dangerous and defective medical devices and medication, such as IVC filters, Xarelto, ailments caused by talc powder and more</p><p>• Consumer fraud</p><p>• Whistleblower claims</p><p>• Class action lawsuits</p><p>• All other types of serious personal injury and wrongful death claims arising from someone else's negligence or wrongdoing</p><p>An attorney since 1978, our founder, Bob Naumes, has helped thousands of innocent victims find the justice they seek for their injuries and losses resulting from a preventable tragedy. After working with some of the largest and most prestigious law firms in the region, Mr. Naumes established our practice alongside his son, Christopher, in order to better serve those in need throughout our community.</p><p>Since that time, we have secured millions of dollars in settlements and awards on behalf of our plaintiff clients, and our attorneys have received numerous awards and honors for our professionalism and service, including Bob Naumes' AV Preeminent peer-review rating* through Martindale-Hubbell and recognition from The National Trial Lawyers as being among the top trial attorneys in the country.</p><p>To begin receiving the experienced, compassionate representation you need from a local attorney you can trust, you can contact the Naumes Law Group to schedule a free initial consultation. For most of our cases, we work on a fee-contingency basis, which means you will owe us nothing unless we recover compensation on your behalf.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}