{
    "companyName": "Sam Masters Legal - Daytona Beach, FL",
    "address1": "444 Seabreeze Blvd.",
    "address2": "Suite 1001",
    "city": "Daytona Beach",
    "state": "FL",
    "zip": "32118",
    "website": "http://www.sammasterslegal.com",
    "phone": "386-661-8795",
    "fax": "386-253-7352",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5182436/pid_1/sam_masters_legal.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Law|DUI|Drug|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.sammasterslegal.com?refPageViewId=6b47b59ba7a8127b\" class=\"profile-website-body\" target=\"new\"> http://www.sammasterslegal.com </a>"
        }
    ],
    "practiceAreas": "Criminal Law|DUI|Drug|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/sam-masters-legal/fl/daytona-beach/NTE4MjQzNl8x/PP?refPageViewId=6b47b47c95ec67e0",
    "description": "<p class=\"MsoNormal\"><span>Top-rated and award-winning trial attorney Sam N. Masters is the founder and owner of his law office, Sam Masters Legal, in Daytona Beach, Florida. Possessing more than 35 years of legal experience, Mr. Masters provides exceptional advocacy and support to clients throughout Volusia County and beyond who have legal needs involving any of the following:</span></p><p class=\"BulletStyle\"><!--[if !supportLists]--><span style=\"font-family: Symbol\">·<span style=\"line-height: normal; font-family: 'Times New Roman'; font-size: 7pt; font-stretch: normal\"></span></span><span>Criminal defense for DUI and all other types of felonies and misdemeanors</span></p><p class=\"BulletStyle\"><!--[if !supportLists]--><span style=\"font-family: Symbol\">·<span style=\"line-height: normal; font-family: 'Times New Roman'; font-size: 7pt; font-stretch: normal\"></span></span><span>Personal injury and wrongful death claims arising from motor vehicle accidents, neck, back and brain injuries, children's injuries, and other preventable tragedies</span></p><p class=\"MsoNormal\"><span>A native of the area, Mr. Masters has a genuine concern for the legal issues that affect the members of his community. He has achieved a long record of success helping his clients obtain the favorable outcomes for their serious and pressing legal challenges. Having once served as a prosecutor in Volusia County, he has invaluable insight into the criminal justice system from both sides, which enables him to devise the most effective defense strategies possible for the accused.</span></p><p class=\"MsoNormal\"><span>Equally effective as a trial advocate, he has recovered millions of dollars in total compensation for his plaintiff clients who are suffering needlessly through no fault of their own. His law firm has become the trusted source for quality, professional representation to clients across his region who seek the highest level of counsel to increase their chances of obtaining the justice they deserve.</span></p><p class=\"MsoNormal\"><span>A leader in various local, state and national legal organizations, Mr. Masters delivers the most relevant, up-to-date advice to those he serves, and he has earned an AV Preeminent peer review rating* from Martindale-Hubbell along with many other top rankings from his peers as well as many testimonials and referrals from his satisfied clients.</span></p><p class=\"MsoNormal\"><span>To find out more about how Mr. Masters and Sam Masters Legal can best assist you and your loved ones during this very difficult and uncertain time in your life, you can call his office or visit his law firm's website to schedule a free initial consultation.</span></p><p class=\"MsoNoSpacing\"><span>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating™ fall into two categories – legal ability and general ethical standards.</span></p>"
}