{
    "companyName": "Gilbert Law Offices PA - Bangor, ME",
    "address1": "82 Columbia Street",
    "address2": "",
    "city": "Bangor",
    "state": "ME",
    "zip": "04401",
    "website": "http://www.yourlawpartner.com",
    "phone": "207-307-2947",
    "fax": "207-941-9871",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1804361/pid_1/gilbert_law_offices_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Car Accident cases|Employment Law- Employee"
        },
        {
            "previousLawFirmName": "<ul><li> Gilbert and Heitmann, December 1, 1990</li></ul>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.yourlawpartner.com?refPageViewId=6bd995a7e3f50314\" class=\"profile-website-body\" target=\"new\"> http://www.yourlawpartner.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Car Accident cases|Employment Law- Employee",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/gilbert-law-offices-pa/me/bangor/MTgwNDM2MV8x/PP?refPageViewId=6bd9957a552b21f9",
    "description": "<p>For more than 30 years, the attorneys at Gilbert Law Offices PA have assisted individuals in Bangor and throughout Maine with their most pressing legal matters. We specialize in personal injury and employment law, and our approach is collaborative. To best serve our clients, it is important to us that we come to know them personally.</p><p>In matters of personal injury, our lawyers provide assertive and effective counsel. We understand that, for many, suffering an injury is a trying ordeal. You are in pain. You may be unable to work. Costs associated with medical insurance and doctors’ fees add up quickly. It is important to hold liable the parties responsible for your injury — and this is what we will strive to do. We are familiar with the insurance companies. We maintain relationships with doctors and other experts. While many cases settle, we are always prepared to go to trial. We are ready to fight to protect you.</p><p>Gilbert Law Offices PA also offers representation in disputes arising between employees and their employers. Ensuring that work environments are safe, unbiased spaces for workers is a priority for us. We have developed a reputation for providing aggressive counsel in cases where an individual has endured workplace mistreatment. We have assisted in many cases stemming from wrongful termination, violations of wage and hour laws, and violations of family and medical leave. No matter the case, we are determined in our efforts to safeguard our clients’ rights.</p>"
}