{
    "companyName": "Dickson Law Office, PLLC - Burlington, VT",
    "address1": "P.O. Box 1266",
    "address2": "86 St. Paul St., Suite 205",
    "city": "Burlington",
    "state": "VT",
    "zip": "05402",
    "website": "http://www.dicksonlawvt.com",
    "phone": "802-448-8742",
    "fax": "802-243-0646",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4950108/pid_1/dickson_law_office_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Workers' Compensation|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.dicksonlawvt.com?refPageViewId=6c45b24e639809f2\" class=\"profile-website-body\" target=\"new\"> http://www.dicksonlawvt.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.dicksonlawvt.com/blog?refPageViewId=6c45b24e639809f2\"> http://www.dicksonlawvt.com/blog </a> (VT Workers' Comp Blog)"
        }
    ],
    "practiceAreas": "Workers' Compensation|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/dickson-law-office-pllc/vt/burlington/NDk1MDEwOF8x/PP?refPageViewId=6c45b21923ab030a",
    "description": "<p>Jeff Dickson is the founder and managing attorney at Dickson Law Office, PLLC, located in Burlington, Vermont. Jeff devotes his time and resources to helping injured workers and innocent accident victims obtain the compensation and benefits they need to support themselves and their families. Jeff serves clients throughout Vermont, delivering personalized and dependable legal representation to those dealing with any of the following legal challenges:</p><ul><li>Workers' compensation, including temporary disability and permanent disability benefits, medical benefits, vocational rehabilitation benefits and death benefits</li><li>Personal injury and wrongful death claims resulting from car, truck and motorcycle accidents, dangerous property conditions and slip-and-fall accidents, and other claims involving negligence or wrongdoing</li></ul><p>A Vermont native, Jeff genuinely cares about the legal issues that affect the members of his community. Jeff established Dickson Law Office, PLLC, with a mission to provide the highest level of assistance and support to those in need. Jeff is fully committed to his clients' needs and concerns and will remain in close contact with you throughout any legal proceedings to ensure he helps you recover the damages you incurred so that you can focus on your recovery.</p><p>Jeff has earned a reputation as one of the top personal injury and workers' compensation attorneys in the region, and he receives many referrals from satisfied clients. To find out more about how Dickson Law Office, PLLC, can best help you and your family, contact Dickson Law Office to schedule a free initial consultation. </p>"
}