{
    "companyName": "Rabb & Rabb, PLLC - Tucson, AZ",
    "address1": "7442 N La Cholla Blvd",
    "address2": "",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85741",
    "website": "https://1stinjurylaw.com/",
    "phone": "520-888-6740",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5013718/pid_1/rabb_rabb_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accident, Injury|Railroad Law|FELA"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://1stinjurylaw.com/?refPageViewId=6ba8831cc0b50329\" class=\"profile-website-body\" target=\"new\"> https://1stinjurylaw.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/5129754_1\"> Rabb &amp; Rabb, PLLC </a><span class=\"pp_card_street\"> 822 N Humphreys Street </span><span class=\"pp_card_street\"><span>Flagstaff</span>, <span>AZ</span><span> 86001 </span></span><span class=\"pp_card_street\"> 928-226-2881 </span></p>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accident, Injury|Railroad Law|FELA",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/rabb--rabb-pllc/az/tucson/NTAxMzcxOF8x/PP?refPageViewId=6ba882fe306c0318",
    "description": "<p>At Rabb &amp; Rabb Injury Law, PLLC, in Tucson, Arizona, we focus our practice exclusively on helping innocent accident victims and their families recover the full amount of compensation they deserve for the injuries and losses they suffered as the result of a workplace accident or because of someone else's negligence or wrongdoing. </p><p>With an additional law office in Flagstaff, we are one of the region's leading injury practices, and we advocate on behalf of plaintiff clients throughout Arizona, as well as Texas, Colorado, New Mexico and California, to those who have legal needs involving any of the following:</p><p>• Personal injury<br>• Vehicle accidents<br>• Railroad workers' accidents<br>• Medical malpractice</p><p>Led by the father-and-son legal team of attorneys Lloyd \"Chip\" Rabb III and Matthew L. Rabb, we are a family run law firm that promises to treat you with the same care and respect we would a member of our own family. Although compassionate when dealing with those we serve, we will aggressively pursue the most favorable outcome on your behalf both inside and outside the courtroom to help you obtain the justice you seek and secure a brighter future for yourself and your loved ones.</p><p>Recognized for our success and impeccable professionalism, we have received many awards and honors, including recognition from Best Lawyers®, and the National Trial Lawyers has voted us among the Top 100 Trial Lawyers in the country. Local, experienced and dedicated to your needs, the attorneys at Rabb &amp; Rabb Injury Law, PLLC, are here to do whatever we can to help you during this difficult and uncertain time in your life. </p><p>For more information, you can call our law office or visit our website to schedule a free initial consultation concerning your matter.</p><p>Best Lawyers® and The Best Lawyers in America© are registered trademarks of BL Rankings, LLC d/b/a Best Lawyers and Co., LLC. The names, logo, and database are protected under the trademark, copyright, and fair use laws of the United States of America. Any use of name, including in electronic form, must be made only by permission and under the guidelines of BL Rankings, LLC d/b/a Best Lawyers and Co., LLC.</p>"
}