{
    "companyName": "Matt Schalk, Attorney, PLLC - Princeton, KY",
    "address1": "111 West Court Square",
    "address2": "",
    "city": "Princeton",
    "state": "KY",
    "zip": "42445",
    "website": "http://www.schalklaw.com/",
    "phone": "270-594-1924",
    "fax": "270-896-5025",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5130515/pid_1/matt_schalk_attorney_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Defense|Personal Injury|Social Security Disability Appeals"
        },
        {
            "litigation": "<ul><li>30%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.schalklaw.com/?refPageViewId=6bd946f1a56c5736\" class=\"profile-website-body\" target=\"new\"> http://www.schalklaw.com/ </a>"
        }
    ],
    "practiceAreas": "Criminal Defense|Personal Injury|Social Security Disability Appeals",
    "litigation": "<ul><li>30%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/-matt-schalk-attorney-pllc/ky/princeton/NTEzMDUxNV8x/PP?refPageViewId=6bd9467ae300030a",
    "description": "<p>Located in Princeton, Kentucky, the law office of Matt Schalk, Attorney, PLLC, provides exceptional representation and support in the areas of <strong><font size=\"3\">Criminal Defense, Personal Injury, Social Security Disability Appeals</font></strong> and more.</p><p>Serving clients in the counties of Caldwell, Lyon, Trigg, Christian, Crittenden, McCracken and the surrounding areas, attorney Matt Schalk has practiced law since 2005 after obtaining his Juris Doctor from Northern Kentucky University's Salmon P. Chase College of Law. Bringing more than 13 years of legal experience to the table, Mr. Schalk promises to do whatever he can to help you resolve your matter and achieve the most favorable outcome possible for your situation efficiently and cost-effectively.</p><p>Whether your legal challenge relates to a recent arrest or you seek justice in the wake of an injury or a loss you suffered as the result of someone else's negligence, you can turn to Mr. Schalk and his law firm to help you protect your rights, preserve your liberties and entitlements, and secure a brighter future for yourself and your loved ones. In addition, he can help you appeal a denied Social Security Disability claim and advocate on your behalf in matters involving contract litigation and other tortious claims.</p><p>For more information on how Mr. Schalk can best serve your important and pressing legal issues, you can contact his law office, Matt Schalk, Attorney, PLLC, to schedule a free initial consultation.</p>"
}