{
    "companyName": "Gary Roberts & Associates - West Palm Beach, FL",
    "address1": "1601 Belvedere Rd.",
    "address2": "Suite 500 S",
    "city": "West Palm Beach",
    "state": "FL",
    "zip": "33406",
    "website": "https://www.westpalmbeach-injurylawyers.com/",
    "phone": "561-945-8936",
    "fax": "561-686-1533",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5235272/pid_1/gary_roberts_associates.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.westpalmbeach-injurylawyers.com/?refPageViewId=6b34e7dd757e67bd\" class=\"profile-website-body\" target=\"new\"> https://www.westpalmbeach-injurylawyers.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.westpalmbeach-injurylawyers.com/blog/?refPageViewId=6b34e7dd757e67bd\"> https://www.westpalmbeach-injurylawyers.com/blog/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/gary-roberts--associates/fl/west-palm-beach/NTIzNTI3Ml8x/PP?refPageViewId=6b34e78070e709e6",
    "description": "<p>From our law office in West Palm Beach, Florida, the attorneys at Gary Roberts &amp; Associates provide unmatched advocacy and support to clients across our region who suffered a serious injury or lost a loved one as the result of someone else's negligence or wrongdoing.</p><p>Regarded as one of South Florida's premier personal injury law firms, we have achieved remarkable success fighting for the rights and entitlements of innocent accident victims and their families.<br><br>Over the course of our history, we have recovered millions of dollars in total compensation for our plaintiff clients adversely affected by medical malpractice, motor vehicle accidents and other preventable tragedies. We have also handled numerous claims involving Zantac medication and other dangerous pharmaceuticals.<br><br>Gary Roberts &amp; Associates has a long history of securing multimillion-dollar settlements and verdicts, and our lawyers have earned AV Preeminent peer review ratings* from Martindale-Hubbell along with many other top rankings and endorsements from our peers.</p><p>One of the things that really sets our law firm apart from other personal injury practices is that we have on our staff trial lawyers with extensive medical backgrounds, including a board-certified neurosurgeon, so we can better address the medical aspects of your claim and hold those responsible for your suffering accountable for their actions.</p><p>To begin the process, you can contact Gary Roberts &amp; Associates to take advantage of our law firm's free initial consultation. We promise to do all we can to help you obtain the maximum amount of compensation you need and the justice you deserve.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}