{
    "companyName": "The Law Offices of John C. Manoog III - Hyannis, MA",
    "address1": "450 South St.",
    "address2": "",
    "city": "Hyannis",
    "state": "MA",
    "zip": "02601",
    "website": "https://www.manooglaw.com/",
    "phone": "877-821-6968",
    "fax": "508-775-0176",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1568414/pid_1/the_law_offices_of_john_c_manoog_iii.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Criminal Defense|Motor Vehicle Accident|Medical Malpractice|Premises Liability|Products Liability|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.manooglaw.com/?refPageViewId=6be03629572c09c6\" class=\"profile-website-body\" target=\"new\"> https://www.manooglaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.capecodinjurylawyerblog.com/?refPageViewId=6be03629572c09c6\"> https://www.capecodinjurylawyerblog.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/the-law-offices-of-john-c-manoog-iii/ma/plymouth/NDQ1OTUwNV8x/PP\"> The Law Offices of John C. Manoog III </a><span class=\"pp_card_street\"> 18 Main Street Extension </span><span class=\"pp_card_street\"> #201 </span><span class=\"pp_card_street\"><span>Plymouth</span>, <span>MA</span><span> 02360 </span></span><span class=\"pp_card_street\"> 877-821-6968 </span></p>"
        },
        {
            "lawyersAtTheLawOfficesOfJohnC.ManoogIIISelectedForASuperLawyers®List": "<ul><li> Manoog, John C. <a href=\"/profile/lawyer/john-c-manoog/ma/hyannis/Mjg1NTU2MV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Criminal Defense|Motor Vehicle Accident|Medical Malpractice|Premises Liability|Products Liability|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-law-offices-of-john-c-manoog-iii/ma/hyannis/MTU2ODQxNF8x/PP?refPageViewId=6be0360cd03a09d6#otherlocations",
    "description": "<p><strong>1. Hyannis, MA</strong></p><p>At the Law Offices of John C. Manoog III, our attorneys are there to deliver aggressive representation for victims of motor vehicle crashes in Hyannis, Massachusetts. With more than 140 years of combined legal experience, we have successfully helped clients involved in car, truck, motorcycle and bus accidents pursue compensation for damages. Although we are extremely skilled in negotiating comprehensive settlements, we are never afraid to stand up to insurance companies in litigation. Our knowledge and tenacity in the courtroom have yielded numerous results worth six and seven figures for past clients.</p><p>In addition to handling accidents on the road, our law office represents people who have experienced serious injuries or the wrongful death of a loved one due to medical malpractice, nursing home negligence, premises liability and products liability scenarios. Whether they were hurt by a dog bite, slip and fall, defective product or any other hazard, our attorneys help them obtain compensation to offset the cost of hospitalization, physical therapy, lost income and all future recovery needs.</p><p>Beyond providing counsel for general personal injuries, our workers’ compensation lawyers advocate for clients hurt on the job. In select cases, we also offer defense for people charged with misdemeanors and felonies, including drunk driving. Although we are located in Hyannis, we welcome cases from across Cape Cod and the Barnstable-Yarmouth metropolitan area of Massachusetts. The Law Offices of John C. Manoog III is pleased to offer a free initial consultation and candid case evaluation at our firm to all prospective clients.</p><p><strong>2. Plymouth, MA</strong></p><p>Regardless of the circumstances that led to an accident causing serious injuries or a wrongful death, the team at the Law Offices of John C. Manoog III is there to help. From our firm in Plymouth, Massachusetts, we assist our clients in pursuing settlements that cover the costs of medical treatment, hindered income and future needs. We regularly advocate for victims of motor vehicle accidents as well as those hurt by medical malpractice, premises liability and products liability incidents. Our attorneys also represent injured employees facing workers’ compensation conflicts.</p><p>At our law office, one of our key strengths is negotiating settlements that allow people to move on with life. In a recent case, we were able to obtain an offer of $1.25 million for a client who sustained catastrophic head injuries in a motorcycle crash. Our lawyers make every effort to resolve disputes in mediation and arbitration in order to avoid going to trial. In the event an offer does not meet our clients’ needs, however, we are fully prepared to bring matters into litigation.&nbsp;</p><p>When we are not helping clients recover from accidents and negligence, we are defending them against criminal charges. The legal team at the Law Offices of John C. Manoog III represents people with misdemeanor and felony allegations, including drunk driving. No matter what challenges prospective clients face or how complex their cases are, we invite them to join us at our firm for a free initial consultation. We welcome people from Hyannis as well as Cape Cod and the greater Barnstable-Yarmouth metropolitan area of Massachusetts.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>"
}