{
    "companyName": "Schmitt Law Firm, LLC - Kansas City, MO",
    "address1": "2600 Grand Blvd.",
    "address2": "Suite 380",
    "city": "Kansas City",
    "state": "MO",
    "zip": "64108",
    "website": "https://kansascitylawyers.com/",
    "phone": "816-400-1858",
    "fax": "816-389-4015",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4427028/pid_1/schmitt_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury -- Plaintiff"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://kansascitylawyers.com/?refPageViewId=6c0c3239e1f402e8\" class=\"profile-website-body\" target=\"new\"> https://kansascitylawyers.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://kansascitylawyers.com/blog/?refPageViewId=6c0c3239e1f402e8\"> https://kansascitylawyers.com/blog/ </a>"
        },
        {
            "lawyersAtSchmittLawFirm,LLCSelectedForASuperLawyers®List": "<ul><li> Schmitt, Ben <a href=\"/profile/lawyer/ben-schmitt/mo/kansas-city/MTkyMjMwOF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury -- Plaintiff",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/schmitt-law-firm-llc/mo/kansas-city/NDQyNzAyOF8x/PP?refPageViewId=6c0c31c531f1ef2e",
    "description": "<p>From our office in Kansas City, Missouri, the attorneys at the Schmitt Law Firm, LLC, provide unmatched advocacy and support to individuals and families across our region who suffered a serious injury or lost a loved one due to someone else's negligence or wrongdoing. </p><p>Focusing solely on plaintiff representation, our lawyers possess decades of combined legal experience. During our time in practice, we have recovered millions of dollars in total compensation for those adversely affected by construction accidents, motor vehicle accidents, 18-wheeler accidents, defective products, nursing home abuse, medical malpractice and other preventable tragedies. We also have extensive experience handling workers' compensation claims and appeals. </p><p>No matter the cause of your suffering, you can rely on us to sit with you and fully discuss your options to help you make the best-informed decisions as we fight aggressively to help you obtain the maximum amount of compensation you need to cover your medical bills, lost wages and other associated damages. </p><p>Our lawyers fully understand the stress and anxiety you are likely experiencing as a result of your unfortunate situation, and you can trust us to deliver the highly personalized counsel you deserve with the utmost compassion and integrity. Honored for our remarkable professionalism and service, U.S. World &amp; News Report voted our practice among the Best Law Firms for Personal Injury in the country. Furthermore, our lawyers have received the 10 Best in Client Satisfaction award from the American Institute of Personal Injury Attorneys. </p><p>To begin the process of securing a brighter, more financially stable future for yourself and your loved ones, you can reach out to the Schmitt Law Firm, LLC, by calling our office or visiting our website to receive a free evaluation of your claim. We also offer virtual consultations to help keep you and your family members safe and healthy in these uncertain times.</p>"
}