{
    "companyName": "Law Offices of Judy Snyder - Portland, OR",
    "address1": "1000 SW Broadway, Suite 2400",
    "address2": "",
    "city": "Portland",
    "state": "OR",
    "zip": "97205",
    "website": "https://www.jdsnyder.com",
    "phone": "503-894-7478",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2500127/pid_1/law_offices_of_judy_snyder.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Surgical Injuries|Wrongful Death|Hospital Errors|Errors in Diagnosis and Treatment|Employment Law|Wrongful Termination|Harassment|Civil Rights Enforcement|Legal Malpractice|Professional License|Defense|Suing The Government"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.jdsnyder.com?refPageViewId=6c435bdb03fd67da\"> https://www.jdsnyder.com </a>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Surgical Injuries|Wrongful Death|Hospital Errors|Errors in Diagnosis and Treatment|Employment Law|Wrongful Termination|Harassment|Civil Rights Enforcement|Legal Malpractice|Professional License|Defense|Suing The Government",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/2500127_1?refPageViewId=6c435bb7c32309de",
    "description": "<p><strong>About Us</strong></p><p>Whether advising a client about an employment contract or litigating a case against a private party or government entity on behalf of a client, we are known for our expertise in the fields of employment law, constitutional law, civil rights, professional negligence, catastrophic injury, wrongful death, sexual abuse law, professional licensure issues personal injury and emotional injury claims.</p><p>We represent employees and former employees in employment-related cases against private and government employers. We have successfully litigated cases for clients asserting claims of discrimination, retaliation, wrongful discharge, sexual harassment and assault as well as constitutional claims against employers who are government entities.</p><p>We represent the families of decedents in wrongful death lawsuits filed against individuals, businesses and government entities. We have represented clients in lawsuits arising as the result of airplane crashes, farming accidents, vehicle collisions, assaults and medical malpractice. The resolution of these claims resulted in significant financial recoveries for the families of the decedents.</p><p>We represent clients who have been injured due to the negligence (malpractice) of a licensed professional. We have successfully litigated numerous cases of professional negligence against physicians, psychologists, dentists, attorneys, naturopaths and other licensed professionals. We have experience addressing not only the economic losses associated with such negligence, but also the personal and psychological injuries experienced by our clients.</p><p>We represent clients whose constitutional rights have been violated by government entities. The constitutional violations we have asserted include free speech retaliation, procedural due process violations, equal protection violations, substantive due process claims, and fourth amendment claims. These cases have resulted in settlements or jury verdicts against local, county and state governmental bodies for violation of the constitutional rights of private individuals and of inmates at state and local facilities.</p><p>We represent students and their families in disputes and lawsuits against schools and other public and private organizations when injury has occurred to the child, or when a child’s rights have been violated. These cases have resulted in settlements or jury verdicts in favor of our clients. Such outcomes provide a means for the child to obtain continuing medical and/or psychological treatment relating to the injury.</p><p>We review and negotiate contracts for our clients, particularly employment contracts containing non-competition clauses and trade secret (confidentiality) clauses. We also review and negotiate severance agreements upon the termination of employment relationships.</p><p>In addition to representing our clients zealously, we serve our community by mentoring students and young attorneys and by engaging in volunteer and community service activities.</p>"
}