{
    "companyName": "Lupetin & Unatin, LLC - Pittsburgh, PA",
    "address1": "707 Grant Street",
    "address2": "Suite 3200",
    "city": "Pittsburgh",
    "state": "PA",
    "zip": "15219",
    "website": "https://www.meyersmedmal.com/",
    "phone": "412-550-0911",
    "fax": "412-281-4111",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4534568/pid_1/lupetin_unatin_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Birth Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.meyersmedmal.com/?refPageViewId=6c438db7b24f0302\" class=\"profile-website-body\" target=\"new\"> https://www.meyersmedmal.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.meyersmedmal.com/blog/?refPageViewId=6c438db7b24f0302\"> https://www.meyersmedmal.com/blog/ </a>"
        },
        {
            "lawyersAtLupetin&Unatin,LLCSelectedForASuperLawyers®List": "<ul><li> Evans, Charles E. <a href=\"/profile/lawyer/charles-e-evans/pa/pittsburgh/MjQxMTIzNF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Lupetin, Brendan B. <a href=\"/profile/lawyer/brendan-b-lupetin/pa/pittsburgh/MzcyMjg4N18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Meyers, Jerry I. <a href=\"/profile/lawyer/jerry-i-meyers/pa/pittsburgh/MTU0ODQyMV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Unatin, Gregory R. <a href=\"/profile/lawyer/gregory-r-unatin/pa/pittsburgh/MzgzMTk4OV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Birth Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lupetin--unatin-llc/pa/pittsburgh/NDUzNDU2OF8x/PP?refPageViewId=6c438cdef2bd67c0",
    "description": "<p>Attorneys at the Pittsburgh law office of Lupetin &amp; Unatin, LLC, have concentrated on developing skills and resources needed to serve people who are needlessly and seriously injured by the carelessness of others. For that reason, they are fully committed and equipped to secure compensation in amounts required to overcome the many financial and physical obstacles that serious injuries create.</p><p>When an unexpected injury occurs during the course of medical care, health care providers are often unable or unwilling to admit honestly what happened and why. This is the reason that so many patients and their families have relied upon the attorneys and paramedical staff of Lupetin &amp; Unatin, LLC, to find answers and solutions.</p><p>Serving clients throughout the greater Pittsburgh metro region, and western and central Pennsylvania, our law firm's attorneys bring more than 30 years of experience to the table to help you achieve the favorable outcomes you seek for your legal challenges involving any of the following:</p><ul><li>Brain injuries</li><li>Birth injuries</li><li>Cancer misdiagnoses</li><li>Surgical errors</li><li>Failure to monitor</li><li>Delayed or wrong diagnosis</li></ul><p>Over the course of our history, we have recovered millions of dollars in settlements and awards for our plaintiff clients, including many record-setting verdicts. And while we cannot promise a particular result regarding your case, we can guarantee that we will fight aggressively on your behalf to significantly increase the odds of securing the maximum amount of compensation while holding those responsible for your suffering accountable for their actions.</p><p>Recognized for our impeccable professionalism and service, we have earned numerous awards and honors, including listings in the Bar Register of Preeminent Lawyers. In addition, The National Trial Lawyers has voted us among the country's Top 100 Trial Lawyers, and U.S. News &amp; World Report named us as one of the Best Law Firms in Pittsburgh for medical malpractice and personal injury litigation.</p><p>For more information on how Lupetin &amp; Unatin, LLC, can best serve you and your family in your time of need and help you secure a brighter future, you can schedule a free initial consultation regarding your matter by contacting our law office to set up an appointment.</p>"
}