{
    "companyName": "Todd J. Leonard Law Firm - Woodbridge, NJ",
    "address1": "581 Main St #640",
    "address2": "",
    "city": "Woodbridge",
    "state": "NJ",
    "zip": "07095",
    "website": "http://www.lawleonard.com/",
    "phone": "(973) 842-0935",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4997977/pid_1/todd_j_leonard_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Motor Vehicle Accidents|Brain Injury|Medical Malpractice|Slip and Fall|Dog Bites|Workers’ Compensation|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> Open 24hrs <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lawleonard.com/?refPageViewId=6c0d06a7c2bd09aa\" class=\"profile-website-body\" target=\"new\"> http://www.lawleonard.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.lawleonard.com/blog/?refPageViewId=6c0d06a7c2bd09aa\"> http://www.lawleonard.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/todd-j-leonard-law-firm/nj/newark/NDk5Nzk3Nl8x/PP\"> Todd J. Leonard Law Firm </a><span class=\"pp_card_street\"> 1 Gateway Center #2600 </span><span class=\"pp_card_street\"><span>Newark</span>, <span>NJ</span><span> 07102 </span></span><span class=\"pp_card_street\"> (973) 842-0935 </span></p><p><a href=\"/profile/lawfirm/todd-j-leonard-law-firm/nj/morristown/NDk5Nzk3NV8x/PP\"> Todd J. Leonard Law Firm </a><span class=\"pp_card_street\"> 5 Maple Ave #2 </span><span class=\"pp_card_street\"><span>Morristown</span>, <span>NJ</span><span> 07960 </span></span><span class=\"pp_card_street\"> (973) 842-0935 </span></p><p><a href=\"/profile/lawfirm/todd-j-leonard-law-firm/nj/denville/NDk5NTcwNF8x/PP\"> Todd J. Leonard Law Firm </a> (Main Office) <span class=\"pp_card_street\"> 3010 Route 10 West </span><span class=\"pp_card_street\"><span>Denville</span>, <span>NJ</span><span> 07834 </span></span><span class=\"pp_card_street\"> 973-250-2790 </span></p>"
        },
        {
            "lawyersAtToddJ.LeonardLawFirmSelectedForASuperLawyers®List": "<ul><li> Leonard, Todd J. <a href=\"/profile/lawyer/todd-j-leonard/nj/denville/MjYwMDI1Nl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Motor Vehicle Accidents|Brain Injury|Medical Malpractice|Slip and Fall|Dog Bites|Workers’ Compensation|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Open 24hrs <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/todd-j-leonard-law-firm/nj/woodbridge/NDk5Nzk3N18x/PP?refPageViewId=6c0d065c84f7227d#otherlocations",
    "description": "<p><strong>1. Denville, New Jersey</strong></p><p>With four office locations throughout New Jersey, including one in Denville, the Todd J. Leonard Law Firm has helped thousands of individuals and their families assert their rights and secure the compensation they need to recover from injuries caused by someone else's negligence. From our Denville office, we represent clients throughout Morris County and northern New Jersey with all types of personal injury claims, including workers' compensation, wrongful death, medical malpractice cases and more.</p><p>With more than 30 years of experience practicing law, our attorneys have the skills and resources necessary to handle any client's case regardless of the challenges involved. Over the course of our history, our law firm has secured more than $50 million in settlements and awards on behalf of our clients, and we are proud to be able to serve the citizens of our community.</p><p>Continuing in his father's footsteps, our firm's founder, Todd Leonard, has dedicated his practice to personal injury law, and he is one of only a few personal injury attorneys in New Jersey to be certified as a civil trial lawyer by the Supreme Court of New Jersey.</p><p>If you need help obtaining your rightful compensation and benefits following an accident that was not your fault, you can trust the Todd J. Leonard Law Firm to advocate for your best interests and hold the responsible parties accountable for their actions. Our law firm offers free initial consultations, and we are ready to serve you.</p><p></p><p><strong>2. Morristown, New Jersey</strong></p><p>Through our office in Morristown, New Jersey, the Todd J. Leonard Law Firm represents personal injury victims and their families. Serving residents in Morris County and throughout northern and western New Jersey, we handle all types of personal injury and wrongful death claims as well as workers' compensation and medical malpractice cases.</p><p>Possessing over 30 years of legal experience, our attorneys have the knowledge and skills necessary to handle your case effectively and efficiently. Having recovered more than $50 million on behalf of our clients, we know what it takes to secure the maximum compensation for your injury or loss.</p><p>As one of only a few attorneys in New Jersey certified as a civil trial lawyer by the Supreme Court of New Jersey, Todd Leonard has devoted his legal career to helping accident victims obtain the restitution they need to support themselves and their families in the wake of a traumatic event. Working alongside a dedicated team of attorneys, Mr. Leonard and our law firm have successfully addressed the legal needs of thousands of clients over the course of our history.</p><p>If you suffered an injury or loss due to someone else's negligence and you need assistance securing finances for your future, you can count on the Todd J. Leonard Law Firm to advocate on your behalf and obtain the compensation you deserve. Our law firm offers free initial consultations as a no-risk way for you to determine how we can best serve your needs.</p><p></p><p><strong>3. Newark, New Jersey</strong></p><p>The Todd J. Leonard Law Firm assists clients throughout New Jersey who suffered an injury or loss from the careless, negligent or wrongful actions of another. Through our office in Newark, our law firm serves residents in Essex County and eastern New Jersey with all types of personal injury cases, including:</p><ul><li>Motor vehicle accidents</li><li>Wrongful death</li><li>Construction accidents</li><li>Workers’ compensation</li><li>Traumatic brain injuries</li><li>Medical malpractice</li><li>Slip-and-fall accidents</li><li>Mass tort litigation</li><li>Drowning accidents</li><li>Dog bites and animal attacks</li><li>Nursing home abuse</li><li>Civil sex abuse cases</li><li>Product liability</li><li>Playground accidents</li><li>Mesothelioma</li></ul><p>The attorneys at our firm have over 30 years of experience representing personal injury victims. Through their efforts, they have secured more than $50 million in settlements and awards on behalf of our clients, and they have the skills and resources necessary to obtain the maximum amount of compensation possible to help you recover from your injuries.</p><p>Led by experienced trial attorney Todd Leonard, our law firm has earned a reputation for our aggressive litigation tactics and impressive record of success. In fact, Mr. Leonard is one of only a few attorneys in New Jersey to be certified by the state's Supreme Court as a civil trial lawyer, and he has dedicated his career to helping the citizens of our state rebound after traumatic events.</p><p>If you need a legal advocate to protect your rights and secure the compensation you need to support yourself and your family, you can contact the Todd J. Leonard Law Firm to schedule a free initial consultation with one of our law firm's dedicated attorneys.</p><p></p><p><strong>4. Woodbridge, New Jersey</strong></p><p>From our office in Woodbridge, New Jersey, the Todd J. Leonard Law Firm serves clients in Middlesex County and the surrounding areas with all of their legal needs involving personal injury claims and other related cases. We focus solely on helping individuals and their families secure the compensation they need following an accident caused by someone else's negligence, and we also seek justice on behalf of those who suffered an injury or lost a loved one due to the wrongful actions of another party.</p><p>When working with our law firm, our clients receive dedicated, personalized attention from an attorney they can trust. With over 30 years of legal experience, our lawyers have the skills and resources necessary to obtain the maximum amount of compensation possible, and they have recovered more than $50 million on behalf of our clients.</p><p>Certified by the Supreme Court of New Jersey as a civil trial lawyer, our firm's founder, Todd Leonard, has devoted his entire career to helping the citizens of our state with their legal needs. Together with his dedicated team of attorneys, Mr. Leonard and our law firm have successfully served thousands of clients, and we are proud to be able to support our community.</p><p>If you need assistance securing your rightful compensation so you can support yourself and your family while focusing on your recovery, the Todd J. Leonard Law Firm will be your dedicated legal advocate. For more information on how our law firm can best serve your needs, you can contact our office to schedule a free initial consultation.</p>"
}