{
    "companyName": "Schad & Schad, P.C. - New Albany, IN",
    "address1": "223 East Spring Street",
    "address2": "",
    "city": "New Albany",
    "state": "IN",
    "zip": "47150",
    "website": "https://www.schadlaw.com",
    "phone": "812-671-9547",
    "fax": "812-945-5335",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1731720/pid_1/schad_schad_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Social Security Disability|Civil Rights|Motor Vehicle Accidents"
        },
        {
            "litigation": "<ul><li>65%</li></ul>"
        },
        {
            "previousLawFirmName": "<ul><li> Schad and Schad P.C.</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.schadlaw.com?refPageViewId=6bd8af5355a7ef26\"> https://www.schadlaw.com </a>"
        },
        {
            "lawyersAtSchad&Schad,P.C.SelectedForASuperLawyers®List": "<ul><li> Schad, Matthew J. <a href=\"/profile/lawyer/matthew-j-schad/in/new-albany/NDg1MDIwN18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Social Security Disability|Civil Rights|Motor Vehicle Accidents",
    "litigation": "<ul><li>65%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/schad--schad-pc/in/new-albany/MTczMTcyMF8x/PP?refPageViewId=6bd8ae83224709de",
    "description": "<p>From our law office in New Albany, Indiana, the attorneys at Schad and Schad, PC, provide unmatched representation and support to those throughout Floyd County and the surrounding areas of southern Indiana, as well as the greater Louisville metro and northern Kentucky, who suffered a serious injury or lost a loved one as the result of someone else's negligence. Along with handling all types of personal injury and wrongful death claims, we also provide invaluable assistance to those seeking their rightful Social Security Disability benefits.</p><p>Backed by more than 150 years of combined legal experience, our law firm's attorneys possess the extensive skills and resources necessary to handle your matter efficiently. During our time in practice, we have recovered millions of dollars in total compensation for our clients adversely affected by motor vehicle accidents, medical malpractice, dog bites, defective products and other preventable tragedies. Furthermore, we have also helped countless clients obtain the SSDI benefits they need after suffering a debilitating injury or illness that has left them unable to work.</p><p>Among our most notable successes, we secured a jury verdict of more than $23 million for a class of children in a toxic tort class action involving pesticide exposure. We have also obtained numerous verdicts and settlements well in excess of $1 million for victims of construction site accidents, medical malpractice, trucking accidents, dram shop liability claims and more.</p><p> This success is the direct result of our unwavering commitment to our clients coupled with our outstanding legal abilities both inside and outside the courtroom. To speak with one of our dedicated legal professionals at no cost, you can contact Schad and Schad, PC, to take advantage of our law firm's free initial consultation. In these uncertain times, we handle all our consultations remotely so that you do not have to risk your health and safety to speak with us.</p>"
}