{
    "companyName": "Injury and Disability Law Office of Wisconsin - Glendale, WI",
    "address1": "4425 N. Port Washington Rd.",
    "address2": "#500",
    "city": "Glendale",
    "state": "WI",
    "zip": "53212",
    "website": "https://injury-disability.com/",
    "phone": "414-988-8002",
    "fax": "414-988-8144",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5038842/pid_1/injury_and_disability_law_office_of_wisconsin.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Social Security Disability|Workers Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://injury-disability.com/?refPageViewId=6c4ca2f6724d370f\" class=\"profile-website-body\" target=\"new\"> https://injury-disability.com/ </a>"
        },
        {
            "lawyersAtInjuryAndDisabilityLawOfficeOfWisconsinSelectedForASuperLawyers®List": "<ul><li> Oldenburg, Jason <a href=\"/profile/lawyer/jason-oldenburg/wi/glendale/MzUzNDUxNV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Social Security Disability|Workers Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5038842_1?refPageViewId=6c4ca2cf427567bd",
    "description": "<p>When attorney Jason Oldenburg founded the Injury and Disability Law Office of Wisconsin, he did so with the purpose of providing superior legal assistance and guidance to people who suffer from disabling and debilitating injuries. Our law firm does not shut its doors to you once your case is done. We believe that once you become a client, you are always a client, and you can continue to turn to us for help with your legal needs. We stand willing to assist you with your worker's compensation, Social Security Disability or automobile accident claim.</p><p>We believe that every work injury is a serious injury. If you have been involved in a work-related accident or have an injury that you believe is caused by your job duties, please contact us to discuss your worker's compensation claim. We handle traumatic injuries, occupational injuries, hearing loss claims, and unreasonable refusal to rehire claims. We represent injured and disabled people not only in the greater Milwaukee area, but throughout the state of Wisconsin. We always offer free initial consultations. And remember, there are no costs or fees unless we recover compensation for you.</p><p>If your mental or physical injuries prevent you from working, you may be able to pursue benefits through either Supplemental Security Income (SSI) or Social Security Disability (SSDI). Obtaining these benefits can be a long, stressful and complex process, and you don't need to go through it alone. Having our skilled and knowledgeable team of attorneys on your side could increase the chances of receiving the benefits you need.</p><p>We want you to understand your rights and legal options no matter how you suffered your injuries. Our attorneys have advised and guided clients through a variety of legal matters, including the following: </p><ul><li>Worker's Compensation</li><li>Social Security Disability</li><li>Car accidents</li><li>Trucking accidents</li><li>Premises liability</li><li>Construction accidents</li></ul><p>If you don't see the type of accident that caused your injuries, don't despair. Our law firm handles all kinds of personal injury, workers' compensation and disability cases. We offer a free initial consultation during which we will give you an honest assessment of your case and discuss your options moving forward. Call the Injury and Disability Law Office of Wisconsin to schedule your appointment today.</p>"
}