{
    "companyName": "John R. Vivian, Jr. - Easton, PA",
    "address1": "831 Lehigh St.",
    "address2": "",
    "city": "Easton",
    "state": "PA",
    "zip": "18042",
    "website": "http://www.johnvivianjr.com/",
    "phone": "800-616-4992",
    "fax": "610-258-4875",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1143241/pid_1/john_r_vivian_jr.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.johnvivianjr.com/?refPageViewId=6c43917144533715\" class=\"profile-website-body\" target=\"new\"> http://www.johnvivianjr.com/ </a>"
        },
        {
            "honors": "<ul><li> Listed in International Who's Who Among Professionals, 1998 </li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "<ul><li> Listed in International Who's Who Among Professionals, 1998 </li></ul>",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/john-r-vivian-jr/pa/easton/MTE0MzI0MV8x/PP?refPageViewId=6c438faaa47767c8",
    "description": "<p>From The Law Office of John R. Vivian Jr., Attorney, our team fights for compensation on behalf of people who have suffered a personal injury in Easton and Northampton County, Pennsylvania. We have successfully handled a range of issues, such as medical malpractice, insurance disputes, motor vehicle accidents, toxic injuries and defective products. Our practice is solely focused on representing victims of negligence, which means our clients receive the experience and attention of a dedicated attorney.</p><p>&nbsp;</p><p>For more than 30 years, our founder, Mr. Vivian, has been advocating for people in state and federal courts. The National Board of Trial Advocacy has certified Mr. Vivian in both pretrial civil advocacy and civil trial advocacy. At our law office, we believe that pushing for a trial is key to letting defendants know how serious we are about seeking recourse for a client’s damages. Though we are able to negotiate a settlement, our priority is to do whatever it takes to obtain justice.</p><p>&nbsp;</p><p>There is a reason Mr. Vivian has been listed as one of The National Trial Lawyers: Top 100. He consistently generates positive outcomes for people who have been wronged. Anyone who works with The Law Office of John R. Vivian Jr., Attorney, can expect professional and results-oriented representation.</p><p>&nbsp;</p><p>&nbsp;</p>"
}