{
    "companyName": "Guerra Law Group, P.L.L.C. - McAllen, TX",
    "address1": "4201 N. McColl Rd.",
    "address2": "",
    "city": "McAllen",
    "state": "TX",
    "zip": "78504",
    "website": "https://guerralawgroup.com/",
    "phone": "956-413-5674",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1777386/pid_1/guerra_law_group_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> M-F: 8am – 5pm Sat: Closed Sun: Closed <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://guerralawgroup.com/?refPageViewId=6c4409b521bc0996\" class=\"profile-website-body\" target=\"new\"> https://guerralawgroup.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> M-F: 8am – 5pm Sat: Closed Sun: Closed <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/guerra-law-group-pllc/tx/mcallen/MTc3NzM4Nl8x/PP?refPageViewId=6c440986b756031c",
    "description": "<p>A successful personal injury lawsuit requires collaboration. At Guerra Law Group, P.L.L.C., in McAllen, Texas, we recognize the importance of working closely with our clients to understand their past experiences and current circumstances. During a free initial consultation at our law office, we discuss the ways in which a car accident or defective product has adversely affected their physical, emotional and financial well-being. Documenting these damages is key to recovering compensation.</p><p>Further, the attorneys at our law office are involved with several prestigious legal organizations, which allows us to network with peers, and learn about new tools and trends in law. We are members of the American Association for Justice, the American Bar Association, the Attorneys Information Exchange Group and the Hidalgo County Bar Association.</p><p>Lastly, we align ourselves with other professionals who offer invaluable contributions to the claims we pursue. On medical malpractice cases, we speak with physicians about the standard of care and how it was breached. For car wrecks, we consult law enforcement officers and laboratory technicians to piece together what happened. Our law office staff applies the same in-depth investigations to each case we handle, including insurance claims, commercial disputes and workplace accidents. Guerra Law Group, P.L.L.C., accepts credit cards and represents clients throughout Texas.</p>"
}