{
    "companyName": "Neighbors Law Firm - Norman, OK",
    "address1": "4217 28th Avenue NW",
    "address2": "Ste. 101",
    "city": "Norman",
    "state": "OK",
    "zip": "73069",
    "website": "https://www.neighborslaw.net/",
    "phone": "405-928-0091",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5156047/pid_1/neighbors_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Birth Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.neighborslaw.net/?refPageViewId=6c43416275c6032d\" class=\"profile-website-body\" target=\"new\"> https://www.neighborslaw.net/ </a>"
        },
        {
            "lawyersAtNeighborsLawFirmSelectedForASuperLawyers®List": "<ul><li> Neighbors, Brent L. <a href=\"/profile/lawyer/brent-l-neighbors/ok/norman/MTU3NzU4OV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Birth Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/neighbors-law-firm/ok/norman/NTE1NjA0N18x/PP?refPageViewId=6c43410e96a602ed",
    "description": "<p>Dedicated to handling personal injury cases, Neighbors Law Firm serves clients throughout Norman, Oklahoma. Attorney Brent L. Neighbors passionately believes in helping ordinary, everyday people win victories against insurance companies, hospitals and corporations. He has served the area for more than two decades in both negotiating and litigating claims involving the following:</p><ul class=\"unIndentedList\"><li> Medical malpractice</li><li> Brain and birth injuries</li><li> Wrongful death</li><li> Insurance bad faith</li><li> Product liability</li></ul><p>As a steadfast advocate for his clients, Mr. Neighbors strives to find the most efficient solution to their issues. After all, their future largely depends on having the money necessary for medical care and rehabilitation. To provide the best possible representation, Mr. Neighbors listens as clients voice their concerns. He personally conducts an in-depth analysis of the many ways in which the incident has adversely affected their lives. Using all the resources available to his law firm, he then creates a meticulous strategy that seeks maximum compensation.</p><p>Mr. Neighbors has earned the highest peer rating possible of AV Preeminent* from Martindale-Hubbell, and he has been named a Super Lawyer. He does everything in his power to make the legal process easy on his clients, including offering a free, no-pressure initial consultation. Neighbors Law Firm also accepts credit cards.</p> * AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards "
}