{
    "companyName": "Adams Cross LLC - Olathe, KS",
    "address1": "303 E. Poplar St.",
    "address2": "",
    "city": "Olathe",
    "state": "KS",
    "zip": "66061",
    "website": "http://www.olathelaw.com",
    "phone": "913-353-5602",
    "fax": "913-782-1761",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2435784/pid_1/adams_cross_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Bankruptcy"
        },
        {
            "litigation": "<ul><li>90%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.olathelaw.com?refPageViewId=6bd9003f37330a2e\" class=\"profile-website-body\" target=\"new\"> http://www.olathelaw.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Bankruptcy",
    "litigation": "<ul><li>90%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/adams-cross-llc/ks/olathe/MjQzNTc4NF8x/PP?refPageViewId=6bd90012c4b4031c",
    "description": "<p>For more than 25 years, we have been working for personal injury victims in Olathe, Kansas, and the greater Kansas City area. We have observed firsthand how insurance companies aim to limit the compensation they provide to people hurt in car collisions and other negligence situations. When it comes to our clients, however, we do all we can to prevent this scenario from happening.</p><p>Some of the cases Adams Cross, LLC, routinely handles involve automobile, truck and motorcycle crashes. In the past, we have represented clients who have sustained broken bones; and received severe brain, back and neck injuries. Our top concern is making sure our clients get a fair outcome in a timely fashion. This means encouraging clients to get all the medical help and counseling they need while clearing all legal red tape related to filing claims. We handle the administrative duties, evidence gathering and negotiations with insurance companies to seek the best possible outcome in every case. Beyond incidents on the road, we offer counsel for other negligence cases, including slip-and-fall accidents, dog bites and medical malpractice.</p><p>At our office, we believe in providing clients with care and convenience, especially in the wake of a catastrophic injury. For this reason, we are pleased to offer a free initial consultation and case evaluation at Adams Cross, LLC. In addition to personal injury cases, we also help people with matters related to bankruptcy (Chapter 7 and Chapter 13).</p><p></p>"
}