{
    "companyName": "Lane & Lane, LLC - Chicago, IL",
    "address1": "230 W. Monroe St.",
    "address2": "Suite 1900",
    "city": "Chicago",
    "state": "IL",
    "zip": "60606",
    "website": "http://www.lane-lane.com/",
    "phone": "312-702-0699",
    "fax": "312-899-8003",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1231124/pid_1/lane_lane_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Motor Vehicle Accidents|Traffic Accidents|Car Accidents|Truck Accidents|Motorcycle Accidents|Public Transportation Accidents|Medical Malpractice|Medication Errors|Birth Injuries"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lane-lane.com/?refPageViewId=6bcbc5b112cd2269\" class=\"profile-website-body\" target=\"new\"> http://www.lane-lane.com/ </a>"
        },
        {
            "lawyersAtLane&Lane,LLCSelectedForASuperLawyers®List": "<ul><li> Brown, Mark A. <a href=\"/profile/lawyer/mark-a-brown/il/chicago/MzI1MzQ5Ml8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Kamenjarin, Nicholas <a href=\"/profile/lawyer/nicholas-kamenjarin/il/chicago/NTIxMzQ2NF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Lane, Scott D. <a href=\"/profile/lawyer/scott-d-lane/il/chicago/MTY0ODcxMl8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Lane, Stephen I. <a href=\"/profile/lawyer/stephen-i-lane/il/chicago/MTEzMDMzMV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Snyder, Kellie Jean <a href=\"/profile/lawyer/kellie-jean-snyder/il/chicago/NTI0MDQwNF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Motor Vehicle Accidents|Traffic Accidents|Car Accidents|Truck Accidents|Motorcycle Accidents|Public Transportation Accidents|Medical Malpractice|Medication Errors|Birth Injuries",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lane--lane-llc/il/chicago/MTIzMTEyNF8x/PP?refPageViewId=6bcbc440c4650355",
    "description": "<p>Few areas of law require the level of personal attention and trust between lawyer and client that personal injury law demands. At Lane &amp; Lane, LLC, in Chicago, our entire team understands the importance of empathy, tenacity and personal commitment to each client's best interests. Our attorneys have more than 130 years of cumulative experience representing individuals who have suffered severe injuries as a result of someone else's negligence. Our clients have suffered great losses physically and emotionally. We work to maximize the amount of compensation they recover so they do not suffer financial losses as well.</p><p>Our law firm has an extensive record of success advocating for individuals who have been injured as a result of:</p><ul><li>Motor vehicle accidents</li><li>Slip-and-fall and other premises liability accidents</li><li>Medical malpractice, including birth injuries and surgical errors</li><li>Construction site accidents and other workplace injuries</li><li>Defective products</li></ul><p>If you enlist the services of Lane &amp; Lane, LLC, our entire team will be dedicated to ensuring that you recover the full amount you are owed, including current and future medical costs, lost wages, lost earning power, and pain and suffering. Our firm has four partners and our small case load allows us to work as a team, so all of our attorneys and support staff will have a working knowledge of your case.</p><p>We are trial-tested attorneys who understand the strategies that insurance companies use to minimize the amount they pay to accident victims or to deny valid claims altogether. Our reputation as a law firm that prepares meticulously for trial and will not hesitate to litigate if a fair offer is not on the table allows us to negotiate from a position of strength. We resolve a high percentage of cases without litigating.</p><p>If you or a loved one is seriously injured due to someone else's negligence, we invite you to schedule a free consultation in which we will answer your questions, provide a candid assessment of your case and recommend the best steps to take. We take all of our personal injury cases on a contingency fee basis, which means you will only pay an attorney fee if we recover a financial settlement or judgment for you. Call 312-702-0699 to schedule a free consultation. We work with clients throughout the Chicagoland area and elsewhere in Illinois.</p>"
}