{
    "companyName": "ReidGoodwin, PLC - Roanoke, VA",
    "address1": "10 Church Ave. SE",
    "address2": "",
    "city": "Roanoke",
    "state": "VA",
    "zip": "24001",
    "website": "https://www.reidgoodwin.com/",
    "phone": "804-415-7800",
    "fax": "804-415-7560",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5098091/pid_1/reidgoodwin_plc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Car Accident|Personal Injury|Workers' Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> By appointment only <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.reidgoodwin.com/?refPageViewId=6c4b0cfc953502ba\" class=\"profile-website-body\" target=\"new\"> https://www.reidgoodwin.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.virginiajobinjury.com/blog/?refPageViewId=6c4b0cfc953502ba\"> http://www.virginiajobinjury.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/reidgoodwin-plc/va/richmond/NDgyNTcxOV8x/PP\"> ReidGoodwin, PLC </a> (Main Office) <span class=\"pp_card_street\"> 4116 Fitzhugh Ave. </span><span class=\"pp_card_street\"><span>Richmond</span>, <span>VA</span><span> 23230 </span></span><span class=\"pp_card_street\"> 804-415-7800 </span></p>"
        }
    ],
    "practiceAreas": "Car Accident|Personal Injury|Workers' Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> By appointment only <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/reidgoodwin-plc/va/roanoke/NTA5ODA5MV8x/PP?refPageViewId=6c4b0cd444e021f4#otherlocations",
    "description": "<p>Accepting clients by appointment only from our office in Roanoke, Virginia, the attorneys at the ReidGoodwin, PLC, law firm are here to help you secure the finances you need to support yourself and your family in the wake of a debilitating injury or devastating loss.</p><p>Based in Richmond, our law firm has grown to become one of the most respected legal practices in the region for personal injury and workers' compensation claims. Over the years, we have been highly successful in obtaining settlements and awards on behalf of our plaintiff clients, and we promise to do whatever we can to ensure you receive the proper medical treatment you need as we aggressively pursue the most favorable outcome possible for your situation.</p><p>Whether your suffering is the result of a motor vehicle accident, a defective product, a slip-and-fall accident, assault, a workplace accident or any other negligent, careless or unlawful action, you can turn to our law firm for the quality, effective representation you deserve. Recognized for our high ethical standards and exceptional legal abilities, our attorneys have been voted among the top in the country for workers' compensation and personal injury, and we hold AV Preeminent peer review ratings* from Martindale-Hubbell.</p><p>To discuss your needs with no risk and begin the process of securing a brighter future for yourself and your family, you can contact ReidGoodwin, PLC, by calling our law office to schedule an appointment for a free initial consultation.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}