{
    "companyName": "Freeman Law - Austin, TX",
    "address1": "Mailing Address",
    "address2": "4301 W William Cannon Dr",
    "city": "Austin",
    "state": "TX",
    "zip": "78749",
    "website": "https://www.freemanlawaustin.com",
    "phone": "512-481-2969",
    "fax": "512-637-8576",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5103814/pid_1/freeman_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury 90%|Commercial Litigation 10%"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> Mon- Fri 8-7, Sat 9-12 <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.freemanlawaustin.com?refPageViewId=6c440cc3a0672227\"> https://www.freemanlawaustin.com </a><a rel=\"sponsored\" href=\"https://www.freemanlawaustin.com?refPageViewId=6c440cc3a0672227\" class=\"profile-website-body\" target=\"new\"> https://www.freemanlawaustin.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury 90%|Commercial Litigation 10%",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Mon- Fri 8-7, Sat 9-12 <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/freeman-law/tx/austin/NTEwMzgxNF8x/PP?refPageViewId=6c440c4620ee2275",
    "description": "<p>Offering dedicated personal injury services, our team at the Freeman Law exclusively serves the Hispanic community in the Austin, Texas, metropolitan area. We recognize that, particularly to those for whom English is a second language, navigating the court system may be overwhelming. Standing by our clients throughout each stage of the legal process, our team is dedicated to obtaining financial justice on their behalf.</p><p>Following car and truck accidents, medical mistakes, birth injuries and other such accidents, people may face many challenges, from mounting medical bills to lost wages. Our law firm understands that people may be worried about providing for themselves and their families, and we are passionate about helping them obtain the compensation they need and deserve. </p><p>We have seen the lengths to which insurance companies may go to avoid paying for the negligent actions of their clients, and we are undeterred by the challenge of facing these companies to hold them accountable. Our team helps people preserve vital evidence from their accidents, including law enforcement reports, witness interviews and medical records. Throughout negotiations and in the courtroom, we keep our clients' best interests and needs at the front of our minds. </p><p>Our team at Freeman Law not only handles personal injury cases; we also provide representation to clients in a range of other complex matters. Offering customized guidance and focused advocacy, we aid people with cases involving issues such as immigration, family law, criminal defense, work site injuries, business disputes and business development. Our law firm accepts credit cards for the convenience of those we represent, and we offer free initial consultations.</p>"
}