{
    "companyName": "David Hunter Law - Erie, PA",
    "address1": "821 State Street",
    "address2": "",
    "city": "Erie",
    "state": "PA",
    "zip": "16501",
    "website": "http://www.lawyer-erie.com",
    "phone": "814-933-0903",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2089310/pid_1/david_hunter_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice 50%|Vehicle Crashes 30%|Birth Injury 5%|Premises Liability 5%|Product Liability 5%|Drugs &amp; Medical Devices 5%"
        },
        {
            "litigation": "<ul><li>75%</li></ul>"
        },
        {
            "languages": "English"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lawyer-erie.com?refPageViewId=6c438dbbf48567b4\" class=\"profile-website-body\" target=\"new\"> http://www.lawyer-erie.com </a>"
        }
    ],
    "practiceAreas": "Medical Malpractice 50%|Vehicle Crashes 30%|Birth Injury 5%|Premises Liability 5%|Product Liability 5%|Drugs &amp; Medical Devices 5%",
    "litigation": "<ul><li>75%</li></ul>",
    "languages": "English",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/david-hunter-law/pa/erie/MjA4OTMxMF8x/PP?refPageViewId=6c438cf2434167c0",
    "description": "<p>David Hunter Law is an Erie, Pennsylvania, law firm with a commitment to helping injured patients and workers get what they deserve. The firm manages simple and complex cases involving medical malpractice, work injuries and general personal injury.</p><p>People who bring injury complaints often have to fight against large, powerful companies. It can take experienced, knowledgeable attorneys to obtain a fair outcome.</p><p><strong>Experience</strong></p><p>David Hunter Law has many years of history obtaining the maximum possible settlements and trial verdicts. This includes multimillion-dollar outcomes. After over 30 years of meticulous preparation, tireless negotiation and tenacious representation, the firm's attorneys have the experience and knowledge necessary to secure the best possible resolution for personal injury cases.</p><p><strong>Focus</strong></p><p>The law firm has a specific focus on medical malpractice. This area includes pharmaceutical errors, birth injuries, hospital negligence, wrong-site or wrong-patient surgeries, misdiagnosis, delayed diagnosis or anything else that doctors and health care organizations do to injure their patients.</p><p>The firm also handles construction accidents, car and truck crashes, warehouse injuries, office injuries and many other matters. Before signing any documents, it is typically wise to check if a personal injury lawsuit could be successful.</p><p><strong>Communication</strong></p><p>Injuries are stressful. The firm's goal is to make the process of recovering as simple and straightforward as possible. This includes clear explanations of all options, a fair assessment of the situation and consistent updates on case progress.</p><p><strong>Fairness</strong></p><p>Above all, the goal is a fair resolution to injury disputes. This includes a payment plan in line with the amount of legal work involved. There is also a contingent system that eliminates upfront lawyer fees. Additionally, the law firm offers free consultations.</p>"
}