{
    "companyName": "Lynch Law Group - Peachtree Corners, GA",
    "address1": "6171 Crooked Creek Road",
    "address2": "Suite A",
    "city": "Peachtree Corners",
    "state": "GA",
    "zip": "30092",
    "website": "http://www.lynchlawgroup.com/",
    "phone": "404-631-6604",
    "fax": "404-880-9360",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5004013/pid_1/lynch_law_group.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Family Law|Business Law|Estate Planning &amp; Wills|Entertainment Law"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lynchlawgroup.com/?refPageViewId=6b5dcb8db6882206\" class=\"profile-website-body\" target=\"new\"> http://www.lynchlawgroup.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/lynch-law-group/ga/atlanta/MzY0NDM4NV8x/PP\"> Lynch Law Group </a> (Main Office) <span class=\"pp_card_street\"> 505 Pryor Street SW </span><span class=\"pp_card_street\"><span>Atlanta</span>, <span>GA</span><span> 30312 </span></span><span class=\"pp_card_street\"> 404-631-6604 </span></p>"
        },
        {
            "lawyersAtLynchLawGroupSelectedForASuperLawyers速List": "<ul><li> Lynch, Diana <a href=\"/profile/lawyer/diana-lynch/ga/atlanta/MjQzOTI2NV8x/PP#feedback\">On a Super Lawyers速 List</a></li></ul>"
        },
        {
            "honors": "<ul><li> Attorney Diana Lynch On a Super Lawyers速 List, - 2017 </li></ul>"
        }
    ],
    "practiceAreas": "Family Law|Business Law|Estate Planning &amp; Wills|Entertainment Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "<ul><li> Attorney Diana Lynch On a Super Lawyers速 List, - 2017 </li></ul>",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5004013_1?refPageViewId=6b5dca3997920979#otherlocations",
    "description": "<p>For more than 24 years, the Lynch Law Group has provided people in the Atlanta, Georgia, metropolitan area with an aggressive, compassionate family law advocate in their corner. Our mission is to transform how people experience working with lawyers. We believe in exceeding expectations by solving problems and creating value in unexpected ways.</p><p><strong>An Established, Well-Recognized Family Law, Business and Entertainment Law Practice</strong></p><p>Family law is the cornerstone of our practice and providing calculated and efficient case specific representation is our focus. Representing clients in divorce, custody and support litigation, we have gone toe-to-toe with most major family law firms in the state and have garnered a reputation among our clients, our colleagues, and our courts for advocacy without compromise.</p><p>In our business and entertainment practice, we treat our clients' business as our business. With insight and dedication to creative collaboration, we help our clients produce better, smarter and more efficient results.</p><p><strong>Meet Diana Lynch, Committed to Her Clients, Her Profession, Her Community as a Litigator, Mediator, Arbitrator, Author, Educator, Public Speaker and Financial Adviser</strong></p><p>Our founder, Diana Lynch, is revered in her business and legal community, with an impeccable reputation as an advocate and powerhouse attorney. She is recognized as a Georgia Super Lawyer, an honor that is reserved for attorneys in the top five percent of their practice area. She stands out through her litigation skills and successes when taking divorce disputes such as property division, custody and maintenance to court. Ms. Lynch is also a licensed mediator and arbitrator.</p><p>Her previous experience includes service as a staff attorney with the South Carolina Court of Appeals, a federal law clerk at the United States District Court for the Northern District of Georgia, a contract attorney in the litigation and family law section of Alembik, Fine &amp; Callner, P.C.; two decades in the sports and entertainment industry representing independent labels, producers, artists, musicians, actors and athletes. In private practice since 1994, she has represented corporate and private clients in entertainment, family and corporate law.</p><p>Ms. Lynch is the author of several legal and professional publications that showcase her 24 years of experience as a powerhouse legal advocate. Her new book, \"Playing Your Position,\" is a 12-step guide to navigating the landmines when family and finances collide. Currently living in Fulton County, she serves as the chairman of the Fulton County Youth Council, and as chair of the Fulton County Workforce Development Board. As founder and executive director of Literacy to Legacy, Diana Lynch is committed to providing a better life for youth and our communities. </p>"
}