{
    "companyName": "Steigmann Law, P.C. - Savoy, IL",
    "address1": "1807 Woodfield Drive",
    "address2": "",
    "city": "Savoy",
    "state": "IL",
    "zip": "61874",
    "website": "https://steigmannlaw.com/",
    "phone": "217-615-0011",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5054976/pid_1/steigmann_law_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Workers' Compensation|Motor Vehicle Accident|Wrongful Death|Trucking Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://steigmannlaw.com/?refPageViewId=6bcbc46b51d267ba\" class=\"profile-website-body\" target=\"new\"> https://steigmannlaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://steigmannlaw.com/blog/?refPageViewId=6bcbc46b51d267ba\"> https://steigmannlaw.com/blog/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Workers' Compensation|Motor Vehicle Accident|Wrongful Death|Trucking Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/steigmann-law-pc/il/savoy/NTA1NDk3Nl8x/PP?refPageViewId=6bcbc42aa4300355",
    "description": " Your Personal Injury Advocate In Illinois<br>Located in Savoy, Illinois, Steigmann Law, P.C., focuses exclusively on helping clients achieve the justice they seek for their injuries or losses caused by someone else's negligence or wrongdoing.<br>Serving Champaign, Vermilion, Douglas and Piatt counties and the rest of Illinois, our attorneys have years of experience fighting on behalf of those adversely affected by automobile and truck accidents, medical malpractice, train accidents, defective products, dangerous property conditions, dram shop law violations and other similar claims. We also offer comprehensive support for injured and disabled employees seeking their rightful workers' compensation benefits.<br>Helping You With All Of Your Needs<br>Taking a holistic approach to the cases we handle, we will help you get the medical care you need as we devise the most effective strategy possible to help you obtain the maximum amount of compensation for the damages you incurred as well as for your pain and suffering.<br>Having recovered millions of dollars in settlements and awards over our history, we have earned a reputation as a law firm that gets results, and our attorneys have received top ratings and positive reviews from past clients.<br>Do Not Delay In Pursuing Your Claim<br>For any personal injury claim, you need to act quickly to protect yourself and preserve your right to pursue legal recourse. By contacting Steigmann Law, P.C., and taking advantage of our law firm's free initial consultation, you can begin the process right away. We will never require a fee from you unless we successfully obtain compensation on your behalf.<br>"
}