{
    "companyName": "X1Law PA - North Palm Beach, FL",
    "address1": "721 US Highway 1",
    "address2": "Suite 203",
    "city": "North Palm Beach",
    "state": "FL",
    "zip": "33408",
    "website": "http://x1law.com/",
    "phone": "561-363-3947",
    "fax": "561-537-7193",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4227828/pid_1/x1law_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Workers Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://x1law.com/?refPageViewId=6b47b65b70390321\" class=\"profile-website-body\" target=\"new\"> http://x1law.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://x1law.com/blog/?refPageViewId=6b47b65b70390321\"> http://x1law.com/blog/ </a>"
        },
        {
            "lawyersAtX1LawPASelectedForASuperLawyers®List": "<ul><li> Tighe, Patrick J. <a href=\"/profile/lawyer/patrick-j-tighe/fl/north-palm-beach/NDIyNzg2M18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Workers Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/x1law-pa/fl/north-palm-beach/NDIyNzgyOF8x/PP?refPageViewId=6b47b484143967e0",
    "description": "<p>From our law office in North Palm Beach, Florida, attorneys Daniel C. Tighe and Patrick J. Tighe and the dedicated legal professionals at X1Law, P.A., provide unmatched advocacy and support to clients throughout our region who suffered a serious injury or lost a loved one due to someone else's negligence or wrongdoing.</p><p>Regarded as one of South Florida's premier personal injury legal practices, our law firm has a long and rich history of serving the members of our community adversely affected by motor vehicle accidents, defective products, unsafe property conditions and other preventable tragedies. Our success is the direct result of our lawyers' extensive legal experience coupled with our unwavering dedication to those we serve.</p><p>Honored for our outstanding professionalism and service, our lawyers have earned designations as among the Best Car Accident Lawyers in Palm Beach Gardens, and Lawyer Legion has recognized us for our unprecedented leadership within our community. We have also been featured in a number of local and national publications for our success, and we regularly appear on various news outlets, offering in-depth legal commentary on a variety of topics.</p><p>This means you can expect to receive the highest level of representation possible directly from a local attorney who has your best interests at heart. To find out more, you can contact X1Law, P.A., to take advantage of our law firm's free initial consultation. We also currently offer virtual consultations in these uncertain times to help keep you and your loved ones safe and healthy.</p>"
}