{
    "companyName": "Reed Law Group, PLC - Bowling Green, KY",
    "address1": "941 Lehman Ave.",
    "address2": "Ste. 105",
    "city": "Bowling Green",
    "state": "KY",
    "zip": "42101",
    "website": "http://reedlawgroupky.com/",
    "phone": "270-745-1933",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4941309/pid_1/reed_law_group_plc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Divorce|Family Law|Child Custody"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://reedlawgroupky.com/?refPageViewId=6bd946d2109109c2\" class=\"profile-website-body\" target=\"new\"> http://reedlawgroupky.com/ </a>"
        }
    ],
    "practiceAreas": "Divorce|Family Law|Child Custody",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/reed-law-group-plc/ky/bowling-green/NDk0MTMwOV8x/PP?refPageViewId=6bd9467ae300030a",
    "description": "<p><strong>Are Legal Problems Holding You Back? We Help Move You Forward.</strong></p><p>At Reed Law Group, PLC, we represent Kentucky residents going through personal crises that come with divorce, motor vehicle accidents or drunk driving arrests. Life-changing legal matters require reliable counsel to remove the obstacles and power past your problems.</p><p>Attorney Ryan C. Reed will help you move forward by applying his experience, knowledge and personalized approach to all of your family law, personal injury and DUI defense cases. He will meet with you personally to discuss your legal needs and goals. As he navigates you through a complex process, he remains accessible, providing important information, progress reports and even his cell phone number.</p><p>You will also have access to Reed Law Group, PLC's, cutting-edge case management software, allowing you to review vital information regarding your case.</p><p><strong>A Commitment To Clients And The Community</strong></p><p>Ryan C. Reed's commitment to members of the community transcends our law office. He believes in giving back and making a difference in Bowling Green, where he has been practicing law since 1999. His extensive community involvement includes:</p><ul><li>Member and President (2003 and 2004), Board of Directors of the Barren River Area Child Advocacy Center</li><li>Director, Officer and President (2016), Bowling Green-Warren County Bar Association</li><li>Secretary, Board of Directors; Volunteer Coordinator; and Public Relations Coordinator, bg26.2 &amp; Half Marathon, Inc., 2012 to Present</li><li>Volunteer, United Way of Southern Kentucky</li><li>Coach, Mock Trial Team, Western Kentucky University</li><li>Bell ringer, The Salvation Army</li></ul><p><strong>We Take A Client-First, Service-Driven Approach To Your Case</strong></p><p>At Reed Law Group, PLC, we take your case as seriously as you do. We aim to provide a level of service where you will feel your case is the only case at our firm. You need that type of legal service and support from a skilled and experienced lawyer during challenging times.</p>"
}