{
    "companyName": "Grimes Yeoman, PLLC - Mooresville, NC",
    "address1": "179 Gasoline Alley",
    "address2": "Suite 102-A",
    "city": "Mooresville",
    "state": "NC",
    "zip": "28117",
    "website": "",
    "phone": "704-859-8787",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5193167/pid_1/grimes_yeoman_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Workers' Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> Mon - Sun: By Appointment <br></p>"
        },
        {
            "lawyersAtGrimesYeoman,PLLCSelectedForASuperLawyers®List": "<ul><li> Grimes, Elizabeth G. <a href=\"/profile/lawyer/elizabeth-g-grimes/nc/mooresville/MTkxMDk1Nl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Workers' Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Mon - Sun: By Appointment <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/-grimes-yeoman-pllc/nc/mooresville/NTE5MzE2N18x/PP?refPageViewId=6c3a066de6c52260",
    "description": "<p>For more than 31 years, the attorneys at Grimes Yeoman, PLLC, in Mooresville, North Carolina, have provided unmatched advocacy and support to clients throughout Iredell and Mecklenburg counties and across the state who have suffered an injury or loss as the result of someone else's negligence or wrongdoing.</p><p class=\"MsoNormal\"><span>Handling all types of personal injury and wrongful death claims, the firm's attorneys have recovered millions of dollars in settlements and verdicts for their plaintiff clients adversely affected by motor vehicle accidents, bicycle accidents, traumatic brain injuries, workplace and construction accidents, medical malpractice, defective products, slip-and-fall accidents and other preventable tragedies. As a result of their success, they have earned memberships in the Million Dollar Advocates Forum and Multi-Million Dollar Advocates Forum, and they have become one of the area's premier legal practices for individuals and families in need.</span></p><p class=\"MsoNormal\"><span>Honored for her outstanding professionalism and legal abilities, the law firm's managing partner, attorney Elizabeth G. Grimes, is AV Preeminent peer-review rated,* the highest rating, through Martindale-Hubbell and has earned designation in The National Trial Lawyers: Top 100. Today, she leads a team of some of the most dedicated and talented legal minds in the profession, providing the quality, personalized representation you need in order to improve the likelihood that you will obtain the justice you deserve.</span></p><p class=\"MsoNormal\"><span>You do not have to suffer alone, and the attorneys at Grimes Yeoman, PLLC, are fully committed to helping see you through this difficult and uncertain time in your life so that you can move forward with confidence. To find out more about how they can best assist you with your legal matter, you can call their law office or visit their website to schedule a free initial consultation. They will accept no fee unless they win your case, and they also offer virtual appointments to help keep you and your family safe.</span></p><p class=\"MsoNoSpacing\"><span>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer-review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings™ fall into two categories – legal ability and general ethical standards.</span></p>"
}