{
    "companyName": "Law Office of James P. Leonard LLC - Saint Louis, MO",
    "address1": "1015 Locust St.",
    "address2": "Ste. 428",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63101",
    "website": "https://www.leonardlawstl.com",
    "phone": "314-396-6291",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5224637/pid_1/law_office_of_james_p_leonard_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Truck Accident|Car Accident|Medical Malpractice|Birth Injury|Brain Injury|Railroad Worker Injury/FELA|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.leonardlawstl.com?refPageViewId=6c0c37a6f69102be\"> https://www.leonardlawstl.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Truck Accident|Car Accident|Medical Malpractice|Birth Injury|Brain Injury|Railroad Worker Injury/FELA|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-office-of-james-p-leonard-llc/mo/saint-louis/NTIyNDYzN18x/PP?refPageViewId=6c0c3778e187030a",
    "description": "<p>I am attorney James P. Leonard, founder and owner of the Law Office of James P. Leonard LLC in St. Louis, Missouri. A top-ranked trial lawyer with more than 39 years of total legal experience, I established my law firm with a mission to deliver the highest level of advocacy and support possible to clients across my region who suffered a serious injury or lost a loved one due to someone else's negligent, careless or unlawful actions.</p><p>Considering I devote my entire practice to personal injury law, you can expect to receive unmatched counsel to help you make the best-informed decisions. You can also always rely on me to aggressively pursue the maximum amount of compensation to which you are entitled. Over the course of my practice, I have recovered millions of dollars in total compensation for my plaintiff clients, and my law firm has received numerous testimonials and referrals from those I have served.</p><p>Whether your suffering is the result of a motor vehicle accident, medical malpractice, unsafe property conditions or some other preventable tragedy, I am fully prepared to fight hard on your behalf both inside and outside of the courtroom to improve your likelihood of getting the positive results you expect and deserve.</p><p>To begin the process of securing the help and support you need and deserve, you can contact the Law Office of James P. Leonard LLC to take advantage of my law firm's free initial consultation. </p>"
}