{
    "companyName": "The Law Office of Christopher J. Levy, LLC - Saint Louis, MO",
    "address1": "9666 Olive Blvd.",
    "address2": "Suite 690",
    "city": "Saint Louis",
    "state": "MO",
    "zip": "63132",
    "website": "http://clevylawfirm.com/",
    "phone": "314-266-9656",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5207633/pid_1/the_law_office_of_christopher_j_levy_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "General Practice|Wills|Trusts|Probate|Estate Administration|Personal Injury|Auto accidents|Products Liability|Premises Liability|Wrongful Death|Asbestos Exposure|Contract Disputes|Property Disputes|Real Property and Mineral Leases|Employment Contracts|Business Licensing Issues|Misdemeanor Criminal Defense|Trials and Litigation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://clevylawfirm.com/?refPageViewId=6c0c397b474902da\" class=\"profile-website-body\" target=\"new\"> http://clevylawfirm.com/ </a>"
        }
    ],
    "practiceAreas": "General Practice|Wills|Trusts|Probate|Estate Administration|Personal Injury|Auto accidents|Products Liability|Premises Liability|Wrongful Death|Asbestos Exposure|Contract Disputes|Property Disputes|Real Property and Mineral Leases|Employment Contracts|Business Licensing Issues|Misdemeanor Criminal Defense|Trials and Litigation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-law-office-of-christopher-j-levy-llc/mo/saint-louis/NTIwNzYzM18x/PP?refPageViewId=6c0c3927949f3713",
    "description": "<p>Chris Levy has almost 15 years of experience in complex litigation, handling personal injury claims, wrongful death claims, estate contests, general trial practice, and several other affiliated legal issues. Serving both Missouri and Illinois residents, he offers several legal services to resolve clients’ complex legal issues.</p><p><u>Estate Work</u></p><p>Planning for end-of-life circumstances is never a pleasant task, but appropriate estate planning can spare your loved ones the headaches and pains of handling your estate unprepared. There are also many advantageous actions you can take to protect your assets while living. Chris handles: Wills, Trusts, Powers of Attorney for Healthcare and Property, Probate Documents and Filings, and Probate disputes and Estate Administration.</p><p><u>Personal Injury Work</u></p><p>Injuries caused by the negligent actions of others can devastate your life in unexpected ways. Getting appropriate compensation for injuries cannot undo personal damage, but compensation can help rebuild lost income, cover medical bills, replace property, and hold negligent actors accountable for their irresponsible actions. Chris handles: Auto accidents, Products Liability, Premises Liability, Wrongful Death, Asbestos Exposure, and Catastrophic Personal Injury.</p><p><u>Contract Issues</u></p><p>Contracts for the sale or lease of property, real estate, and minerals can be complicated and burdensome when one party attempts to void an otherwise valid agreement. When a contract is unclear, unfair, or generally unenforceable, your rights deserve protection. Chris handles: Property Disputes, Land Disputes, Real Property and Mineral Leases, Employment Contracts, and Business Licensing Issues.</p><p><u>Criminal Allegations</u></p><p>Criminal allegations can disrupt your life in several ways, including suspended driving privileges, payment of excessive fines, increased drivers’ insurance costs, loss of freedom, and employment consequences to name a few. Defendants have rights when charged with a crime, no matter how minor the offense, and defendants need strong representation to protect their rights. Chris handles: Traffic Tickets, DUI, Driving While Revoked, Drug Possession, Other Misdemeanors</p><p><u>Trials/Litigation</u></p><p>Many legal issues can be resolved without going to trial. Unfortunately, despite the best efforts of counsel and clients, many issues do not end until a judge or a jury decides the final outcome. Litigation is often necessary and having an experienced litigator in your corner is crucial. Chris handles all aspects of litigation, including: Depositions, Motion Practice, Hearings, Bench Trials, and Jury Trials.</p>"
}