{
    "companyName": "The Frank Santini Law Firm - Tampa, FL",
    "address1": "9270 Bay Plaza Blvd.",
    "address2": "Suite 618",
    "city": "Tampa",
    "state": "FL",
    "zip": "33619",
    "website": "https://realaccidentlawyer.com",
    "phone": "813-445-6121",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5178380/pid_1/the_frank_santini_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://realaccidentlawyer.com?refPageViewId=6b47b522f6b80362\" class=\"profile-website-body\" target=\"new\"> https://realaccidentlawyer.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://realaccidentlawyer.com/legal-news/?refPageViewId=6b47b522f6b80362\"> https://realaccidentlawyer.com/legal-news/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/the-frank-santini-law-firm/fl/riverview/NTE3ODAzM18x/PP\"> The Frank Santini Law Firm </a> (Main Office) <span class=\"pp_card_street\"> 7269 Bucks Ford Dr. </span><span class=\"pp_card_street\"><span>Riverview</span>, <span>FL</span><span> 33578 </span></span><span class=\"pp_card_street\"> (888) 645-3055 </span></p>"
        },
        {
            "lawyersAtTheFrankSantiniLawFirmSelectedForASuperLawyers®List": "<ul><li> Santini, Frank <a href=\"/profile/lawyer/frank-santini/fl/riverview/NDMyNDE5OF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-frank-santini-law-firm/fl/tampa/NTE3ODM4MF8x/PP?refPageViewId=6b47b45df57067e0#otherlocations",
    "description": "<p>Originally established in Riverview, Florida, The Frank Santini Law Firm has an additional law office in Tampa, from which we provide exceptional representation to clients in the greater Tampa Bay region and surrounding areas who have suffered an injury or loss as the result of someone else's negligence or wrongdoing.</p><p>A former professional wrestling champion, attorney Frank Santini is ready to jump in the ring and fight for your rights and entitlements after a preventable tragedy has left you or a loved one seriously injured or worse. Over the course of our history, we have successfully handled all types of personal injury and wrongful death claims, including those arising from car and truck accidents, workplace accidents, medical malpractice, dangerous property conditions and more.</p><p>From our efforts, we have secured millions of dollars in settlements and verdicts for our plaintiff clients, and Mr. Santini is AV Preeminent peer review rated* through Martindale-Hubbell, the highest rating. He has also received a lawyer rating of 10 from Justia and many other accolades and top rankings from his peers. In addition, we have earned \"Superb\" client ratings on Avvo, and our law firm holds an A rating and accreditation from Better Business Bureau.</p><p>This means you can trust us with your most sensitive legal matters, and we promise to do whatever we can to help increase your chances of obtaining the maximum amount of compensation that you deserve. For more information, you can contact The Frank Santini Law Firm by calling our office or visiting our website to schedule a free initial consultation.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer-review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}