{
    "companyName": "Valenzuela Law Firm, P.A. - Tampa, FL",
    "address1": "100 North Tampa Street",
    "address2": "Suite 2350",
    "city": "Tampa",
    "state": "FL",
    "zip": "33602",
    "website": "https://www.vallaw.com",
    "phone": "813-217-5613",
    "fax": "813-272-1429",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1519794/pid_1/valenzuela_law_firm_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Professional Malpractice|Premises Liability|Product Liability|Wrongful Death|Motor Vehicle Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.vallaw.com?refPageViewId=6b2e8c8596de09f2\"> https://www.vallaw.com </a>"
        },
        {
            "lawyersAtValenzuelaLawFirm,P.A.SelectedForASuperLawyers®List": "<ul><li> Valenzuela, Henry E. <a href=\"/profile/lawyer/henry-e-valenzuela/fl/tampa/Mjg0NTc4OV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Professional Malpractice|Premises Liability|Product Liability|Wrongful Death|Motor Vehicle Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/valenzuela-law-firm-pa/fl/tampa/MTUxOTc5NF8x/PP?refPageViewId=6b2e8b26f06c0366",
    "description": "<p align=\"left\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">Mr. Valenzuela has devoted his entire career to representing victims of wrongful acts against those responsible for such injustices. Valenzuela Law Firm has successfully litigated and tried cases against many of this country's most difficult industrial and financial concerns. Our firm's source of clients comes strictly from the results we have achieved for our clients.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">Our firm has successfully litigated personal injury and wrongful death cases against hospitals, physicians, developers, manufacturers, retailers, banks, railroads, contractors, trucking companies, governmental agencies, municipalities, insurance companies, amusement parks, entertainment establishments and others. We have had numerous landmark verdicts and we have collected millions of dollars in damages for our clients.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">We understand that a personal injury concerns the entire family. Whether it is an injured spouse, parent, or child, the entire family is affected. We are skilled at presenting cases so that an insurance company, opposing lawyer or jury appreciates the impact on both the injured person as well other family members.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">Our firm understands how important it is to help those who have been injured to obtain the benefits and compensation that they deserve. We know that dealing with insurance companies and their vast resources is intimidating and that you look to your lawyer for guidance as you encounter obstacles while you recover from your injuries or adjust to living with a long-term disability.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">We pride ourselves on providing personal attention and service that goes beyond the rules of professional responsibility. When representation requires litigation, we are aggressive trial lawyers, who are not afraid to fight to protect the rights of our injured clients. We are aware of the risks and costs associated with protracted litigation and we constantly seek creative ways for the early settlement of cases that provide our clients with the full compensation to which they are entitled.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">But, there is a difference between a firm that settles cases because it is afraid to go to trial and one that settles cases because resolution is in the best interests of the client. Although most cases settle prior to trial, significant recoveries are only achieved after exhaustive investigation, exacting preparation, and hard work. Insurance companies and their attorneys know which attorneys are afraid or unwilling to take cases to trial. An insurance company with this knowledge has no incentive to negotiate or present you with a reasonable offer to resolve a case. They often base their value of a case on the reputation of your lawyer. Insurance companies and defense attorneys throughout Florida and the country know that we thoroughly prepare our cases and we will proceed to a jury verdict when it is in the best interest of our client. Our results have made this very clear.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">We are proud of our reputation for aggressive representation on behalf of our clients in both the state and federal courts.</font></p><p style=\"margin: 0in 0in 10pt\" class=\"Body\"><font face=\"arial,helvetica,sans-serif\" size=\"2\">Satisfied clients remain our firm's greatest source of new clients and cases. Attorneys throughout Florida and the country discuss cases with us and refer clients to us. Our commitment to excellence has resulted in substantial recoveries for our clients. We can assure you that we will provide you with the highest quality representation. </font></p><p align=\"left\"></p>"
}