{
    "companyName": "Wagar Hickman, LLC - Mandeville, LA",
    "address1": "1590 West Approach",
    "address2": "Suite 2",
    "city": "Mandeville",
    "state": "LA",
    "zip": "70471",
    "website": "https://www.wagarhickman.com/",
    "phone": "985-888-8740",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1305313/pid_1/wagar_hickman_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Civil Litigation|Medical Malpractice|Products Liability|Commercial Litigation|Divorce, Child Custody and Successions|Maritime and Admiralty|Other Serious Personal Injuries"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.wagarhickman.com/?refPageViewId=6bd9769634830247\" class=\"profile-website-body\" target=\"new\"> https://www.wagarhickman.com/ </a>"
        },
        {
            "lawyersAtWagarHickman,LLCSelectedForASuperLawyers®List": "<ul><li> Wagar, Chip <a href=\"/profile/lawyer/chip-wagar/la/mandeville/MzM3MzY5NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Civil Litigation|Medical Malpractice|Products Liability|Commercial Litigation|Divorce, Child Custody and Successions|Maritime and Admiralty|Other Serious Personal Injuries",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/wagar-hickman-llc/la/mandeville/MTMwNTMxM18x/PP?refPageViewId=6bd9767962a967b6",
    "description": "<p>With nearly 40 years of experience in civil litigation and medical malpractice, the attorneys at Wagar Hickman, LLC in Mandeville, Louisiana, are known for their comprehensive approach to complex civil litigation. Whether we are seeking compensation on behalf of a victim of a medical malpractice or handling a child custody matter arising out of a divorce, we start with listening to our clients and remain loyal to them through every phase of our representation. </p><p>Passionate advocacy is the reason that our lawyers have had widespread success throughout Southern Louisiana and the Gulf Coast region. Among our accomplishments are the following: </p><ul class=\"unIndentedList\"><li>An $8 million verdict in a medical malpractice case in Louisiana for the wrongful death of a child after misdiagnosis and delayed treatment; the highest award ever made to a single victim of medical malpractice in Louisiana legal history;</li><li>A $1.3 million settlement following a post-surgical infection and misdiagnosis.</li><li>A $1.25 million settlement for a victim whose leg was amputated due to post-surgical malpractice.</li><li>A $2.725 settlement for a client who suffered permanent paralysis as the result of medical negligence. </li></ul><p>These results - as well as our approachability and compassionate representation - is why we have attained numerous honors such as being named a Super Lawyer, as well as an American Institute of Legal Advocates \"Rising Star\"; receiving the highest peer review rating possible of AV Preeminent* from Martindale-Hubbell; having an Avvo \"Superb\" rating; and being a Life Member of the Million Dollar Advocates Forum. </p><p>Our greatest satisfaction comes from knowing that we steered someone through a difficult time and onto a better path. At our law office, we strongly believe in our role as a counselor. We are a source of support when people need it most. Wagar Hickman offers free initial consultations. </p><p>* AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}