{
    "companyName": "Waldman Legal Group PLLC - Houston, TX",
    "address1": "8584 Katy Freeway",
    "address2": "Suite 102",
    "city": "Houston",
    "state": "TX",
    "zip": "77024",
    "website": "https://waldman.legal/",
    "phone": "713-688-4878",
    "fax": "832-284-7039",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3413874/pid_1/waldman_legal_group_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Litigation|Work Accidents|Work Injury Law|Worker’s Compensation Law|Non-Subscriber Law|Job Injuries"
        },
        {
            "languages": "English|Spanish"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://waldman.legal/?refPageViewId=6c4401e715c109ee\" class=\"profile-website-body\" target=\"new\"> https://waldman.legal/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Litigation|Work Accidents|Work Injury Law|Worker’s Compensation Law|Non-Subscriber Law|Job Injuries",
    "litigation": "",
    "languages": "English|Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/waldman-legal-group-pllc/tx/houston/MzQxMzg3NF8x/PP?refPageViewId=6c4401b8117c21bb",
    "description": "<p>At the personal injury law firm of Waldman Legal Group PLLC, we fight for those injured due to the negligent conduct of others. We serve clients living in Houston, Texas, the Rio Grande Valley, and throughout the state of Texas. Our attorneys are committed to giving you the peace of mind you deserve throughout this difficult time. For your convenience, we speak English and Spanish.</p><p>During a free initial consultation, we will discuss with you your situation and needs. Placing an emphasis on communication, our attorneys will make sure your questions are answered and your concerns are addressed. We will keep you informed through each phase of the process, and help you understand your rights and options so you feel prepared to make the important decisions regarding your case and your future. When you work with our law firm team, you can count on us to stand by your side and tenaciously advocate on your behalf.</p><p>Our attorneys possess a strong background of fighting against insurance companies and large corporations. We have handled a variety of lawsuits, including auto, maritime, and aviation accidents; on-the-job injuries; medical malpractice, hospital negligence, and birth trauma; product liability; and medical device and pharmaceutical injuries. With more than 40 years of combined legal experience, our attorneys know what it takes to help you obtain justice.</p><p>We know that each case is unique, and we tailor our strategy to meet your legal needs and objectives.</p>"
}