{
    "companyName": "Bowden Cyr, PLLC - Oakdale, MN",
    "address1": "7825 3rd Street North",
    "address2": "Suite 204",
    "city": "Oakdale",
    "state": "MN",
    "zip": "55128",
    "website": "https://www.bowdencyr.com",
    "phone": "612-254-6409",
    "fax": "651-731-5496",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4174018/pid_1/bowden_cyr_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Family Law"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.bowdencyr.com?refPageViewId=6c0b818c644f67e7\"> https://www.bowdencyr.com </a>"
        },
        {
            "lawyersAtBowdenCyr,PLLCSelectedForASuperLawyers®List": "<ul><li> Bowden Gunst, Susan <a href=\"/profile/lawyer/susan-bowden-gunst/mn/oakdale/Mjc0ODExMF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Watson Cyr, Lisa <a href=\"/profile/lawyer/lisa-watson-cyr/mn/oakdale/MzE4Njg0Nl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Family Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/bowden-cyr-pllc/mn/oakdale/NDE3NDAxOF8x/PP?refPageViewId=6c0b816d56ef0362",
    "description": "<p>At Bowden Cyr, PLLC, in Oakdale, Minnesota, we believe in providing nothing less than success for our clients who are looking for a law firm that makes people feel welcome and confident that their stories will be heard. Our law firm focuses on helping real people through real problems and making our clients feel at ease. We do not overpromise and underdeliver. We manage our clients’ expectations by properly assessing the facts of the case with the current law that applies to their specific situation. We provide advice that involves realistic solutions.</p><p><strong>Meet Our Founders </strong></p><p>Susan Bowden Gunst has spent her law firm career aggressively advocating for her clients and has arbitrated, mediated and litigated hundreds of cases in the areas of auto crashes, no-fault claims, uninsured and underinsured claims, animal attacks and wrongful death claims. Her vast litigation experience includes wrongful death, personal injury and medical malpractice claims. Susan received her Bachelor of Science from Minnesota State University Moorhead and her Juris Doctor from the William Mitchell College of Law. She is a member of the Minnesota State Bar Association and the Minnesota Association for Justice.</p><p>Lisa Watson Cyr has devoted her career to family law. She is an effective negotiator who endlessly strives to best serve her clients through negotiated settlements or court trials, depending on the facts of the case. Lisa has resolved hundreds of cases through settlement or trial involving issues in divorce, custody, parenting, child support and alimony/spousal maintenance matters. Lisa received her Bachelor of Arts from the University of Minnesota Duluth and her Juris Doctor from the William Mitchell College of Law. She is a member of the Minnesota State Bar Association and holds the AV Preeminent* peer review rating from Martindale-Hubbell for her ethical standards.</p><p>When you come to Bowden Cyr, PLLC, for a free initial consultation, you will find our law firm provides not only a compassionate ear, but also years of practical legal experience. We take the time to answer questions and make you feel comfortable and well-informed.</p><p class=\"smallText\">*AV®, AV Preeminent®, Martindale-Hubbell Distinguished, and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards, and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating fall into two categories – legal ability and general ethical standards.</p>"
}