{
    "companyName": "McDonald & MacGregor, LLC - Scranton, PA",
    "address1": "220 Penn Avenue",
    "address2": "Suite 320",
    "city": "Scranton",
    "state": "PA",
    "zip": "18503",
    "website": "https://www.mmmmlaw.com",
    "phone": "570-209-8893",
    "fax": "570-209-7294",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4631978/pid_1/mcdonald_macgregor_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.mmmmlaw.com?refPageViewId=6c439199369002e4\"> https://www.mmmmlaw.com </a>"
        },
        {
            "lawyersAtMcDonald&MacGregor,LLCSelectedForASuperLawyers®List": "<ul><li> MacGregor, Malcolm L. <a href=\"/profile/lawyer/malcolm-l-macgregor/pa/scranton/MjE0OTU0NV8x/PP#feedback\">On a Super Lawyers® List</a></li><li> McDonald, Michael J. <a href=\"/profile/lawyer/michael-j-mcdonald/pa/scranton/MTc3MTUyMl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/mcdonald--macgregor-llc/pa/scranton/NDYzMTk3OF8x/PP?refPageViewId=6c438faaa47767c8",
    "description": "<p></p><p>It may take only seconds to suffer a serious injury, but its effects have far-reaching and long-lasting consequences to your life. Here at McDonald &amp; MacGregor, LLC, we understand you need a compassionate and competent advocate who knows that, even if the disruption to your life is short-lived, the financial toll could affect you for some time. From our office in Scranton, Pennsylvania, our law firm helps individuals who are facing legal issues stemming from the following issues:</p><ul><li>Work-related injuries</li><li>Medical malpractice</li><li>Nursing home neglect and abuse</li><li>Motor vehicle accidents</li><li>Slip-and-fall claims</li><li>Wrongful death claims</li></ul><p>The last thing you need right now is to worry about how you will support you and your family. As your medical bills, lost wages and other damages continue to rise, you may want to accept the first settlement offer that comes along, but that will more than likely end up being a mistake.</p><p>Our law firm's first priority is protecting your rights since no one else involved will. Insurance companies, employers and other parties typically only look out for their own interests, not yours. They will often take any opportunity to delay or deny your insurance claims, make you a low and unsatisfactory settlement offer, and otherwise complicate your pursuit of benefits and compensation.</p><p>Our attorneys understand you are probably feeling a great deal of anxiety over your situation. We can help alleviate your stress by putting our law firm's knowledge, resources and experience to work for you. Before you make any decisions that will affect your life well into the future, contact McDonald &amp; MacGregor, LLC, to schedule a free initial consultation in order to gain an understanding of your rights and legal options.</p>"
}