{
    "companyName": "Ackerman & Falcon, LLP - Vienna, VA",
    "address1": "8221 Old Courthouse Rd.",
    "address2": "#201",
    "city": "Vienna",
    "state": "VA",
    "zip": "22182",
    "website": "https://www.ackermanlawfirm.com/",
    "phone": "703-835-9479",
    "fax": "703-636-3052",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2382240/pid_1/ackerman_falcon_llp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "languages": "Spanish"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.ackermanlawfirm.com/?refPageViewId=6c4b2c04e06e67e1\" class=\"profile-website-body\" target=\"new\"> https://www.ackermanlawfirm.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/ackerman--falcon-llp/va/vienna/MjM4MjI0MF8x/PP?refPageViewId=6c4b2bc3f7601287",
    "description": "<p>Over 50 years combined experience. If you've been injured, call for your free consultation.</p><p>At the law office of Ackerman &amp; Falcon, LLP, in Vienna, Virginia, we devote our practice exclusively to helping people who have suffered an injury or loss obtain the full amount of compensation they deserve to cover their expenses and provide for themselves and their families.</p><p>Serving plaintiff clients throughout northern Virginia, award-winning attorneys Howard Ackerman and David Falcon have successfully handled over 1,000 personal injury and workers' compensation claims, netting millions of dollars in total recoveries to date. We are local, peer-review rated AV Preeminent* through Martindale-Hubbell, whom you can trust with your most sensitive legal matters, and we are committed to do whatever we can to help you achieve the most favorable outcome for your situation.</p><p>Whether your suffering is the result of a workplace accident, a motor vehicle accident caused by someone else, or a mishap that happened on someone else's property, you can turn to our law firm for the highest level of personalized advocacy and support to help you get the justice you deserve.</p><p>If a serious injury or devastating loss has left you uncertain as to how you will pay medical expenses and provide for your loved ones, contact Ackerman &amp; Falcon, LLP, and speak with us free of charge. We will not require a fee from you unless we win your case, and we can meet you at your home or hospital room if you cannot make it to our office.</p><p></p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}