{
    "companyName": "The Fleck Firm, PLLC - Elizabethtown, KY",
    "address1": "2413 Ring Road",
    "address2": "Suite 117",
    "city": "Elizabethtown",
    "state": "KY",
    "zip": "42701",
    "website": "https://thefleckfirm.com/",
    "phone": "270-238-8613",
    "fax": "270-446-1010",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5197476/pid_1/the_fleck_firm_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Motor Vehicle Accidents|Personal Injury|Premises Liability|Dog Bites|Trucking|Probate and Estate Planning"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> Open 24 Hours <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://thefleckfirm.com/?refPageViewId=6bd946f183b20302\" class=\"profile-website-body\" target=\"new\"> https://thefleckfirm.com/ </a>"
        }
    ],
    "practiceAreas": "Motor Vehicle Accidents|Personal Injury|Premises Liability|Dog Bites|Trucking|Probate and Estate Planning",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Open 24 Hours <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-fleck-firm-pllc/ky/elizabethtown/NTE5NzQ3Nl8x/PP?refPageViewId=6bd9467ae300030a",
    "description": "<p>Located in Elizabethtown, Kentucky, The Fleck Firm, PLLC, provides invaluable counsel and support to clients across their region who suffered a serious injury or loss as the result of someone else's negligence. In addition, the law firm also provides unmatched representation for all areas of estate planning and probate to help you protect yourself and your loved ones for the future.</p><p>Established by top-ranked attorney and Army veteran Tyler Fleck, The Fleck Firm, PLLC, has become the trusted source for quality, professional and effective legal counsel to a diverse range of clients throughout Hardin County and the surrounding areas who have legal needs involving any of the following:</p><ul><li>Car, truck and motorcycle accidents</li><li>Slip-and-fall accidents</li><li>Dog bites</li><li>Estate planning</li><li>Probate</li></ul><p>To date, Mr. Fleck has recovered substantial settlements and verdicts for his plaintiff clients, and you can rely on him for the highly personalized counsel you need delivered with the utmost compassion and integrity. Mr. Fleck utilizes the latest in legal technology to help you resolve your matter as efficiently as possible. His law firm takes a contingency fee of only 25% after successfully winning your case, as opposed to other law firms that take as much as 50% of your total settlement. </p><p>In addition, Mr. Fleck will gladly come to your home or hospital room if your injuries prevent you from coming to his law office, and he offers free initial consultations as well as virtual consultations to help keep you and your loved ones safe and healthy in these uncertain times.</p><p>To begin the process, you can contact Mr. Fleck at The Fleck Firm, PLLC, for a no-cost, no-obligation evaluation of your claim or for a consultation regarding your estate planning and administration needs.</p>"
}