{
    "companyName": "Goldman & Associates Law Firm - Livonia , MI",
    "address1": "39111 6 Mile Rd",
    "address2": "",
    "city": "Livonia",
    "state": "MI",
    "zip": "48152",
    "website": "https://www.akivagoldman.com/",
    "phone": "800-559-5378",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4845941/pid_1/goldman_associates_law_firm.jpg",
    "moreBlocks": [
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> 9:00 - 5:00 pm <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.akivagoldman.com/?refPageViewId=6c0b586e258567de\" class=\"profile-website-body\" target=\"new\"> https://www.akivagoldman.com/ </a> (Lawyers in Michigan) <a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.epsilon-media.com/?refPageViewId=6c0b586e258567de\"> http://www.epsilon-media.com/ </a> (Michigan Attorneys Blog Website)"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/5085035_1\"> Goldman &amp; Associates Law Firm </a><span class=\"pp_card_street\"> 28175 Haggerty Rd. </span><span class=\"pp_card_street\"><span>Novi</span>, <span>MI</span><span> 48375 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p><p><a href=\"/profile/view/5085030_1\"> Goldman &amp; Associates Law Firm </a><span class=\"pp_card_street\"> 26677 W. 12 Mile </span><span class=\"pp_card_street\"><span>Southfield</span>, <span>MI</span><span> 48034 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p><p><a href=\"/profile/view/5085031_1\"> Goldman &amp; Associates Law Firm </a><span class=\"pp_card_street\"> Seven W. Square Lake Rd. </span><span class=\"pp_card_street\"><span>Bloomfield Hills</span>, <span>MI</span><span> 48302 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p><p><a href=\"/profile/lawfirm/goldman--associates-law-firm/mi/troy/MzM5NDI0NV8x/PP\"> Goldman &amp; Associates Law Firm </a> (Main Office) <span class=\"pp_card_street\"> 3150 Livernois Road #335 </span><span class=\"pp_card_street\"><span>Troy</span>, <span>MI</span><span> 48083 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p><p><a href=\"/profile/lawfirm/goldman--associates-law-firm/mi/detroit/NDM2MDg1NF8x/PP\"> Goldman &amp; Associates Law Firm </a><span class=\"pp_card_street\"> 615 Griswold St </span><span class=\"pp_card_street\"><span>Detroit</span>, <span>MI</span><span> 48226 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p><p><a href=\"/profile/view/5085034_1\"> Goldman &amp; Associates Law Firm </a><span class=\"pp_card_street\"> 625 Kenmoor Avenue S.E. </span><span class=\"pp_card_street\"> Ste. 301 </span><span class=\"pp_card_street\"><span>Grand Rapids</span>, <span>MI</span><span> 49546 </span></span><span class=\"pp_card_street\"> 800-559-5378 </span></p>"
        },
        {
            "lawyersAtGoldman&AssociatesLawFirmSelectedForASuperLawyers®List": "<ul><li> Goldman, Akiva <a href=\"/profile/lawyer/akiva-goldman/mi/troy/MTE0MjAwNl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> 9:00 - 5:00 pm <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/4845941_1?refPageViewId=6c0b584cd31612a7",
    "description": "<span style=\"font-size: 10pt; font-family: Arial\"><span style=\"font-size: 11pt; font-family: Arial\"><font face=\"Times New Roman\"><font face=\"arial,helvetica,sans-serif\"><font size=\"2\"><span style=\"font-size: 11pt; font-family: Arial\"><p><span style=\"font-size: 11pt; font-family: Arial\">Get Legal Advice - Free Consultation - 24 Hours (24/7) with an expert Legal Adviser. </span><span style=\"font-size: 11pt; font-family: Arial\">Our Lawyer in Michigan can help you. Call today for your 24/7 FREE CONSULTATION (248) 588-3333 or (877) 737-8800 (toll-free) 24 hour legal advice phone number. We have a successful track record of aggressive legal representation. Let us use our strengths to your advantage. For additional information or for <strong>Free Legal Advice in Michigan</strong>, please visit us at <font color=\"#0000ff\">www.akivagoldman.com</font>. </span></p><p><span style=\"font-size: 11pt; font-family: Arial\">Goldman &amp; Associates offers residents of Michigan the experienced counsel they need in matters of family, criminal and personal injury law. Our law firm is committed to providing representation focused on effectively managing each legal issue in order to reach the best possible outcome for our clients.</span></p><p><span style=\"font-size: 11pt; font-family: Arial\">We recognize that people in transition due to divorce, child custody or support disputes or in the crisis of domestic violence need seasoned legal advice in order to safeguard the best interests of their families. Our law firm is well versed in promoting dispute resolution through mediation, and we help our family law clients reach amicable agreements when possible. As well as representing clients in divorce and support matters, we help individuals anticipating marriage protect their interests through prenuptial agreements.</span></p><p><span style=\"font-size: 11pt; font-family: Arial\">With 24 years of legal experience, Mr. Goldman benefits his criminal law clients with attentive representation designed to defend their rights against misdemeanor or felony charges including DUI, assault and battery, weapons possession, criminal sexual conduct and fraud such as white collar crime.</span></p><p><span style=\"font-size: 11pt; font-family: Arial\">Mr. Goldman has authored many legal articles and continues to serve the community, contributing legal information and education including lectures to medical institutes and an August 2010 appearance on Bloomfield Community Television's program, Practical Law.</span></p><p><span style=\"font-size: 11pt; font-family: Arial\">Goldman &amp; Associates maintains several office locations in Oakland, Wayne and Macomb counties. Serving Michigan clients in the tri-county area in cities including Sterling Heights, Detroit, Southfield, Bloomfield Hills, Mount Clemens, Warren, Farmington Hills and West Bloomfield, our law firm provides free initial phone consultations, offers counsel to Albanian, Russian and Ukrainian speaking clients, and skillfully utilizes technology to provide the best possible customer service to our clients. Contact Goldman and Associates at 248-588-3333 or toll free at 877-737-8800 to discuss your legal needs.</span></p><p><span style=\"font-size: 11pt; font-family: Arial\">We are expert trial attorneys. Some of our clients consider us to be the best lawyers / best attorneys / top law firms in Michigan. <strong><span style=\"font-family: Arial\">*** (248) 588-3333 (24 Hours) Legal Advice and Free Consultation</span></strong></span></p><p style=\"margin: 0in 0in 0pt\" class=\"MsoNormal\"><span style=\"font-size: 10pt; font-family: Arial\">A sampling or our practice areas include:<br><br>* DBA Name \"Doing Business As\" in Michigan and DBA Name in Wayne county, Legal name change law firm in Michigan, legal name change attorney in Detroit, marriage name change attorney in Michigan, child name change in Dearborn, name change attorney in Michigan, name change minor in Lansing, last name change Birmingham MI, change your name Ann Arbor<br><br>* accident i 94 michigan, michigan personal injury protection, accident report michigan, attorneys detroit, attorney troy, michigan, attorneys in detroit michiganattorney bankruptcy lawyer michigan, attorney lansing mi, attorney troy michigan, attorneys detroit, birth injury lawyer michigan mi, car accident attorney michigan, attorneys grand rapids mi, personal injury, lawyers michigan, law firms michiganattorneys in flint michigan, bankruptcy lawyers in detroit michigan, best law firms in michigan, detroit legal, adoption attorneys in michigan, michigan divorce lawyers, michigan divorce lawyers for men, michigan dog bite attorneymichigan accident lawyer, michigan attorney search, attorney detroit michigan, attorney malpractice michigan, car accident attorney michigan, accident i-75 michigan, accident in michigan, fireworks laws, attorneys in lansing mi, best lawyers in michigan, detroit divorce lawyers, court appointed attorney michigan, attorney grand rapids michigan, michigan durable power of attorney form, michigan personal injury lawyers, michigan legal services, attorney southfield mi, michigan security deposit law, michigan slip and fall attorney, michigan social security lawyer, michigan social security lawyers, michigan brain injury lawyer, michigan business law, michigan car accident attorney, michigan criminal law attorney, michigan criminal law lawyer michigan criminal law statutesmichigan mip law, truck accident michigan, unemployment attorney michigan, michigan motorcycle accident, detroit law firm, detroit lawyers, detroit michigan lawyers, detroit personal injury lawyers, michigan brain injury lawyer, detroit top law firms, detroit michigan lawyers, disability attorney michigan, michigan owi lawyer, michigan drug law, michigan marriage law, michigan drunk driving attorney, michigan personal injury attorney, traffic lawyers michigan, truck accident attorney michigan, michigan law enforcement, michigan law firm, wayne county attorney, michigan lien law, michigan malpractice attorney, bankruptcy attorney in michigan, accident michigan, accident on i 75 in michigan, attorney bankruptcy lawyer michigan<br><br>* Small Claims Court in Michigan Grand Rapids, Small Claims Court attorney in Oakland county Michigan, small claims court law firm in Macomb county, small claims court Detroit mi, small claims lawyers in Sterling Heights MI, small business legal advice in Southfield, small business attorney in Livonia, small business law firm in Detroit, small business litigation saginaw, small business law firm grand rapids, small business attorneys sterling heights, small business legal advice troy MI, landlord tenant lawyer Michigan ann arbor, landlord tenant lawyer southfield, general attorney in Michigan pontiac, general attorney in Detroit, general attorney in Southfield MI, real estate law firm southfield, real estate lawyer southfield, small business detroit michigan, general attorney in michigan lansing, unclaimed property estates oakland county, Michigan Animal Rights Law Lawyers lansing, how to file for divorce sterling heights, breach of contract defense ann arbor, breach of contract letter livonia, breach of contract lawsuit dearborn, mediation vs arbitration sterling heights, mediation process lansing, mediation process child custody southfield, divorce lawyer Sterling Heights, child custody attorney Warren </span></p><p><span style=\"font-size: 10pt; font-family: Arial\">* Accident insurance claim in Detroit, homeowners insurance claims in Southfield, insurance claims process in Michigan Muskegon, various legal forms Michigan Detroit and legal documents in Wayne county, insurance claims in Michigan ann arbor, insurance claims litigation Detroit, assist insurance claims adjuster issues Michigan lansing, insurance claims lawsuit Southfield, contract law offices Troy, contract review lawyers Michigan, legal demand letters lawyer Michigan detroit, demand letter attorney general Troy MI, demand letter personal injury Warren, motor vehicle accident insurance claim Sterling Heights, speeding tickets in michigan port huron<br><br>* Fight traffic ticket detroit, cheap traffic ticket detroit, cheap traffic ticket lawyer pontiac, cheap traffic ticket attorney sterling heights, cheap traffic ticket lawyer royal oak, cheap traffic ticket attorney madison heights, cheap traffic ticket lawyer warren, cheap traffic ticket lawyer pontiac, cheap traffic ticket attorney in Michigan pontiac, lawyer traffic ticket pontiac, fight traffic defense southfield, traffic ticket attorney michigan spring lake, traffic ticket lawyer michigan lake orion, lawyer traffic ticket Warren, attorney traffic ticket Pontiac, livonia traffic lawyers, canton traffic lawyers, detroit traffic lawyers, michigan traffic lawyers kalamazoo, traffic ticket points michigan sterling heights, traffic ticket court michigan ann arbor, traffic ticket court defense Dearborn, traffic ticket lawyer farmington hills, beat traffic ticket in court michigan farmington hills, how to beat a traffic ticket plymouth, how to beat a traffic violation michigan Brighton MI, points on license michigan southfield, points on license for speeding michigan detroit, michigan points on license for speeding macomb county, speeding tickets in michigan ferndale, speeding tickets in pontiac, speeding ticket points michigan plymouth, speeding ticket attorney michigan ann arbor, speeding ticket lawyer detroit, speeding ticket law firm southfield<br><br>* Legal wills in Michigan east lansing, simple wills in Michigan grand rapids, wills attorney Livonia, living will Michigan lake orion, living will attorney Birmingham MI, will forms bloomfield hills, power of attorney Michigan sterling heights, power of attorney Detroit, power of attorney Wayne county, durable power of attorney sterling heights, quick claim deed Michigan southfield, notary public in Detroit, notary public Wayne county MI, notary public Macomb county MI, trust attorney in Detroit, revocation of power of attorney livonia, durable power of attorney Michigan plymouth, revoking power of attorney pontiac, medical power of attorney, limited power of attorney in Detroit, financial power of attorney Warren, general power of attorney in Southfield, power of attorney lawyer southfield, lawsuit attorney birmingham MI, how to file a lawsuit sterling heights, how to file a lien on property in detroit, how to file for child support in wayne county, how to file for child custody in bloomfield hills, how to file for divorce oakland county, how to file for divorce in macomb county michigan, child support laws southfield<br><br>* Collections attorney michigan dearborn, Debt collections Sterling Heights Michigan, collections Detroit, debt collections Southfield, debt collections lawyer Detroit, debt collections Wayne county, debt collections Oakland county attorney, debt collection laws in Michigan sterling heights, debt collection agencies sterling heights, collections attorney in Detroit, collections law firm in Detroit, collections lawyer lansing, collections attorney grand rapids, collections lawyer southfield, debt collections attorney detroit, Debt collections lawyer detroit, Debt collections lawyer southfield, Debt collections attorney Troy MI<br><br>* Michigan professional license attorneys kalamazoo, profession license defense michigan ann arbor, license restoration attorney detroit, professional license lawyer michigan birmingham mi, professional license attorney michigan bloomfield hill, professional license restoration michigan lansing, drivers license restoration michigan east lansing, drivers license restoration lawyers michigan detrot, Internet sex crimes lawyer oak park MI, chat room solicitation attorney White Lake MI, Internet solicitation of a minor Madison Heights, possession child pornography lawyer Oak Park, distribution of child pornography lawyer Ferndale, White collar crimes Southgate MI, White collar crimes Eastpointe MI, identity theft Northville MI, billing fraud law firm plymouth, acts of bribery Garden City MI, extortion attorney Mount Pleasant, blackmail attorney Allen Park, Cyberstalking attorney Inkster MI, drivers license restoration Port Huron, internet crimes St. Clair, billing fraud Washington MI, Romulus white collar attorney, Auburn Hills drug possession attorney, white collar crime attorney Birmingham MI, breach of contract lansing </span></p><p style=\"margin: 0in 0in 0pt\" class=\"MsoNormal\"><span style=\"font-size: 10pt; font-family: Arial\">* Determining the best interests of the child Bingham Farms, law firm bingham, bingham law firm, child protective services cps Detroit, cps child Michigan, child protective services report Southfield, reporting to child protective services Pontiac, best interest of the child factors Troy MI, interference with visitation Mount Clemens, children of unmarried parents Oakland county, protective child services Macomb county, child and protective services wayne county, parent neglect detroit, family and child protective services Michigan, post judgment Clinton Township, step parents and child support Mount Clemens, step parents and children Detroit, child rights issues Utica, parenting visitation Wayne County, protective services Michigan, domestic violence call Shelby, canton family court, custody issue Madison Heights, custodial order Ann Arbor, 50 50 parenting plan Lake Orion, joint custody school Oakland County, child protective services mi, sharing custody of children Warren, parenting plan schedule Bloomfield Hills, best interest of the child law West Bloomfield, false allegations of child neglect Farmington Hills, child custody services Macomb county, contacting child protective services Detroit, kent county child support, change in circumstances child support Novi, parental visitation Tayloir, parenting schedule Michigan, cps child abuse Dearborn Heights, non custodial parent relocation Waterford, michigan child support office, office of child abuse and neglect Brighton MI, allegations of abuse Detroit, parental abuse by child Michigan, parent child visitation Redford, wayne county mi child support, unmarried couples with children Rochester Hills, unmarried couples children Royal Oak, parental right Southfield, reporting child abuse and neglect Detroit, wayne county michigan child support, wayne county attorney, attorney wayne county, support a child Oakland county, primary physical custody Troy Mi, custody child support Birmingham MI, child support custody Michigan, child custody and child support Shelby, child custody and support Sterling Heights, legal rights for unmarried couples with children Mount Clemens, custody support Pontiac, factors in determining child custody Birmingham MI, couples rights Sterling Heights, determining child support Warren, your legal advice Michigan </span></p><p><span style=\"font-size: 11pt; font-family: Arial\"><br></span><span style=\"font-size: 10pt; font-family: Arial\">*** We represent clients throughout the state of Michigan including Detroit, Southfield, Sterling Heights, Troy, Warren, Mount Clemens, Pontiac, Birmingham, Bloomfield Hills, Dearborn, Livonia, Farmington Hills, Utica, Novi, Royal Oak, Ann Arbor, Lansing, East Lansing, Grand Rapids, Flint, Utica, West Bloomfield, Clinton Township, Warren, Mount Clemens, Shelby Oakland County, Wayne County, Macomb County, Washtenaw County, Livingston County and Monroe County<br><br></span></p></span></font></font></font></span></span>"
}