{
    "companyName": "Law Office of Dawn S. Veltman, Esq. - Upper Marlboro, MD",
    "address1": "9701 Apollo Drive",
    "address2": "",
    "city": "Upper Marlboro",
    "state": "MD",
    "zip": "20774",
    "website": "https://www.veltmanlaw.com/",
    "phone": "443-457-8973",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5059430/pid_1/law_office_of_dawn_s_veltman_esq.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Family Law|Divorce|Child Support|Visitation|Custody|Prenups|Personal Injury"
        },
        {
            "proBonoActivities": "<ul><li> American Bar Association, Member </li><li> Maryland State Bar Association, Member </li><li> Prince George's County Bar Association, Member </li><li> Harford County Bar Association, Member </li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.veltmanlaw.com/?refPageViewId=6bd9d381223def16\" class=\"profile-website-body\" target=\"new\"> https://www.veltmanlaw.com/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/the-law-offices-of-dawn-s-veltman-llc/md/bel-air/NDQzMTIwM18x/PP\"> The Law Offices of Dawn S. Veltman, LLC </a> (Main Office) <span class=\"pp_card_street\"> 9 W. Courtland St. </span><span class=\"pp_card_street\"> Suite 102 </span><span class=\"pp_card_street\"><span>Bel Air</span>, <span>MD</span><span> 21014 </span></span><span class=\"pp_card_street\"> 443-457-8973 </span></p>"
        }
    ],
    "practiceAreas": "Family Law|Divorce|Child Support|Visitation|Custody|Prenups|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-office-of-dawn-s-veltman-esq/md/upper-marlboro/NTA1OTQzMF8x/PP?refPageViewId=6bd9d316014c67e4#otherlocations",
    "description": "<p>Offering responsive and accessible counsel to divorcing spouses and families in Upper Marlboro, Maryland, I focus my practice on family law at the Law Offices of Dawn S. Veltman. Generally handling cases involving divorce, child custody and visitation, child support and other such emotionally complex matters, I provide the sensitive and supportive assistance my clients need, so they can begin the process of moving forward with their lives.</p><p>Whether they are filing for divorce, seeking to establish a custody arrangement or taking other such legal actions, I work to assert and protect my clients' rights. I help divorcing spouses fill out and submit the necessary documentation to legally end their unions, as well as aid them in ensuring their marital property is appropriately accounted for. Looking out for the rights of those I represent as parents, as well as the best interest of their children, I assist families with establishing clear physical and legal custody agreements and comprehensive visitation schedules. I also help couples heading to the alter to draft and review prenuptial agreements.</p><p>From my law offices in Upper Marlboro and Bel Air, I am dedicated to serving people in Baltimore and the rest of Harford County, as well as throughout the state. In addition to handling family law-related cases, I also aid clients with criminal defense, personal injury and other civil litigation issues. Empathetic to the stress and upset that legal problems can carry for those involved, I strive to help those I represent to efficiently and favorably resolve their cases. To best serve my clients, I accept credit card payments and offer free consultation for Personal Injury.</p><p>As the founding attorney at the Law Offices of Dawn S. Veltman, I understand the trauma and turmoil that family law cases can have. A licensed mediator, I seek to help families achieve amicable resolutions, while limiting the potential for lasting negative effects. When the situation dictates, however, I offer resolute advocacy and aggressively assert my clients' rights.</p>"
}