{
    "companyName": "Jacobs & Wallace, PLLC - Bridgeport, CT",
    "address1": "1087 Broad Street",
    "address2": "Suite 400",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06604",
    "website": "https://www.jwlawct.com",
    "phone": "203-896-4929",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2504384/pid_1/jacobs_wallace_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Car Accidents|Workers Compensation"
        },
        {
            "litigation": "<ul><li>95%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.jwlawct.com?refPageViewId=6bb1b78c277367bd\"> https://www.jwlawct.com </a>"
        },
        {
            "lawyersAtJacobs&Wallace,PLLCSelectedForASuperLawyers®List": "<ul><li> Jacobs, Adele R. <a href=\"/profile/lawyer/adele-r-jacobs/ct/bridgeport/MTc4NjUzNF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Wallace, Andrew E. <a href=\"/profile/lawyer/andrew-e-wallace/ct/bridgeport/NTEwMTE3NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Car Accidents|Workers Compensation",
    "litigation": "<ul><li>95%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/jacobs--wallace-pllc/ct/bridgeport/MjUwNDM4NF8x/PP?refPageViewId=6bb1b6aef2be67c2",
    "description": "<p>Our attorneys at the Jacobs &amp; Wallace, PLLC law firm in Bridgeport, Connecticut, provide unmatched counsel and support to clients throughout Fairfield County and all across the state who have suffered serious injuries or lost loved ones due to work-related accidents or someone else's negligence or wrongdoing. </p><p>Focusing our practice solely on personal injury, medical malpractice and workers' compensation claims, we offer one of the best chances you have of recovering the maximum amount of compensation you need. During our time in practice, we have secured substantial settlements and verdicts for our plaintiff clients. Furthermore, we have earned memberships in the Million Dollar Advocates Forum, and we have received top trial lawyer designations from the National Trial Lawyers as well as many other top rankings and endorsements from our peers. </p><p>Possessing more than 40 years of combined legal experience, our law firm's attorneys have the extensive skills and resources necessary to handle your matter efficiently, and we promise to do all we can to improve the likelihood that you will obtain the justice you deserve. Along with our outstanding peer rankings, we have also received a \"Superb\" rating on Avvo along with numerous testimonials and referrals from our satisfied clients.</p><p>To find out more about how we can best assist you with securing a better, more financially stable future for yourself and your family, you can contact Jacobs &amp; Wallace, PLLC by phone or through our law firm's website to schedule a free case evaluation. We also currently offer virtual consultations to help keep you and your loved ones safe in these uncertain times.</p>"
}