{
    "companyName": "Fumuso, Kelly, Swart, Farrell, Polin & Christesen LLP - Hauppauge, NY",
    "address1": "110 Marcus Blvd.",
    "address2": "Ste. 500",
    "city": "Hauppauge",
    "state": "NY",
    "zip": "11788",
    "website": "https://www.fksfpc.com",
    "phone": "631-232-0200",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1806118/pid_1/fumuso_kelly_swart_farrell_polin_christesen_llp.jpg",
    "moreBlocks": [
        {
            "previousLawFirmName": "<ul><li> Mirabel, Wortman &amp; Friedel, January 1, 1976</li></ul>"
        },
        {
            "languages": "English|Spanish"
        },
        {
            "practiceAreas": "Insurance Defense|Medical Malpractice"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.fksfpc.com?refPageViewId=6b701b28f60a0247\"> https://www.fksfpc.com </a>"
        }
    ],
    "practiceAreas": "Insurance Defense|Medical Malpractice",
    "litigation": "",
    "languages": "English|Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/1806118_1?refPageViewId=6b701ac3f7dc2257",
    "description": "<p><strong>Fumuso, Kelly, Swart, Farrell, Polin &amp; Christesen LLP </strong>has the distinction of being one of the oldest and most successful medical malpractice and personal injury defense firms in the New York Metropolitan area. Since first being established in 1970, the firm has grown steadily throughout the years, and now comprises 27 attorneys, including 10 partners. One of the hallmarks of the firm has been its stability, with all of the senior partners being associated with the firm between 35 and 27 years.</p><p>Selected by New York Magazine as one of New York's Top Law Firms, <strong>FKSFPC</strong> is recognized by both the Bench and Bar as a leader in medical malpractice defense, general liability defense, Appellate practice, and professional licensure and disciplinary defense.<strong></strong>The firm offers a full range of legal services to insurance companies, hospitals, nursing homes, physicians, oral surgeons, dentists, podiatrists, municipalities, social service agencies, corporations and individual clients. </p><p>With offices in both Suffolk and Nassau Counties, and with attorneys residing throughout the New York Metropolitan area, the firm is engaged on a daily basis in litigation on Long Island, the five boroughs of the City of New York, Westchester County, and in both Federal and State Courts. </p><p>The trial attorneys in the firm are well recognized as amongst the most experienced and successful in New York. We regularly take verdicts in high exposure cases and have a better than 88% success rate. Additionally, we often achieve early resolution through procedural dismissal and favorable mediated settlements.</p><p>Our general liability department successfully handles a wide range of claims including: premises liability, Labor Law, property loss and subrogation, construction, products liability, assault and battery, sexual assaults, school liability, automobile liability, civil rights and insurance coverage disputes.</p><p>We have a team of specialists skilled in the field of Appellate practice. These attorneys regularly appear in the Appellate Courts of New York and the United States, and specialize in the briefing and argument of appeals in the fields of health care law, medical malpractice, general negligence, labor law and professional liability.</p><p>The partners in the firm have achieved various distinctions and honors, and frequently lecture at programs sponsored by State and local Bar Associations, Law Schools, Medical Schools and Dental Societies. In addition, as a service to our clients we have frequently presented Risk Management Seminars at many Hospitals, Insurance Companies, and Nursing Homes.</p><p>All of these elements have combined to make <strong>FKSFPC</strong> a leader in our field, and one of the premier defense firms in New York.</p>"
}