{
    "companyName": "Hoover Law PLLC - Barboursville, WV",
    "address1": "3570 US Route 60 East",
    "address2": "",
    "city": "Barboursville",
    "state": "WV",
    "zip": "25504",
    "website": "https://www.hooverlawwv.com",
    "phone": "304-666-3531",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4310846/pid_1/hoover_law_pllc.jpg",
    "moreBlocks": [
        {
            "previousLawFirmName": "<ul><li> Hoover Andrews, PLLC</li></ul>"
        },
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Wrongful Death|Family Law, Divorce And Mediation|DUI/DWI"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.hooverlawwv.com?refPageViewId=6c4c69309418224b\"> https://www.hooverlawwv.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.hooverlawwv.com/?refPageViewId=6c4c69309418224b\"> https://www.hooverlawwv.com/ </a><br>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Motor Vehicle Accidents|Wrongful Death|Family Law, Divorce And Mediation|DUI/DWI",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/4310846_1?refPageViewId=6c4c68b964b5222d",
    "description": "<p><strong>Barboursville Personal Injury Lawyer</strong></p><p>When you have suffered a serious injury, you need a lawyer who is serious about litigation. Hoover Law, PLLC is a litigation firm, and litigation is where we do our best work. We are comfortable in the courtroom and in all aspects of litigation. We excel at identifying the weaknesses in our opponent's case, and are adept at building strategies that exploit these weaknesses.</p><p>With our experience, we will always be prepared to take a case to trial. You can also be sure that we will never counsel you to accept an offer of settlement because we are hesitant to try a case. In every case, you will be able to rely on our judgment, which has been built on decades of legal experience and well over a thousand cases.</p><p>Our attorney, Jon D. Hoover, gained substantial litigation and courtroom experience representing the very insurance companies he now confronts on a daily basis on behalf of our clients. While we still represent insurance companies, our practice has expanded to include personal injury, complex civil litigation and family law. Our experience representing insurance companies is of substantial benefit to our clients in personal injury matters, as we have insight into how insurance companies operate and the strategies they often employ to defeat personal injury claims and lawsuits. A measure of our success is how many cases we receive from other lawyers. We are often asked to act as co-counsel with other attorneys through out West Virginia and Kentucky to oversee complex litigation at trial. Additionally, many firms refer clients and cases to us because of our litigation experience. </p><p>Our law firm is also adept at handling appellate litigation. Members of our firm are admitted before the United States Supreme Court, the Fourth U.S. Circuit Court of Appeals, the West Virginia Supreme Court of Appeals and the Kentucky Supreme Court.</p><p><strong>Contact an Experienced Civil Litigation Law Firm Today</strong></p><p>Call or e-mail Hoover Law, PLLC to discuss your legal issues. Call 304-521-1040 or toll free at 888-389-5924. In personal injury matters, we offer a free initial consultation and we do not charge a fee unless we recover money damages on your behalf. Our law firm is located near Huntington, and represents clients throughout West Virginia and Eastern Kentucky.</p>"
}