{
    "companyName": "Jack B. Swerling, Attorney at Law - Columbia, SC",
    "address1": "1720 Main Street",
    "address2": "Suite 301",
    "city": "Columbia",
    "state": "SC",
    "zip": "29201",
    "website": "http://www.jackswerling.com",
    "phone": "803-470-0579",
    "fax": "803-799-4059",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1812870/pid_1/jack_b_swerling_attorney_at_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Law|DUI/DWI|White Collar Crimes"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.jackswerling.com?refPageViewId=6c43be9e814709ba\" class=\"profile-website-body\" target=\"new\"> http://www.jackswerling.com </a>"
        },
        {
            "lawyersAtJackB.Swerling,AttorneyAtLawSelectedForASuperLawyers®List": "<ul><li> Swerling, Jack Bruce <a href=\"/profile/lawyer/jack-bruce-swerling/sc/columbia/Mjg5NzYwN18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Criminal Law|DUI/DWI|White Collar Crimes",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/jack-b-swerling-attorney-at-law/sc/columbia/MTgxMjg3MF8x/PP?refPageViewId=6c43be2215f30a22",
    "description": "<p>Whether they are under investigation or charged with a crime, people need a skilled defense attorney on their side. In Columbia, South Carolina, the law office of Jack B. Swerling Attorney at Law represents people in Columbia, Lexington and the surrounding Midlands area. Mr. Swerling has more than 40 years of experience and prepares every case with the intent to go to trial, if necessary. He handles matters involving federal and state laws, appeals, and investigations concerning law enforcement and grand juries.</p><p>In a free initial consultation, Mr. Swerling and his staff gather information about a client’s situation. To build the strongest defense possible, the law office uses the skills and knowledge of professional researchers, forensic experts, top investigators and consultants. Every detail of the client’s case is meticulously examined, and it is not uncommon for Mr. Swerling to spend weekends and evenings preparing for the courtroom.</p><p>Having handled many high-profile cases, Mr. Swerling has made several media appearances, including on \"Dateline,\" CNN, the \"Today\" show, Fox News, \"Nancy Grace,\" \"NBC Nightly News,\" A&amp;E and \"Nightline.\" His cases have been portrayed in true crime books and two were turned into TV movies. Through the years, he has represented people from all economic and social backgrounds, and he approaches each case as if it is the most important one he has.</p><p>The law office of Jack B. Swerling Attorney at Law has an established record of success, obtaining not guilty verdicts in murder trials and negotiating for lower sentences on behalf of clients. Mr. Swerling’s clients have included businesses, athletes, farmers, doctors, mechanics, government employees, factory workers and law enforcement officers. He holds the highest possible rating of AV Preeminent* from Martindale-Hubbell.</p><p>&nbsp;</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating™ fall into two categories – legal ability and general ethical standards.</p><p>&nbsp;</p>"
}