{
    "companyName": "The Law Office of Daryl G. Hawkins, LLC - Columbia, SC",
    "address1": "1331 Elmwood Avenue",
    "address2": "Ste 305",
    "city": "Columbia",
    "state": "SC",
    "zip": "29201",
    "website": "https://www.hawkinslawfirm.com",
    "phone": "803-594-8177",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4077653/pid_1/the_law_office_of_daryl_g_hawkins_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Car Accidents"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.hawkinslawfirm.com?refPageViewId=6c43be95e399032d\"> https://www.hawkinslawfirm.com </a>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Car Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/4077653_1?refPageViewId=6c43be2215f30a22",
    "description": "<p>Here at The Law Office of Daryl G. Hawkins, LLC, in Columbia, South Carolina, we are fully committed to protecting your rights and entitlements and to improving the likelihood that you will obtain the favorable outcome you expect and deserve for the serious, complex and pressing legal issues affecting your life and livelihood, your business and your future.</p><p>Serving clients throughout Richland County, the greater Columbia metro area and all across the state, our law firm's founder, attorney Daryl G. Hawkins, provides unmatched and invaluable counsel and support to those who have legal needs involving any of the following:</p><ul><li>Personal injury and wrongful death</li><li>Medical malpractice</li><li>Professional negligence</li><li>Premises and product liability</li><li>Motor vehicle accidents</li><li>Business torts and litigation</li><li>Environmental law</li></ul><p>Not only can we assist in helping you obtain the positive results you seek from your current legal disputes regarding your business, but we can also provide ongoing counseling and support to help you avoid potential legal problems in the future. If you have suffered an injury or lost a loved one due to someone else's negligence, you should know that many such cases have a statute of limitations, so you need to act quickly to file your claim in an attempt to recover damages.</p><p>The good news is that we are here for you, and we promise to do all we can to increase your chances of securing the full amount of compensation you need. That is why it is so important that you contact The Law Office of Daryl G. Hawkins, LLC, as soon as possible after your accident. To find out more, you can call our law office or visit our website to schedule an appointment for an initial consultation.</p>"
}