{
    "companyName": "Lindhorst & Dreidame Co., L.P.A. - Cincinnati, OH",
    "address1": "312 Walnut Street",
    "address2": "Suite 3100",
    "city": "Cincinnati",
    "state": "OH",
    "zip": "45202",
    "website": "https://www.lindhorstlaw.com",
    "phone": "513-223-3967",
    "fax": "513-421-0212",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2577763/pid_1/lindhorst_dreidame_co_lpa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Law|Business Law|Insurance Defense"
        },
        {
            "litigation": "<ul><li>80%</li></ul>"
        },
        {
            "previousLawFirmName": "<ul><li> Lindhorst &amp; Dreidame, January 1, 1983</li></ul>"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.lindhorstlaw.com?refPageViewId=6c3efc5e36da21d9\"> https://www.lindhorstlaw.com </a>"
        },
        {
            "lawyersAtLindhorst&DreidameCo.,L.P.A.SelectedForASuperLawyers®List": "<ul><li> Brockman, James F. <a href=\"/profile/lawyer/james-f-brockman/oh/cincinnati/MTE0OTcxMl8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Lyon, Michael F. <a href=\"/profile/lawyer/michael-f-lyon/oh/cincinnati/MTUzNjQwMF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> McPeek, Bradley D. <a href=\"/profile/lawyer/bradley-d-mcpeek/oh/cincinnati/MzM4MTg0OV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Law|Business Law|Insurance Defense",
    "litigation": "<ul><li>80%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/lindhorst--dreidame-co-lpa/oh/cincinnati/MjU3Nzc2M18x/PP?refPageViewId=6c3efbe286ba02dc",
    "description": "<p>There is a reason the law firm of Lindhorst &amp; Dreidame Co., L.P.A., located in Cincinnati, Ohio, is recognized as a premier firm in the region. For nearly 80 years, we have provided superior representation to individuals, businesses, doctors, insurance companies and others struggling with a variety of legal challenges. Our attorneys have never shied away from helping clients with difficult and important legal issues they face.</p><p><br>We possess the extensive knowledge, experience and resources necessary to help you. Our law firm has a reputation for zealously negotiating and advocating for our clients whether in court, mediation, or arbitration, or in a high stakes deal For these reasons, our law firm's attorneys have received AV Preeminent peer-review ratings* through Martindale Hubbell, which means that our colleagues believe we possess excellent legal ability and ethical standards.</p><p><br>Our attorneys have been representing business owners, insurance companies and individuals for generations. Our experience has also made us a top firm for tax and corporate law issues in a variety of transactions including corporate mergers and acquisitions. In addition, our well-rounded firm represents executors, administrators and beneficiaries in probate and trust-related matters. </p><p><br>Our success is directly proportionate to our steadfast commitment to our clients facing any number of legal issues affecting their lives and their businesses, whether it's insurance defense, personal injury claims, estate planning, business and commercial law, employment law or family law issues. In some cases, the two may converge, and having the opportunity to work with one law firm that can fulfill most of your legal needs could simplify matters and give you the best chance of achieving the best possible outcome for your unique circumstances.</p><p><br>To find out more about how you can begin receiving the aggressive advocacy and personalized attention you need and deserve, you can contact Lindhorst &amp; Dreidame Co., L.P.A., by phone or through our website to schedule a consultation. Considering these uncertain times, our law firm currently offers virtual consultations in an effort to keep you and your family safe.</p><p></p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review RatingTM fall into two categories - legal ability and general ethical standards.</p>"
}