{
    "companyName": "Law Offices of Bruce M. Bunch - Westlake Village, CA",
    "address1": "200 N. Westlake Blvd.",
    "address2": "Suite 204",
    "city": "Westlake Village",
    "state": "CA",
    "zip": "91362",
    "website": "http://www.lawofficesofbrucembunch.com",
    "phone": "855-456-1007",
    "fax": "818-707-8884",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1020161/pid_1/law_offices_of_bruce_m_bunch.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice"
        },
        {
            "litigation": "<ul><li>80%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.lawofficesofbrucembunch.com?refPageViewId=6b9f335775912260\" class=\"profile-website-body\" target=\"new\"> http://www.lawofficesofbrucembunch.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice",
    "litigation": "<ul><li>80%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-offices-of-bruce-m-bunch/ca/westlake-village/MTAyMDE2MV8x/PP?refPageViewId=6b9f332ee7152209",
    "description": "<p>Serving all of Los Angeles County, the Law Offices of Bruce M. Bunch, located in Westlake Village, California, has become one of Los Angeles' most trusted law firms for individuals and families suffering needlessly as the result of someone else's negligence or wrongdoing.</p><p>Bruce M. Bunch is a nationally ranked trial lawyer with more than 40 years of total legal experience. He, along with the other lawyers on his team provide unmatched advocacy and support to personal injury and medical malpractice victims who have consequently recovered millions of dollars in total compensation as a result of Mr. Bunch's tireless efforts and competency. A veteran of more than 100 jury trials and hundreds of cases, Mr. Bunch possesses the effective skills and extensive resources necessary to handle your personal injury or medical malpractice claim efficiently.</p><p>Honored for his success, Mr. Bunch has earned a membership in the Million Dollar Advocates Forum. He is also AV Preeminent peer-review rated* through Martindale-Hubbell and has received Top 100 Trial Lawyer rankings from Superlawyers and the National Trial Lawyers. Furthtermore, he has achieved the level of Diplomat with the American Board of Trial Advocates (its highest rank) as well as being an active member of the Consumer Attorneys Association of Los Angeles, so you know that you will receive the most relevant, up-to-date advice and counsel possible. Mr. Bunch has received many other top rankings and endorsements from his peers, and his law firm has received numerous testimonial and referrals from his satisfied clients.</p><p>For more information on how Mr. Bunch and his team at the Law Offices of Bruce M. Bunch can best assist you with your legal challenge, and how they can improve the likelihood you will obtain the maximum amount of compensation you deserve, please contact the firm to schedule a free evaluation of your claim. The firm also offers virtual consultations in these uncertain times so that you do not have to further risk your health and safety to speak with an attorney. To find out more, please visit http://www.lawofficesofbrucembunch.com.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}