{
    "companyName": "Polito & Harrington, LLC - Waterford, CT",
    "address1": "567 Vauxhall Street Ext",
    "address2": "Suite 230",
    "city": "Waterford",
    "state": "CT",
    "zip": "06385",
    "website": "https://www.politolaw.com/",
    "phone": "860-629-8245",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3394811/pid_1/polito_harrington_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.politolaw.com/?refPageViewId=6bb1b92ef0fb02e0\" class=\"profile-website-body\" target=\"new\"> https://www.politolaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.politolaw.com/blog/?refPageViewId=6bb1b92ef0fb02e0\"> https://www.politolaw.com/blog/ </a>"
        },
        {
            "lawyersAtPolito&Harrington,LLCSelectedForASuperLawyers®List": "<ul><li> Polito, Humbert J. <a href=\"/profile/lawyer/humbert-j-polito/ct/waterford/MTAwMTI2NV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/polito--harrington-llc/ct/waterford/MzM5NDgxMV8x/PP?refPageViewId=6bb1b90757f4370d",
    "description": "<p>Bert Polito is a Nationally Board Certified Trial Attorney whose law firm handles cases of personal injury and wrongful death for persons and families in Connecticut, Rhode Island and in the Connecticut Tribal Courts when lives have been impacted by the negligent choices of others. Our attorneys are experienced and qualified to obtain proper and fair compensation in cases of distracted driving, trucking accidents, motorcycle accidents and drunk driving accidents, nursing home malpractice and injuries, construction accidents, animal attacks and dog bites, slip-and-falls, spinal cord injuries/traumatic brain injuries, medical malpractice and workplace injuries.<br><br>The attorneys at our law office handle personal injury claims in Rhode Island in Westerly, Warwick, Providence, Newport, Newport County, Kent County, Washington County and Providence County. In Connecticut, we represent clients in New Haven, Waterford, Middletown, Stamford, Waterbury and Norwich, along with Middlesex, Windham and New London counties as well as in the Tribal Courts within Connecticut. We are happy to provide free initial consultations at our law office or at other convenient locations for the injured. Many lawyers from Connecticut and Rhode Island and beyond refer personal injury matters to Polito &amp; Harrington, LLC.<br><br>In 2018, U.S. News named Polito and Associates as a Tier One law firm in personal injury litigation within Connecticut. We are actively involved with the American Association for Justice, the Connecticut Trial Lawyers Association. Attorney Polito has also been selected as a member of the International Academy of Trial Lawyers. Attorney Polito holds the highest peer rating possible of AV Preeminent* from Martindale-Hubbell.<br><br>We have many successful cases that have resulted in millions of dollars of compensation for our injured clients. Those include a wrongful death settlement after an auto accident for $3.25 million, a settlement of $4 million for a wrongful death case involving a hospital-based infection and a malpractice settlement against an engineering and architecture firm for $6.4 million. Our personalized service and three decades of experience make us the firm prepared to handle the disruption stemming from an injury or death caused by negligence.<br><br>We are here to serve you and to help you and your family balance the harms and losses caused by the negligence and carelessness of others. <br><br>* AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating™ fall into two categories – legal ability and general ethical standards.<br></p>"
}