{
    "companyName": "Price Petho & Associates - Charlotte, NC",
    "address1": "1430 Elizabeth Ave",
    "address2": "",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28204",
    "website": "https://www.priceattorneys.com/",
    "phone": "704-859-8255",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2469833/pid_1/price_petho_associates.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Workers Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.priceattorneys.com/?refPageViewId=6c3a04b6a40709a2\" class=\"profile-website-body\" target=\"new\"> https://www.priceattorneys.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.priceattorneys.com/blog/?refPageViewId=6c3a04b6a40709a2\"> https://www.priceattorneys.com/blog/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/5223030_1\"> Price Petho &amp; Associates </a><span class=\"pp_card_street\"> 801 E Broad Ave </span><span class=\"pp_card_street\"> #17 </span><span class=\"pp_card_street\"><span>Rockingham</span>, <span>NC</span><span> 28379 </span></span><span class=\"pp_card_street\"> 704-859-8255 </span></p><p><a href=\"/profile/view/5223031_1\"> Price Petho &amp; Associates </a><span class=\"pp_card_street\"> 224 N Main St </span><span class=\"pp_card_street\"><span>Rutherfordton</span>, <span>NC</span><span> 28139 </span></span><span class=\"pp_card_street\"> 704-859-8255 </span></p>"
        }
    ],
    "practiceAreas": "Personal Injury|Workers Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/price-petho--associates/nc/charlotte/MjQ2OTgzM18x/PP?refPageViewId=6c3a048eb30c2286#otherlocations",
    "description": "<p>From their law office in Charlotte, North Carolina, the attorneys at Price Petho &amp; Associates strive to provide the highest level of counsel and support possible to clients throughout Mecklenburg and Rutherford counties and beyond who suffered an injury or lost a loved one as the result of someone else's negligence or wrongdoing.</p><p>For more than 40 years now, the firm has served individuals and families across their region who are suffering needlessly as the result of motor vehicle accidents, medical malpractice, premises liability, dog bites, work injuries and other preventable tragedies. Their lawyers possess more than 100 years of combined legal experience, and they have recovered millions of dollars in total compensation for their plaintiff clients.</p><p>Among some of their most notable successes, they secured a $9 million award for the victim of a motor vehicle accident as well as an award of more than $4.7 million for a medical malpractice victim. While Price Petho &amp; Associates cannot make any guarantees regarding your claim, they can promise to fight hard to protect your rights and entitlements and to improve the likelihood you will obtain the maximum amount of compensation you deserve.</p><p>Unlike other legal practices, you will work directly with a highly experienced attorney throughout all legal proceedings, and their lawyers have earned AV-Preeminent peer review ratings* from Martindale-Hubbell along with many other top rankings and endorsements from their peers for their outstanding professionalism and legal abilities.</p><p>Moreover, they have also received numerous testimonials and referrals from their satisfied clients who have praised them for the superior service and compassionate, personalized attention they delivered.</p><p>To begin the process, you can contact Price Petho &amp; Associates to schedule a free evaluation of your claim. Their law office also offers virtual consultations so that you do not have to further risk your health and safety to speak with them.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}