{
    "companyName": "Garson Johnson LLC - Hudson, OH",
    "address1": "7691 Herrick Park Drive",
    "address2": "",
    "city": "Hudson",
    "state": "OH",
    "zip": "44236",
    "website": "http://www.garson.com",
    "phone": "216-815-3670",
    "fax": "216-696-8558",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4781550/pid_1/garson_johnson_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Workers' Compensation|Business Litigation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.garson.com?refPageViewId=6c3ef94a526b3715\" class=\"profile-website-body\" target=\"new\"> http://www.garson.com </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.garson.com/blog?refPageViewId=6c3ef94a526b3715\"> http://www.garson.com/blog </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/4828442_1\"> Garson Johnson LLC </a><span class=\"pp_card_street\"> 26285 Broadway Avenue </span><span class=\"pp_card_street\"> Suite A3 </span><span class=\"pp_card_street\"><span>Oakwood Village</span>, <span>OH</span><span> 44146 </span></span><span class=\"pp_card_street\"> 216-815-3670 </span></p>"
        },
        {
            "lawyersAtGarsonJohnsonLLCSelectedForASuperLawyers®List": "<ul><li> DeRoche, James A. <a href=\"/profile/lawyer/james-a-deroche/oh/hudson/MTUyNjgwN18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Garson, Stuart I. <a href=\"/profile/lawyer/stuart-i-garson/oh/hudson/MTQ3NDIxNF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Szubski, Grace A. <a href=\"/profile/lawyer/grace-a-szubski/oh/hudson/MTM4NTMxN18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Taylor, Jaeson L. <a href=\"/profile/lawyer/jaeson-l-taylor/oh/hudson/Mzk2MzI2Nl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Workers' Compensation|Business Litigation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/garson-johnson-llc/oh/hudson/NDc4MTU1MF8x/PP?refPageViewId=6c3ef8e2a4ae09a6#otherlocations",
    "description": "<p><strong>WHO WE ARE at Garson Johnson LLC</strong></p><p>Clients, Not Cases.</p><p><em>We believe each client is worth of our respect and experienced legal representation that is focused on their individual need. At Garson Johnson, we return calls and respond to emails. We communicate with you about the status of your case. We genuinely care about you, your family and achieving a positive result for your legal situation. You are not just another case to us. You are our client, and we take that responsibility very seriously.</em></p><p>Loyalty.</p><p><em>\"Respect is earned. Honesty is appreciated. Trust is gained. Loyalty is returned.\" ~Unknown.<br>For over 35 years, Stuart Garson has been helping injured workers in Northeast Ohio. He has been a loyal servant to men and women that did not have a voice in a complex workers' comp system. His loyalty has been returned by earning countless referrals from former clients, friends, attorneys, and other professionals. Today, Garson Johnson continues to be loyal to their clients and every day work hard for their clients' rights and benefits.</em></p><p>Community.</p><p><em>\"One is a member of a country, a profession, a civilization, a religion. One is not just a man.\" ~</em><em>Antoine de Saint-Exupéry<br></em><em>The Garson Johnson team extends beyond the walls of 1610 Midland Building. We are fathers, daughters, sons, nephews, aunts, and we are leaders and servants in our communities. Our service is far reaching. We are members of synagogues, churches, political parties, non-profit organizations and coaches of youth sports teams. We serve on boards and committees. Our desire to help our clients is rooted in a deep love and appreciation for our community.</em></p><p>Experience.</p><p><em>\"Experience is one thing you can't get for nothing.\" ~</em><em>Oscar Wilde<br></em><em>Our experience is gained by decades of service to our clients and community. Organizations have recognized our experience with numerous honors and awards. Just speak to our team and attorneys, and you will quickly realize the depth and breadth of their knowledge and experience in their specific practice area.</em></p><p><strong>WHAT WE DO at Garson Johnson LLC</strong></p><p>At the law firm of Garson Johnson LLC in Cleveland, we handle the most complicated workers compensation cases as well as car accidents, nursing home negligence, medical malpractice and Social Security Disability claims. If you have suffered an injury, or if you have a loved one who was killed in an accident, it is important to speak with an experienced attorney as soon as possible about your options for recovery.</p><p>The Cleveland business litigation attorneys have successfully resolved business litigation lawsuits in state and Federal courts throughout the state of Ohio. In addition, we handle matters brought in private arbitration forums, including the American Arbitration Association and the National Association of Securities Dealers Dispute Resolution.</p><p>Our representation includes practice areas such as:</p><p><strong>Workers' Compensation and On-the-Job Injuries</strong></p><p>If you have been hurt on the job, workers' compensation benefits may be available to help you pay for medical bills, lost wages and other expenses. In some cases, however, third parties may also be liable for your injuries, and you may have the right to pursue compensation from those parties. We will review your accident and help you understand the best options for your situation.</p><p>Injuries &amp; Industries<br>Third Party Liability<br>Workers Comp Benefits<br>Help for Injured Workers</p><p><strong>Social Security Disability and Supplemental Security Income</strong></p><p>If you are applying for social security disability, you are probably facing new challenges in life. The SSD or Supplemental Security Income claim process can be complicated and confusing. If your SSD benefits were denied, we can help you with:</p><p>Understanding the requirements for Social Security Disability<br>Filing for Social Security<br>Dealing with Social Security denials<br>Proving you have an SSD eligible condition</p><p><strong>Ohio Business Litigation and Contract Disputes</strong></p><p>Whether you are an entrepreneur, small business owner or an individual who has been victimized by the bad advice of a financial advisor, we are dedicated to representing your interests with a high level of talent and business litigation expertise and know how.</p><p>Business Litigation<br>Contract Disputes<br>Partnership &amp; Shareholder Disputes<br>Class Action<br>Insurance Disputes<br>Whistleblower | Qui Tam<br>Stock Market Loss</p><p><strong>Personal Injury Representation in Ohio</strong></p><p>We represent people who have been injured in car accidents, pedestrian accidents, trucking accidents, RTA accidents, motorcycle accidents and other motor vehicle accidents. We can answer your questions regarding your insurance, what do after an accident and what kinds of compensation you may be able to receive for your expenses.</p><p>When a doctor, nurse or other medical professional is negligent and that negligence results in serious harm to you or someone you love, the law allows you to seek compensation through a medical malpractice claim. There are many types of medical malpractice such as surgical errors, birth injuries and failure or delayed diagnosis. Our firm has successfully handled medical malpractice cases involving adults and children in Ohio.</p><p>We also handle personal injury claims involving negligence in nursing homes, assisted living centers, Long Term Acute Care (LTAC) centers and other elder care facilities.</p><p>Contact our Ohio firm to schedule an appointment. Call us at 216-696-9330. Get the help you need from an attorney who believe in you.</p><p><strong>Serving Ohio</strong></p><p>The law firm of Garson Johnson LLC, is located in Cleveland, Ohio, and provides representation for clients in the communities of Lorain, Akron, Canton, Painesville, Cleveland, Youngstown, Parma, Beachwood, Westlake, Euclid, Mentor, Strongsville, Warren, Kent, Ashtabula County, Cuyahoga County, Geauga County, Hamilton County, Lake County, Lorain County, Medina County, Mahoning County, Stark County, and Summit County.</p>"
}