{
    "companyName": "Henson & Talley LLP - Greensboro, NC",
    "address1": "114 N. Elm St.",
    "address2": "Suite 600",
    "city": "Greensboro",
    "state": "NC",
    "zip": "27401",
    "website": "https://www.hensonlawyers.com",
    "phone": "336-944-6513",
    "fax": "336-273-2585",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1928549/pid_1/henson_talley_llp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury -- Defense|Personal Injury -- Plaintiff|Motor Vehicle Accidents -- Plaintiff|Medical Malpractice|Workers' Compensation Law|Insurance Defense|Business Litigation|Employment Law - Employer"
        },
        {
            "litigation": "<ul><li>95%</li></ul>"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.hensonlawyers.com?refPageViewId=6c3a0982f6dd097d\"> https://www.hensonlawyers.com </a><a rel=\"sponsored\" href=\"http://www.hensonlawyers.com?refPageViewId=6c3a0982f6dd097d\" class=\"profile-website-body\" target=\"new\"> http://www.hensonlawyers.com </a>"
        },
        {
            "lawyersAtHenson&TalleyLLPSelectedForASuperLawyers®List": "<ul><li> Henson, Perry C. <a href=\"/profile/lawyer/perry-c-henson/nc/greensboro/MTI3ODUzOF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury -- Defense|Personal Injury -- Plaintiff|Motor Vehicle Accidents -- Plaintiff|Medical Malpractice|Workers' Compensation Law|Insurance Defense|Business Litigation|Employment Law - Employer",
    "litigation": "<ul><li>95%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/henson--talley-llp/nc/greensboro/MTkyODU0OV8x/PP?refPageViewId=6c3a08b9544f09a2",
    "description": "<p>At the law firm of Henson &amp; Talley in Greensboro, North Carolina, we offer comprehensive legal services and high-quality representation in the following practice areas to serve the needs of individuals and businesses throughout the Triad Region and the rest of North Carolina:</p><ul class=\"unIndentedList\"><li><strong>Business and corporate law and commercial litigation</strong>: Whether you are just starting your business or need solid counsel regarding a commercial dispute, you can rely on our law firm to help you find a solution.</li><li><strong>Insurance defense</strong>: Insurance providers, trucking companies and self-insured company owners can turn to us for help protecting their rights and interests in the face of all types of liability claims and litigation.</li><li><strong>Personal injury and wrongful death</strong>: If you suffered an injury or lost a loved one as the result of someone else's negligence or wrongdoing, our attorneys will advocate strongly on your behalf to help you secure the maximum amount of compensation possible.</li><li><strong>Workers' compensation</strong>: Hurt on the job? You need someone on your side with the skills and resources necessary to help you file for benefits and appeal your claim if it's denied so that you can support yourself and your family.</li></ul><p>Backed by more than 30 years of legal experience and utilizing a vast network of resources, the attorneys at our law firm can handle the demands of your case regardless of how complex or challenging. Although we are a small firm, we offer the same exceptional legal services found at larger practices, but our small size means that we can devote more of our time to you and your situation.</p><p>Recognized for our impeccable professionalism and dedication to those we serve, our law firm is rated AV Preeminent* by Martindale-Hubbell, and we receive numerous referrals and positive reviews from satisfied clients.</p><p>To find out more about how Henson &amp; Talley can best serve your needs, you can contact our law office or visit our website to schedule a free initial consultation.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}