{
    "companyName": "The Lawing Firm, P.A. - Greensboro, NC",
    "address1": "3859 Battleground Avenue",
    "address2": "Suite 210",
    "city": "Greensboro",
    "state": "NC",
    "zip": "27410",
    "website": "",
    "phone": "336-288-0808",
    "fax": "336-288-0858",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3395668/pid_1/the_lawing_firm_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice, Plaintiff 100%"
        },
        {
            "litigation": "<ul><li>100%</li></ul>"
        },
        {
            "languages": "English"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> 8:30 AM - 5:00 PM <br></p>"
        },
        {
            "lawyersAtTheLawingFirm,P.A.SelectedForASuperLawyers®List": "<ul><li> Lawing, Sally A. <a href=\"/profile/lawyer/sally-a-lawing/nc/greensboro/MjU0NjUzN18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice, Plaintiff 100%",
    "litigation": "<ul><li>100%</li></ul>",
    "languages": "English",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> 8:30 AM - 5:00 PM <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-lawing-firm-pa/nc/greensboro/MzM5NTY2OF8x/PP?refPageViewId=6c3a08b9544f09a2",
    "description": "<p><strong>The Lawing Firm, P.A.: North Carolina Medical Malpractice Attorney</strong></p><p>Since 1982, lawyer Sally Lawing has handled medical malpractice suits throughout North Carolina. In 1999, she shifted her emphasis from defending hospitals and doctors to representing patients and their families. Although she represents clients in all areas of malpractice and negligence, many of her cases involve obstetrical and birth injuries, misdiagnosis/delayed diagnosis, radiology/mammography errors, unnecessary surgery, postoperative complications, prescribing or pharmacy errors and wrongful death. She formed her own medical malpractice plaintiff practice in 2004.</p><p>Sally is a graduate of the University of North Carolina at Chapel Hill, where she also received her law degree with honors in 1982. She was admitted to the North Carolina State Bar the same year. In addition to the state bar association, she is an active member of the North Carolina Advocates for Justice and the Greensboro Bar Association. She is admitted to U.S. Federal Court, Middle District of North Carolina. An active and highly experienced trial lawyer, she was the first North Carolina woman elected to the American College of Trial Lawyers. She was also elected to the American Board of Trial Advocates in 1999. She has been selected to Best Lawyers in America continually since 1995 and has been selected to the Super Lawyers list from 2006-2014. Both Ms. Lawing and her firm are rated AV Preeminent* by Martindale-Hubbell.</p><p>When you hire The Lawing Firm, P.A., to handle your plaintiff medical malpractice case, your matter will be handled personally by Sally Lawing. Office hours are 8:30 a.m.-5 p.m., Monday through Friday. Evening and weekend appointments are available. The initial consultation is free of charge.</p><p>You can find The Lawing Firm office at 3859 Battleground Ave. (U.S. Highway 220) in Greensboro, North Carolina. Call 336-288-0808 for an appointment.</p><p><sup>*AV Preeminent and BV Distinguished are certification marks of Reed Elsevier Properties Inc., used in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell is the facilitator of a peer review rating process. Ratings reflect the confidential opinions of members of the Bar and the judiciary. Martindale-Hubbell ratings fall into two categories - legal ability and general ethical standards.</sup></p>"
}