{
    "companyName": "Beausay & Nichols Law Firm - Columbus, OH",
    "address1": "7650 Rivers Edge Drive",
    "address2": "Suite 150",
    "city": "Columbus",
    "state": "OH",
    "zip": "43235",
    "website": "https://www.614lawfirm.com",
    "phone": "614-LAW-FIRM",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5084367/pid_1/beausay_nichols_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.614lawfirm.com?refPageViewId=6c3f01dc239ed4f5\"> https://www.614lawfirm.com </a>"
        },
        {
            "lawyersAtBeausay&NicholsLawFirmSelectedForASuperLawyers速List": "<ul><li> Beausay, Jacob J. <a href=\"/profile/lawyer/jacob-j-beausay/oh/columbus/NDI4MzE0Ml8x/PP#feedback\">On a Super Lawyers速 List</a></li><li> Beausay, T. Jeffrey <a href=\"/profile/lawyer/t-jeffrey-beausay/oh/columbus/MzI1NDgyOF8x/PP#feedback\">On a Super Lawyers速 List</a></li><li> Nichols, Sara C. <a href=\"/profile/lawyer/sara-c-nichols/oh/columbus/NDkzMDAyOF8x/PP#feedback\">On a Super Lawyers速 List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/beausay--nichols-law-firm/oh/columbus/NTA4NDM2N18x/PP?refPageViewId=6c3f0163646beefe",
    "description": "<p id=\"orgName\">If you live in Ohio, and you have suffered a catastrophic injury as the result of someone else's negligence, you can turn to the Beausay &amp; Nichols Law Firm for unmatched legal advocacy to help you obtain the justice you deserve.</p><p align=\"left\">Attorneys Jeff Beausay, Jake Beausay, and Sara Nichols and paralegal Melanie Beausay comprise the Beausay &amp; Nichols Law Firm . As a family-run practice (we're all related!), we promise to treat you like a member of our family. This means we will treat you with the compassion and respect you deserve while fighting aggressively to obtain the most favorable outcome for your case. We understand the stress and anxiety you are likely experiencing, and we will remain with you until the end of this challenging time.</p><p align=\"left\">We are diverse in our backgrounds and experience levels, and this diversity serves our clients well. Jeff has been practicing since 1987 and now devotes all of his time to representing injured people and their families. He has handled catastrophic and complex medical malpractice cases and has recovered millions of dollars in settlements for his clients.</p><p align=\"left\">Jake similarly has handled many complicated personal injury and medical malpractice cases. Like Jeff, he has successfully obtained many million and multi-million dollar settlements.</p><p align=\"left\">Sara has been in practice since 2014 and been involved in several substantial cases (personal injury and medical negligence), often working in tandem with Jeff. Sara develops solid and meaningful relationships with our clients, which is a major plus when difficult decisions need to be made.</p><p align=\"left\">At the Beausay &amp; Nichols Law Firm, we work together to create an approach that is as unique as each of our clients. Our firm is prepared to work hard for you and your family when you are left in the wake of a horrific motor vehicle accident, medical malpractice incident, or other preventable tragedy.</p><p align=\"left\">You do not have to suffer alone. Contact the Beausay &amp; Nichols Law Firm as soon as possible and take advantage of our law firm's free initial consultation. We work on a contingency basis, so we do not require a fee from you unless we obtain a settlement for you. You have nothing to lose by giving us a call.</p>"
}