{
    "companyName": "Jones Law Firm, LLC - Albuquerque, NM",
    "address1": "1011 Lomas Blvd. NW",
    "address2": "Suite 202",
    "city": "Albuquerque",
    "state": "NM",
    "zip": "87102",
    "website": "https://www.joneslawabq.com",
    "phone": "505-358-7228",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5099161/pid_1/jones_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Law|Personal Injury|Civil Rights|Drug Violations|DWI"
        },
        {
            "languages": "Spanish"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.joneslawabq.com?refPageViewId=6c22394a739a67ea\"> https://www.joneslawabq.com </a>"
        }
    ],
    "practiceAreas": "Criminal Law|Personal Injury|Civil Rights|Drug Violations|DWI",
    "litigation": "",
    "languages": "Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5099161_1?refPageViewId=6c2238dce61b2260",
    "description": "<p>I am Attorney Alexandra W. Jones, and I founded Jones Law Firm, LLC, in Albuquerque, New Mexico, to protect the rights of the accused. With a strong background in criminal law, I am the powerful advocate you need when you face any type of misdemeanor or felony charge, ranging from DUI/DWI to drug violations to sex offenses. I have the experience, resources and confidence to represent you at all stages of the criminal justice process, from pretrial motions to trial, and from post-conviction matters to appeals. If, following the free initial consultation, we agree to work together, you can trust me to help you navigate the legal system and fight for the best possible outcome on your behalf.</p><p>Though advocating on behalf of the accused is a large part of what I do at my law firm, my overall mission is to empower victims of injustice and wrongdoing. The legal system often favors the rich and powerful, making it difficult for individuals like you to stand up for yourself or what is right. When you have me in your corner, though, no criminal, civil rights or personal injury matter seems as foreboding as if you were to handle it on your own. Whether this is your first time dealing with a legal matter or a subsequent issue, you can trust me to handle your case with the utmost care and integrity.</p><p>Born and raised in Albuquerque, I have strong ties to the community I serve. I am proud to serve the legal needs of local and nearby residents through Jones Law Firm, LLC, and to play my part in making their lives better. In an effort to make my legal services more accessible to all, I happily accept credit cards.</p><p></p>"
}