{
    "companyName": "Law Offices of Erika E. Anderson, LLC - Albuquerque, NM",
    "address1": "105 Bryn Mawr Dr. SE",
    "address2": "",
    "city": "Albuquerque",
    "state": "NM",
    "zip": "87106",
    "website": "https://eandersonlaw.com/",
    "phone": "505-303-0868",
    "fax": "505-243-3534",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5153049/pid_1/law_offices_of_erika_e_anderson_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Estate Planning"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://eandersonlaw.com/?refPageViewId=6c2238fd04a921f4\" class=\"profile-website-body\" target=\"new\"> https://eandersonlaw.com/ </a>"
        },
        {
            "lawyersAtLawOfficesOfErikaE.Anderson,LLCSelectedForASuperLawyers®List": "<ul><li> Anderson, Erika E. <a href=\"/profile/lawyer/erika-e-anderson/nm/albuquerque/NTE1MzIzNF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Estate Planning",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-offices-of-erika-e-anderson-llc/nm/albuquerque/NTE1MzA0OV8x/PP?refPageViewId=6c2238dce61b2260",
    "description": "<p>Providing focused personal injury counsel, The Law Offices of Erika E. Anderson, LLC, in Albuquerque, New Mexico, helps those injured through no fault of their own to recover the maximum compensation for their associated losses. We handle cases involving car accidents and other such incidents resulting in serious injuries or death, as well as medical malpractice claims. Our attorney has received the highest possible rating of AV Preeminent* from Martindale-Hubbell, and she has an Avvo \"Superb\" rating.</p><p>Whether in negotiations with insurance companies or arguing in the courtroom, we aggressively pursue the best possible outcomes and results on our clients' behalf. Our law offices' attorney brings with her 18 years of experience helping those injured as a result of the negligence or recklessness of others to achieve financial justice.</p><p>In addition to our clients' physical pain and suffering after an accident-related injury, we understand that they may be concerned about mounting medical bills, a loss of wages and meeting their financial obligations. Treating each of our clients with the respect and compassion they deserve, we take the time to talk to them about their cases, as well as their injuries and how their lives have been affected. Offering customized guidance, our attorney tirelessly advocates on behalf of our clients' best interests.</p><p>At The Law Offices of Erika E. Anderson, LLC, our attorney also provides business, employment and civil rights representation. We excel at aiding clients with starting up new companies and operating long-established businesses, dealing with employment issues and seeing violations of their constitutional rights made right. We also provide estate planning services, drafting wills and establishing trusts to provide for their needs as they age and pass on their assets to their heirs after their deaths.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}