{
    "companyName": "Walsh Law Firm - Cortland, NY",
    "address1": "45 Church St.",
    "address2": "Ste. 1",
    "city": "Cortland",
    "state": "NY",
    "zip": "13045",
    "website": "http://www.ronwalshlaw.net",
    "phone": "607-218-5933",
    "fax": "607-758-8515",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5038182/pid_1/walsh_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal|Estate Planning|Traffic Violations"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.ronwalshlaw.net?refPageViewId=6b7011a4e6c767e1\" class=\"profile-website-body\" target=\"new\"> http://www.ronwalshlaw.net </a>"
        }
    ],
    "practiceAreas": "Criminal|Estate Planning|Traffic Violations",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/walsh-law-firm/ny/cortland/NTAzODE4Ml8x/PP?refPageViewId=6b7010ee72a7098e",
    "description": "<p>At The Walsh Law Firm in Cortland, New York, we understand that any legal matter, ranging from facing a criminal charge to developing an estate plan, puts someone’s future in question. Our attorneys handle a range of civil and criminal issues, including the following:</p><p>&nbsp;</p><ul><li>Traffic violations and DUI</li><li>Family law and custody disputes</li><li>Business law, planning and zoning</li><li>Municipal law</li></ul><p>The staff at our practice combine experience and knowledge to present our clients with the most comprehensive representation possible. We also accommodate those we serve through conveniences such as free initial consultations and accepting credit cards.</p><p>As former prosecutors and county attorneys, the lawyers at our law firm have a deep-rooted understanding of both the criminal justice system and the litigation process. This is imperative for our clients, who need a legal team they can trust to navigate any situation that may arise. We believe in working with our clients, not just for them, to find the appropriate solution at every turn.</p><p>Our founder, Ron Walsh, has earned the highest peer rating possible of AV Preeminent* from Martindale-Hubbell, and he holds an Avvo “Excellent” rating. These honors are reflections of the outstanding service and results we consistently show our clients. The Walsh Law Firm counsels people in Broome and throughout Onondaga County.</p><p class=\"smallText\">* AV Preeminent and BV Distinguished are certification marks of Reed Elsevier Properties Inc., used in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell is the facilitator of a peer review rating process. Ratings reflect the confidential opinions of members of the bar and the judiciary. Martindale-Hubbell ratings fall into two categories: legal ability and general ethical standards.</p><p>&nbsp;</p><p>&nbsp;</p>"
}