{
    "companyName": "Thomas J. Jerla, Jr. - Plantation, FL",
    "address1": "8151 Peters Rd.",
    "address2": "Fl. 4",
    "city": "Plantation",
    "state": "FL",
    "zip": "33324",
    "website": "https://www.forthepeople.com/attorneys/thomas-jerla-jr/",
    "phone": "786-785-7631",
    "fax": "352-556-4839",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5188054/pid_1/thomas_j_jerla_jr.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.forthepeople.com/attorneys/thomas-jerla-jr/?refPageViewId=6b3469c1c6955724\" class=\"profile-website-body\" target=\"new\"> https://www.forthepeople.com/attorneys/thomas-jerla-jr/ </a>"
        },
        {
            "lawyersAtThomasJ.Jerla,Jr.SelectedForASuperLawyers®List": "<ul><li> Jerla, Thomas J. <a href=\"/profile/lawyer/thomas-j-jerla/fl/plantation/Mzg1ODMyMl8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/thomas-j-jerla-jr/fl/plantation/NTE4ODA1NF8x/PP?refPageViewId=6b34693eb03f02d6",
    "description": "<p>From his law office in Boca Raton, Florida, attorney Thomas J. Jerla Jr., provides invaluable advocacy and support to clients throughout Broward County and the greater Miami-Fort Lauderdale-West Palm Beach region who have suffered injuries or lost loved ones due to the negligent, careless or unlawful actions of others.</p><p>Along with handling all types of personal injury and wrongful death claims, Mr. Jerla also delivers unmatched criminal defense counsel to those facing serious felony and misdemeanor charges on a select basis. He has more than 17 years of total legal experience to help you make the best-informed decisions and to increase your chances of obtaining the justice you deserve.</p><p>Nationally recognized as one of the leading trial advocates in the country, Mr. Jerla has led a successful career as a former insurance defense attorney. He has a wealth of insight into the industry and the tactics that insurance companies use to reduce or deny claims. This means he can devise the most effective strategy to help improve the likelihood that you will obtain the maximum amount of compensation you need.</p><p>Honored for his outstanding professionalism and service, Mr. Jerla is AV Preeminent peer-review rated,* the highest rating, through Martindale-Hubbell. He has received many other top rankings and endorsements from his peers as well as numerous testimonials and referrals from his satisfied clients. To find out more about how Thomas J. Jerla Jr. can best assist you with securing a brighter, safer and more financially stable future for yourself and your loved ones, you can reach him at his law office to receive a free initial consultation.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer-review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}