{
    "companyName": "Cipriani & Thomas Law Offices, L.C. - Wellsburg, WV",
    "address1": "634 Charles St.",
    "address2": "",
    "city": "Wellsburg",
    "state": "WV",
    "zip": "26070",
    "website": "https://www.ciplawoffices.com",
    "phone": "304-737-1610",
    "fax": "304-737-1614",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1311884/pid_1/cipriani_thomas_law_offices_lc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Elder Law"
        },
        {
            "litigation": "<ul><li>50%</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.ciplawoffices.com?refPageViewId=6c4c6936f35d02e0\"> https://www.ciplawoffices.com </a>"
        }
    ],
    "practiceAreas": "Elder Law",
    "litigation": "<ul><li>50%</li></ul>",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/cipriani--thomas-law-offices-lc/wv/wellsburg/MTMxMTg4NF8x/PP?refPageViewId=6c4c68b964b5222d",
    "description": "<p>For more than 30 years, attorney William Cipriani at Cipriani &amp; Thomas in Wellsburg, West Virginia, has helped individuals and businesses confront a wide range of major legal issues. Our law firm now includes lawyer Andrew J. Thomas, a recipient of the prestigious CALI award for the study of elder law, and we offer skilled, personal advice on all aspects of those legal issues that affect older people in our community.</p><p>We advise on:</p><ul><li>All forms of estate planning, including wills, trusts, living wills and powers of attorney</li><li>Medicaid and long-term care planning</li><li>Protection of assets from nursing home care costs</li><li>Estate administration</li><li>Nursing home or elder abuse and neglect</li><li>Guardianship for seniors</li></ul><p>When we grow old, we all have a unique and evolving set of circumstances. At Cipriani &amp; Thomas, our responsibility is to ensure your affairs are in order. Whatever the future holds, our priority is to make sure your dignity remains intact.</p><p>Don’t leave things until it is too late. By getting the right elder law advice early, you and your family avoid the expense and complications of dealing with care issues and estate planning matters at a time when you might be ill or unable to take crucial decisions yourself. With sensitive and confidential guidance, we will explain your options clearly and ensure that you fully understand the legal implications of the choices you make.</p><p>If you or a loved one needs advice on any aspect of elder law, get the peace of mind you deserve. Contact Cipriani &amp; Thomas for a free consultation. We are located one block from the Brooke County Courthouse.</p>"
}