{
    "companyName": "James Law, PC - Springfield, SD",
    "address1": "807 8th Street",
    "address2": "Suite 3",
    "city": "Springfield",
    "state": "SD",
    "zip": "57062",
    "website": "http://www.yankton.lawyer",
    "phone": "605-665-0594",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5215232/pid_1/james_law_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.yankton.lawyer?refPageViewId=6c43d120c66567c8\" class=\"profile-website-body\" target=\"new\"> http://www.yankton.lawyer </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/james-law-pc/sd/springfield/NTIxNTIzMl8x/PP?refPageViewId=6c43d10934dc0a32",
    "description": " As a personal injury lawyer who runs an established law firm in Springfield, South Dakota, I see corporations trying to take advantage of people every day. It is especially disheartening when people need to go up against health care facilities and professionals they once trusted with their lives or the lives of their loved ones.<p>There are many challenges to face when seeking compensation for medical malpractice, premises liability and traffic accidents. My goal is to help you build a strong case so that no court could review it and disagree with your personal injury claim. Not all cases lead to the ideal ending, but my team at James Law PC fights hard to ensure you get fair compensation.</p><p>My law firm starts by offering a free consultation. I then review all the details and confirm whether it is worth pursuing. This may depend on the strength of the evidence and how I believe a South Dakota court may decide the case, based on my years of experience. If I believe you have a strong case, the hard work begins.</p><p>From negotiations to court trials, my law firm stands with you through some of the toughest times you will ever face. We remain committed to seeing you through to better times and fight hard to serve as a solution to the problem you face.</p>"
}