{
    "companyName": "Garrison Law Firm, LLC - Indianapolis, IN",
    "address1": "9795 Crosspoint Blvd.",
    "address2": "Suite 101",
    "city": "Indianapolis",
    "state": "IN",
    "zip": "46256",
    "website": "https://www.garrisonlegal.com/",
    "phone": "317-516-6907",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2390172/pid_1/garrison_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Car Accident Injuries|Truck Accident Injuries|Wrongful Death|Animal Bites|Product Liability|Brain Injury|Birth Injury|Medical Malpractice"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.garrisonlegal.com/?refPageViewId=6bd8aea1a7a1370b\" class=\"profile-website-body\" target=\"new\"> https://www.garrisonlegal.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.garrisonlegal.com/injury-blog/?refPageViewId=6bd8aea1a7a1370b\"> https://www.garrisonlegal.com/injury-blog/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Car Accident Injuries|Truck Accident Injuries|Wrongful Death|Animal Bites|Product Liability|Brain Injury|Birth Injury|Medical Malpractice",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/garrison-law-firm-llc/in/indianapolis/MjM5MDE3Ml8x/PP?refPageViewId=6bd8ae6df2db09de",
    "description": "<p>If you live anywhere in Indiana and you suffered an injury or have lost a loved one resulting from an accident caused by someone else's negligence or wrongdoing, you can turn to the legal professionals at the Garrison Law Firm for the advocacy and support you need. Through no fault of your own you have not only been presented with physical injuries but also financial and emotional injuries. Most people do not fully understand their rights and need to be guided through the process to ensure they are fairly treated.</p><p>Our firm's dedicated attorneys possess more than 100 combined years of experience handling all types of personal injury and wrongful death claims, and we have helped recover millions of dollars in settlements and awards for our clients. We promise to work closely with you and do all we can to protect your rights and entitlements to increase your chances of obtaining the maximum amount of compensation for your injuries.</p><p>Recognized for our success as well as our impeccable professionalism and integrity, we have earned AV Preeminent peer review ratings* from Martindale-Hubbell, and numerous other awards and honors. Our law firm has received many positive reviews and referrals from our satisfied clients. Compassionate and responsive, we will return your calls and emails promptly to address your concerns as they arise. Let us handle the financial claim process so that you can focus on your recovery. And you never pay a fee until there is a recovery for you.</p><p>Do not risk a bad outcome but contact Garrison Law Firm and take advantage of our free initial consultation and contingent fee schedule so you can begin the process of facing your legal challenge head-on and securing a brighter future for yourself and your loved ones.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}