{
    "companyName": "The Magi Group, LLC - Indianapolis, IN",
    "address1": "9165 Otis Avenue",
    "address2": "",
    "city": "Indianapolis",
    "state": "IN",
    "zip": "46216",
    "website": "https://www.themagigroupresolution.com/",
    "phone": "317-779-0802",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5233067/pid_1/the_magi_group_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Mediation|Business Consultation|Civil Law"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.themagigroupresolution.com/?refPageViewId=6bd8ae9672380335\" class=\"profile-website-body\" target=\"new\"> https://www.themagigroupresolution.com/ </a>"
        }
    ],
    "practiceAreas": "Mediation|Business Consultation|Civil Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-magi-group-llc/in/indianapolis/NTIzMzA2N18x/PP?refPageViewId=6bd8ae6df2db09de",
    "description": "<p>From our law office in Indianapolis, Indiana, the attorneys at The Magi Group, LLC, provide unmatched mediation and other legal services to help you resolve your conflicts and reach favorable agreements regarding the serious legal disputes you have affecting your life and livelihood, your business, your family and your future.</p><p class=\"MsoNormal\"><span>Established by top-ranked lawyer Thakena Hogue, our law firm has become the trusted source for quality, effective legal counsel and dedicated support to a diverse range of clients across our region dealing with complex legal issues involving trucking, corporate, health care and social services; medical malpractice and personal injury; family law and divorce; employment law; business disputes; and more.</span></p><p class=\"MsoNormal\"><span>Regardless of the legal issue you need to address, you can rely on us to sit with you and fully explain your options to help you make the best-informed decisions. Well-versed in mediation and other alternative dispute resolution techniques, we are fully committed to helping you achieve your goals and the favorable outcomes you seek as efficiently and cost-effectively as possible. During our time in practice, we have achieved a long record of obtaining successful results for our clients without the need for expensive and stressful litigation.</span></p><p class=\"MsoNormal\"><span>To find out more, you can contact The Magi Group, LLC, to schedule a free initial consultation. Our law office also currently offers virtual consultations in these uncertain times to help keep you and your loved ones safe and healthy.</span></p>"
}