{
    "companyName": "Sommer and Bear - Encino, CA",
    "address1": "15840 Ventura Blvd.",
    "address2": "Ste. 201",
    "city": "Encino",
    "state": "CA",
    "zip": "91436",
    "website": "https://www.sommerandbear.com",
    "phone": "818-922-8987",
    "fax": "817-550-6323",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2595939/pid_1/sommer_and_bear.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.sommerandbear.com?refPageViewId=6b9f336fe7c70329\"> https://www.sommerandbear.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/sommer-and-bear/ca/encino/MjU5NTkzOV8x/PP?refPageViewId=6b9f332ee7152209",
    "description": "<p>Finding yourself injured in an accident or facing criminal charges can be frightening. The law firm of Sommer and Bear helps people throughout California, including Encino and Beverly Hills, the San Fernando Valley and Los Angeles County. We know that your future can be greatly affected by a legal matter, and you may have many unanswered questions. Our attorneys will sit down with you in a free initial consultation to give you answers.</p><p>An accident can leave you with thousands of dollars in medical fees; the inability to work or return to work; and physical, mental and emotional pain. You may be receiving calls from the other party’s insurance company with settlement offers. However, a settlement may not be in your best interest. Insurers often try to pay less than what you are legally entitled to, or they may deny your claim altogether. Our attorneys will explain to you how compensation laws work and show you the different types of compensation that may apply to your situation. This can give you the power to make better-informed decisions as to what is best for you and your family. We handle motor vehicle, motorcycle, trucking, construction, pedestrian accidents, premises liability, slip-and-falls, product liability, dog bites and wrongful death.</p><p>Serving previously as public defenders, our attorneys have seen the lack of empathy for those accused of breaking the law. We also know that often, other factors played a role and that sometimes things are not as they appear. The law firm of Sommer and Bear will conduct its own investigation into your criminal, felony, drug, misdemeanor or DUI/DWI matter and help you understand what your rights are.&nbsp;</p><p>We have been practicing law since 1972, and we will use our knowledge and experience to give you the tools you need to proceed confidently with your case.</p><p>&nbsp;</p><p>&nbsp;</p>"
}