{
    "companyName": "Cosner Youngelson Counselors at Law - East Brunswick, NJ",
    "address1": "197 Highway 18",
    "address2": "Suite 104",
    "city": "East Brunswick",
    "state": "NJ",
    "zip": "08816",
    "website": "http://www.cosnerlaw.com",
    "phone": "732-375-0290",
    "fax": "732-937-5439",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_2749682/pid_1/cosner_youngelson_counselors_at_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Family Law|Elder Law"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.cosnerlaw.com?refPageViewId=6c0d0dc0203d2239\" class=\"profile-website-body\" target=\"new\"> http://www.cosnerlaw.com </a>"
        }
    ],
    "practiceAreas": "Family Law|Elder Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/cosner-youngelson-counselors-at-law/nj/east-brunswick/Mjc0OTY4Ml8x/PP?refPageViewId=6c0d0cb3269002d6",
    "description": "<p>From our law office in East Brunswick, New Jersey, the attorneys at Cosner Youngelson Counsellors at Law provide exceptional counsel and support to a diverse range of clients throughout Middlesex County and beyond who have legal needs involving any of the following:</p><p></p><ul><li>Family law and divorce</li><li>Elder law</li><li>Estate planning and administration, wills and trusts</li><li>Real estate law</li><li>Bankruptcy</li><li>Special education law</li></ul><p></p><p>For more than 45 years, our law firm has delivered unmatched representation to individuals, families and business owners across our region who are dealing with complex, pressing legal challenges that affect them and their loved ones the most. During this time, we have achieved remarkable success helping our clients find the quality solutions and favorable outcomes they seek for their legal challenges, and you can rely on us to help you achieve your goals and the positive results you expect as efficiently and cost-effectively as possible.</p><p>Honored for our outstanding professionalism and service, our attorneys have earned many consistent top rankings and endorsements from our peers along with \"Superb\" ratings on Avvo. In addition, our law firm has enjoyed numerous testimonials and referrals from our satisfied clients, and we promise to do all we can to help you through this difficult and uncertain time in your life.</p><p>For more information, you can contact Cosner Youngelson Counsellors at Law to take advantage of our law firm's free initial consultation. We also offer virtual consultations to help keep you and your loved ones safe and healthy during these uncertain times.</p><p>We are a debt relief agency. We help people file for bankruptcy relief under the Bankruptcy Code.</p>"
}