{
    "companyName": "Geiger Legal Group, LLC - Canton, GA",
    "address1": "157 Reinhardt College Parkway",
    "address2": "Suite 400",
    "city": "Canton",
    "state": "GA",
    "zip": "30114",
    "website": "https://www.geiger-legal.com/",
    "phone": "770-720-4600",
    "fax": "770-720-4646",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5192023/pid_1/geiger_legal_group_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Real Estate Law|Business Law|Estate Planning"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.geiger-legal.com/?refPageViewId=6b5fb27b161d21bb\" class=\"profile-website-body\" target=\"new\"> https://www.geiger-legal.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Real Estate Law|Business Law|Estate Planning",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/geiger-legal-group-llc/ga/canton/NTE5MjAyM18x/PP?refPageViewId=6b5fb17355175736",
    "description": "<p>From our law office in Canton, Georgia, the attorneys at the Geiger Legal Group, LLC, provide invaluable counsel and support to clients throughout Cherokee County and the surrounding areas who suffered an injury or lost a loved one as the result of a motor vehicle accident, a defective product, an act of medical malpractice or any other preventable tragedy caused by someone else's negligence.</p><p>In addition, our law firm's attorneys offer exceptional and effective residential and commercial real estate services as well as small-business transactions. Over the course of our history, we have recovered millions of dollars in total compensation for our plaintiff injury clients, including several multimillion-dollar awards. At the same time, we have helped numerous property owners and investors protect their rights and interests when buying or selling property while assisting many business owners with establishing their commercial enterprises.</p><p>No matter how complex your needs or the goals you wish to achieve, you can rely on our decades of combined legal experience to help see you through. We pride ourselves on the personalized attention we provide to all we serve, and we will sit with you and discuss all your options to help you make the best-informed decisions as we aggressively pursue the most favorable outcome on your behalf.</p><p>Honored for our outstanding professionalism and service, our attorneys have earned Martindale-Hubbell Distinguished* peer review ratings and Top 40 Under 40 rankings from The National Trial Lawyers. We are also proud to have received numerous testimonials and referrals from our satisfied clients.</p><p>To find out more about how the Geiger Legal Group, LLC, can best serve your needs and help you secure a brighter, more financially stable future for yourself and your family, we invite you to call our law office or visit our website to schedule a free initial consultation.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}