{
    "companyName": "Law Offices of Liu & Naime - Rancho Cucamonga, CA",
    "address1": "8291 Utica Ave.",
    "address2": "Suite 100A",
    "city": "Rancho Cucamonga",
    "state": "CA",
    "zip": "91730",
    "website": "http://socalfamlaw.com/",
    "phone": "877-253-8529",
    "fax": "909-941-4114",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4659784/pid_1/law_offices_of_liu_naime.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury - Plaintiff|Medical Malpractice|Motor Vehicle Accidents - Plaintiff|Consumer Protection|Auto Dealer Fraud|Lemon Law|Education Law|Adoption|Child Support|Mediation &amp; Collaborative Law|Custody &amp; Visitation|Divorce|Domestic Violence|Family Law|Father’s Rights|Military Divorce|Same-Sex Family Law|Animal Bites - Plaintiff|Birth Injury|Brain Injury|Nursing Home Abuse|Trucking Accidents|Premises Liability|Products Liability|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://socalfamlaw.com/?refPageViewId=6b9f345303a7128f\" class=\"profile-website-body\" target=\"new\"> http://socalfamlaw.com/ </a>"
        }
    ],
    "practiceAreas": "Personal Injury - Plaintiff|Medical Malpractice|Motor Vehicle Accidents - Plaintiff|Consumer Protection|Auto Dealer Fraud|Lemon Law|Education Law|Adoption|Child Support|Mediation &amp; Collaborative Law|Custody &amp; Visitation|Divorce|Domestic Violence|Family Law|Father’s Rights|Military Divorce|Same-Sex Family Law|Animal Bites - Plaintiff|Birth Injury|Brain Injury|Nursing Home Abuse|Trucking Accidents|Premises Liability|Products Liability|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-offices-of-liu--naime/ca/rancho-cucamonga/NDY1OTc4NF8x/PP?refPageViewId=6b9f334505b72209",
    "description": "<p><span style=\"font-size: 10pt; font-family: 'Verdana',sans-serif\">At the Law Offices of Liu &amp; Naime in Rancho Cucamonga, California, we are fully committed to helping you with the most serious and complex legal challenges affecting your family, your children and your livelihood.<br>Serving clients throughout San Bernardino, Riverside, Los Angeles and Orange counties and all of Southern California, the attorneys at our law firm possess extensive experience in many legal areas, and we strive to provide the highest level of advocacy and support possible for your legal needs involving any of the following: </span><span style=\"font-size: 10pt; font-family: 'Verdana',sans-serif\"><br>• <strong>Personal injury</strong> - If you suffered the wrongful death of a loved one, or if you or a loved one has suffered an injury or loss, due to the negligence or intentional act of and entity or person, you can count on us to fight hard to help you recover the full amount of compensation you deserve. Call us if you are or a loved one are innocent victim of a car accident, truck accident, boat accident, or a dangerous or defective product, or birth injury or other medical malpractice. We only get paid if we recover for you. <br>• <strong>School Abuse</strong> - School should be a safe place for children. Call us immediately if you have a child that has been physically or sexually abused by a teacher or another student. We will fight to protect your child and hold the school responsible. We have spent our careers representing children. No fee if no recovery. <br>• <strong>Special education law</strong> - Has the school district refused to provide your child with the appropriate education or services? If your child has special needs, you need us on your side. We have attorneys dedicated to ensuring the school district acts fairly, and that your child has an appropriate IEP. We will advocate for your child so that they can excel. If your case requires due process, you will pay us nothing in most cases. If we are successful, we will get paid by the school district. We are so confident in our skills that we will take the risk if we think you have a case. <br>• <strong>Lemon Law</strong> - Does your vehicle continue to have the same problems? Does it spend more time in the shop than your driveway? You don't have to continue driving a lemon. You and your family deserve a safe vehicle. Call us now for a free consultation. We don't get paid unless we recover for you.<br>• <strong>Family law</strong> - If you are facing divorce, we will be right there beside you throughout all proceedings to help ensure the best odds of achieving the goals you seek with regard to child custody and support, property division and other related matters. We handle all family law matters including domestic violence.<br></span></p><p><span style=\"font-size: 10pt; font-family: 'Verdana',sans-serif\">As you can see, the Law Offices of Liu &amp; Naime is here to help you with all of the legal issues that affect you and your family the most, and over the course of our history, our law firm has become the trusted source for exceptional legal counsel to families across our region. We promise to remain accessible to address your questions and concerns promptly, and to provide regular updates as to the status of your case.<br>For more information on what we can do for you, we invite you to contact our law office to schedule a free initial consultation. For many cases, we don't get paid if we don't recover for you. <br></span></p>"
}