{
    "companyName": "The Zinn Law Firm - Mill Valley, CA",
    "address1": "591 Redwood Highway",
    "address2": "Suite 400",
    "city": "Mill Valley",
    "state": "CA",
    "zip": "94941",
    "website": "http://www.zinn-law.com",
    "phone": "415-766-0496",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3858490/pid_1/the_zinn_law_firm.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.zinn-law.com?refPageViewId=6b9f2d10f2850314\" class=\"profile-website-body\" target=\"new\"> http://www.zinn-law.com </a>"
        },
        {
            "lawyersAtTheZinnLawFirmSelectedForASuperLawyers®List": "<ul><li> Zinn, Carter M. <a href=\"/profile/lawyer/carter-m-zinn/ca/mill-valley/Mzg1ODQ5MV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-zinn-law-firm/ca/mill-valley/Mzg1ODQ5MF8x/PP?refPageViewId=6b9f2c5f235e02e4",
    "description": "<p>At The Zinn Law Firm in San Francisco, California, we are here to help you recover the full amount of compensation you deserve for the injuries and losses you sustained as the result of someone else's negligent, careless or unlawful actions.</p><p>Serving clients throughout the greater San Francisco metro area and all across Northern California, the attorneys at our law firm possess decades of combined legal experience, and we have achieved unprecedented success advocating on behalf of individuals and families suffering from any of the following:</p><p>• Serious personal injuries and wrongful deaths caused by motor vehicle accidents, bicycle and pedestrian accidents, medical malpractice, nursing home abuse, dangerous property conditions and other preventable tragedies<br>• Brain injuries and paralysis<br>• Injuries caused by sexual assault </p><p>When you work with our law firm, you will receive direct attention directly from an attorney who is totally devoted to your case. Over the course of our history, we have recovered millions of dollars in settlements and awards for those in need, earning our reputation as one of the area's top injury law firms. We promise to remain by your side throughout all legal proceedings to ensure we have done all we can to help you secure the finances you need to cover your medical bills and support yourself and your family.</p><p>For a free evaluation of your claim from a local attorney you can trust with your most sensitive legal issues, you can contact The Zinn Law Firm by calling our law office or visiting our website to schedule an appointment.</p>"
}