{
    "companyName": "Law Offices of Cory A. Leshner, LLC - Harrisburg, PA",
    "address1": "415 Market Street",
    "address2": "Suite 204",
    "city": "Harrisburg",
    "state": "PA",
    "zip": "17101",
    "website": "https://coryleshner.com/",
    "phone": "717-884-0107",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4558560/pid_1/law_offices_of_cory_a_leshner_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Litigation|Areas within Business Law|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> Mon - Fri: 09:00 am – 05:00 pm; Sat - Sun: By Appointment <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://coryleshner.com/?refPageViewId=6c438fcbb37a09fa\" class=\"profile-website-body\" target=\"new\"> https://coryleshner.com/ </a>"
        }
    ],
    "practiceAreas": "Litigation|Areas within Business Law|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Mon - Fri: 09:00 am – 05:00 pm; Sat - Sun: By Appointment <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/law-offices-of-cory-a-leshner-llc/pa/harrisburg/NDU1ODU2MF8x/PP?refPageViewId=6c438f8a740367c8",
    "description": "<p>Here at the Law Offices of Cory A. Leshner, LLC, in Harrisburg, Pennsylvania, we offer a full range of quality, professional legal services to help you with all the serious and complex legal challenges affecting your life and livelihood, your business, your property and your future. Serving clients throughout Dauphin County and the surrounding areas, our law firm's founder and principal, attorney Cory A. Leshner, provides exceptional counsel and support to a diverse range of clients across our region who have legal needs involving any of the following areas:</p><p>• Personal injury<br>• Workers' compensation<br>• Business formation and startup consulting<br>• Administrative law<br>• Real estate<br>• Criminal defense</p><p class=\"MsoNormal\"></p><p class=\"MsoNormal\"></p><p>Mr. Leshner founded our law firm in order to deliver the highest level of representation possible to those in need. Since that time, we have achieved remarkable success helping our clients obtain their goals and the favorable outcomes they seek for their pressing legal issues, and our law firm has received numerous testimonials and referrals from our satisfied clients.</p><p>Devoted to superior client service, we will sit with you and discuss your options to help you make the best-informed decisions. You can also contact us anytime for a prompt response to your questions and concerns as they arise. Moreover, our law firm offers flexible payment options as well as contingency billing and more traditional billing, so you can retain the top-notch legal counsel you need when you need it the most.</p><p>To find out more about how we can best assist you with the legal matters you need to address, you can contact the Law Offices of Cory A. Leshner, LLC, to take advantage of our free initial consultation. We also currently offer virtual consultations to help keep you safe and healthy in these uncertain times. </p>"
}