{
    "companyName": "Spicer, Olin & Associates, P.C. - Blacksburg, VA",
    "address1": "504 South Main Street",
    "address2": "",
    "city": "Blacksburg",
    "state": "VA",
    "zip": "24060",
    "website": "https://www.spicerlawfirm.com",
    "phone": "540-315-8799",
    "fax": "540-951-5139",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4743952/pid_1/spicer_olin_associates_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Real Estate|Criminal Law|Business and Transactional Law|Estate Law|Car Accidents|Medical Malpractice|Wrongful Death|DUI and DWI"
        },
        {
            "litigation": "<ul><li>50%</li></ul>"
        },
        {
            "languages": "English"
        },
        {
            "previousLawFirmName": "<ul><li> Spicer Law Firm, 2013</li><li> Frank Spicer &amp; Cox, 1986</li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> 8:30am-5pm <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.spicerlawfirm.com?refPageViewId=6c4b10e274cbef2a\"> https://www.spicerlawfirm.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Real Estate|Criminal Law|Business and Transactional Law|Estate Law|Car Accidents|Medical Malpractice|Wrongful Death|DUI and DWI",
    "litigation": "<ul><li>50%</li></ul>",
    "languages": "English",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> 8:30am-5pm <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/spicer-olin--associates-pc/va/blacksburg/NDc0Mzk1Ml8x/PP?refPageViewId=6c4b10312526225d",
    "description": "<p>Since its founding in 1985, the law firm of Spicer, Olin &amp; Associates, P.C., in Blacksburg, Virginia, has offered personal injury, real estate, wills and estates, business law and criminal defense representation. We provide such services to people in Blacksburg, Christiansburg, Radford, Pulaski, Dublin and Montgomery County. Our emphasis is on efficiency and accessibility.</p><p>When an accident leaves you or your loved ones seriously injured, we strive to hold negligent parties responsible. In personal injury actions, we negotiate with attorneys and insurers to make certain you receive maximum compensation. Our firm is also capable of handling complex medical malpractice, premises liability and products liability cases.</p><p>In state and federal criminal cases, our team fights to protect your rights. We work to see the charges brought against you reduced or dismissed. Should your child be a college student at Radford University or Virginia Polytechnic Institute and State University facing charges for underage drinking, DUI or DWI, or traffic violations, we do what is necessary to protect their standing with the school as well as their future. Whatever the case, we provide a powerful and aggressive defense.</p><p>Spicer, Olin &amp; Associates, P.C., specifically focuses on providing individuals and businesses a number of services in helping protect your assets and financial interests. We can handle every aspect of your commercial and residential real estate transactions. Our attorneys also provide a wide range of estate and trust planning services to help preserve your estate and prevent unnecessary taxation and expense for your loved ones.</p><p>As part of our business and corporate representation, we guide fledgling and established companies through the business organizations process. We guide clients through eminent domain proceedings, land use and zoning matters, and landlord-tenant contracts.</p><p>During a free initial consultation, our attorneys will work closely with you in protecting your interests and helping you understand the legal system.</p>"
}