{
    "companyName": "Edwards Trial Law - New Britain, CT",
    "address1": "92 Vine St.",
    "address2": "",
    "city": "New Britain",
    "state": "CT",
    "zip": "06052",
    "website": "https://www.edwardstrial.law",
    "phone": "877-489-8456 (Toll Free)",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5176460/pid_1/edwards_trial_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.edwardstrial.law?refPageViewId=6bb1b97240340a0e\"> https://www.edwardstrial.law </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/edwards-trial-law/ct/danbury/NTA1ODk5Nl8x/PP\"> Edwards Trial Law </a> (Main Office) <span class=\"pp_card_street\"> 48 North St. </span><span class=\"pp_card_street\"><span>Danbury</span>, <span>CT</span><span> 06810 </span></span><span class=\"pp_card_street\"> 877-489-8456 </span></p>"
        },
        {
            "lawyersAtEdwardsTrialLawSelectedForASuperLawyers®List": "<ul><li> Edwards, Paul T. <a href=\"/profile/lawyer/paul-t-edwards/ct/danbury/NTA2MDI2MV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5176460_1?refPageViewId=6bb1b90757f4370d#otherlocations",
    "description": " From our Danbury, Connecticut, law office, Edwards Trial Law operates with perseverance and a principled commitment to winning our clients' personal injury car accident cases. Our attorney Paul T. Edwards works dynamically to get every dollar crucial to right the wrongs to his clients and to compensate for all of the harms and losses his clients have endured.<p>Our clients come to our law firm largely from western and central Connecticut, including Fairfield and Hartfield counties. They bring with them their desire for justice with regard to many kinds of serious collisions:</p><p>• Automobile crashes<br>• Trucking accidents<br>• Ride-share cases<br>• Public transit<br>• Uninsured and underinsured motorist cases</p><p>Medical Malpractice</p><p>In addition to helping our clients get resolution after a motor vehicle accident, we maintain a strong focus on medical malpractice. This may result from both general and spinal surgeries that have gone awry. We have significant and rare-to-find experience handling medical malpractice issues involving spine and brain impairments.</p><p>Medical malpractice also occurs at birth when a medical provider neglected to properly assess the infant during or after delivery. This could be a physician or nurse who did not adequately follow a doctor's instructions. Our law firm readily handles these kinds of cases.</p><p>High Accolades From The Legal Community</p><p>The legal community has selected Mr. Edwards for inclusion in the Connecticut Super Lawyers list and New England Super Lawyers list for plaintiff's medical malpractice and personal injury in recent years. His peers have also similarly selected him for inclusion in The Best Lawyers in America. </p><p>Mr. Edwards has earned membership in the Million Dollar Advocates Forum, one of the most prestigious groups of trial lawyers in the country, limited to attorneys who have won million or multimillion-dollar verdicts or settlements.</p><p>At Edwards Trial Law, we offer free initial consultations. Our law firm also accepts credit cards.</p>"
}