{
    "companyName": "Frost & Carey, LLC - Loganville, GA",
    "address1": "4402 Lawrenceville Road",
    "address2": "Suite 215",
    "city": "Loganville",
    "state": "GA",
    "zip": "30052",
    "website": "https://www.frostcareylaw.com",
    "phone": "678-212-1365",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5060038/pid_1/frost_carey_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Law|Family Law|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.frostcareylaw.com?refPageViewId=6b5f7012135467d4\"> https://www.frostcareylaw.com </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/frost--carey-llc/ga/covington/NTA1MDk0OV8x/PP\"> Frost &amp; Carey, LLC </a> (Main Office) <span class=\"pp_card_street\"> 2117 Usher Street N.W. </span><span class=\"pp_card_street\"><span>Covington</span>, <span>GA</span><span> 30014 </span> - 2851 </span><span class=\"pp_card_street\"> 678-212-1365 </span></p>"
        },
        {
            "lawyersAtFrost&Carey,LLCSelectedForASuperLawyers®List": "<ul><li> Carey, Tyler A.P. <a href=\"/profile/lawyer/tyler-ap-carey/ga/covington/NTA1MTc2N18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Criminal Law|Family Law|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/view/5060038_1?refPageViewId=6b5f6fc7e0c609da#otherlocations",
    "description": "<p>At the Frost &amp; Carey, LLC, in Covington, Georgia, we offer a full range of high-quality legal services to help individuals, families and business owners with all of their most important and pressing legal issues.</p><p>Serving clients throughout Newton, Jasper and Rockdale counties and all across the state, the attorneys at our law firm are fully committed to delivering the personalized attention and effective representation you need for your legal challenges involving any of the following:</p><p>• Criminal defense for all types of felony and misdemeanor charges, including DUI, drug crimes, sex crimes, violent crimes, theft and burglary, aggravated stalking and more<br>• Personal injury and wrongful death claims resulting from automobile and commercial truck accidents, medical malpractice, dangerous property conditions, defective products, and other claims of negligence or wrongdoing<br>• Family law, including divorce, child custody and support, alimony, adoptions and all other related matters<br>• Wills, trusts and other estate planning instruments, as well as estate administration and probate representation<br>• Business law, including entity formation, contracts, commercial disputes, and litigation and employment issues<br>• Appeals</p><p>Backed by more than 40 years of combined legal experience, our attorneys possess the extensive knowledge and resources necessary to handle the demands of your case regardless of how complex or challenging. By putting your needs first, we promise to do whatever is necessary to help you achieve the most favorable outcome possible for your case. Our attorneys have received top ratings and numerous awards and honors for our impeccable professionalism and exceptional customer service.</p><p>For more information on how Frost &amp; Carey, LLC can best serve you, your family or your company, we invite you to contact our law office or visit our website to schedule a free initial consultation.</p>"
}