{
    "companyName": "Charlie Condon Law Firm, LLC - Mount Pleasant, SC",
    "address1": "880 Johnnie Dodds Boulevard",
    "address2": "Suite 1",
    "city": "Mount Pleasant",
    "state": "SC",
    "zip": "29464",
    "website": "https://www.charliecondon.com/",
    "phone": "843-352-3148",
    "fax": "843-884-6595",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3966357/pid_1/charlie_condon_law_firm_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Criminal"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.charliecondon.com/?refPageViewId=6c43bd2ea78f09ae\" class=\"profile-website-body\" target=\"new\"> https://www.charliecondon.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.charliecondon.com/blog/?refPageViewId=6c43bd2ea78f09ae\"> https://www.charliecondon.com/blog/ </a>"
        },
        {
            "lawyersAtCharlieCondonLawFirm,LLCSelectedForASuperLawyers®List": "<ul><li> Condon, Charlie <a href=\"/profile/lawyer/charlie-condon/sc/mount-pleasant/MTkyNzM2NV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Criminal",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/charlie-condon-law-firm-llc/sc/mount-pleasant/Mzk2NjM1N18x/PP?refPageViewId=6c43bc3e4397d531",
    "description": "<p>From their law office in Mount Pleasant, South Carolina, the attorneys at the Charlie Condon Law Firm, LLC, provide unmatched counsel and support to clients throughout the greater Charleston metro region and surrounding areas of South Carolina's low country who have legal needs involving any of the following: </p><p>• Personal injury<br>• Workers' compensation<br>• DUI defense<br>• Criminal defense for all other types of felonies and misdemeanors<br>• Juvenile law<br>• Government relations and administrative law<br>• Probate litigation<br>• General civil litigation </p><p>A former district attorney with Charleston and Berkeley counties and past attorney general of South Carolina, attorney Charlie Condon established his practice in 2005 with a mission to deliver the highest level of representation possible to those dealing with complex, pressing legal challenges that affect their lives and livelihoods, their freedom, and their future. </p><p>Honored for his outstanding professionalism and service, Mr. Condon has earned an AV-Preeminent peer review rating* from Martindale-Hubbell along with many other top rankings and endorsements from his peers. Devoted to your needs, he and his associate attorney promise to do all they can to help you obtain the favorable outcomes you seek efficiently and cost-effectively, and his law office has become the trusted source for quality, effective representation to many across his area. </p><p>To find out more about how the Charlie Condon Law Firm, LLC, can best help you face your legal challenges head-on and increase your chances for a successful outcome, you can call their office or visit their website to schedule a free initial consultation. They also offer virtual consultations to help keep you and your family safe in these uncertain times. </p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}