{
    "companyName": "Etheridge, Hamlett & Murray, LLP - Nashville, NC",
    "address1": "212 W. Church St.",
    "address2": "",
    "city": "Nashville",
    "state": "NC",
    "zip": "27856",
    "website": "http://www.ehmlawyer.com/",
    "phone": "252-220-4518",
    "fax": "252-459-9797",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4901390/pid_1/etheridge_hamlett_murray_llp.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Defense 30%|Personal Injury 25%|Family Law 22%|General Litigation 10%|Estates &amp; Trusts 6%|Other 7%"
        },
        {
            "litigation": "<ul><li>80%</li></ul>"
        },
        {
            "languages": "English (Primary)"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "officeHours": "<p> 8:30 AM - 5:00 PM M-F; Closed 1-2 PM <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.ehmlawyer.com/?refPageViewId=6c3a08f1b02f099a\" class=\"profile-website-body\" target=\"new\"> http://www.ehmlawyer.com/ </a>"
        }
    ],
    "practiceAreas": "Criminal Defense 30%|Personal Injury 25%|Family Law 22%|General Litigation 10%|Estates &amp; Trusts 6%|Other 7%",
    "litigation": "<ul><li>80%</li></ul>",
    "languages": "English (Primary)",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> 8:30 AM - 5:00 PM M-F; Closed 1-2 PM <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/etheridge-hamlett--murray-llp/nc/nashville/NDkwMTM5MF8x/PP?refPageViewId=6c3a08a627ce09a2",
    "description": "<p>For experienced and aggressive representation following a speeding ticket or traffic offense, people in Nashville, North Carolina, rely on Etheridge, Hamlett &amp; Murray, LLP. Our law firm understands the serious consequences associated with the loss of a driver's license or clean record. We work relentlessly to minimize the damage stemming from allegations of driving while impaired, driving with a suspended license and other motor vehicle charges. Our attorneys also provide an extensive array of broader criminal defense and civil litigation services. </p><p>In addition to traffic and criminal matters, our law firm frequently takes on family law and estate planning cases. Attorney William Etheridge, who works heavily in these areas, has upheld the highest rating possible of AV Preeminent* from Martindale-Hubbell for 30 years. He creates wills and helps clients protect their assets and legacies via both meticulous planning and administration. He also helps clients resolve separations and divorces and all related conflicts, including the following:</p><p>• Alimony<br>• Child custody<br>• Division of property<br>• Domestic violence </p><p>Finally, our law firm offers comprehensive assistance to personal injury victims. This includes clients with cases specific to medical malpractice, wrongful death and workers' compensation. Etheridge, Hamlett &amp; Murray, LLP offers a free initial consultation and accepts credit cards as payment. We work across the greater Rocky Mount metropolitan area.</p><p>* AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p><p></p>"
}