{
    "companyName": "Cummings Law - Nashville, TN",
    "address1": "4235 Hillsboro Pike",
    "address2": "#300",
    "city": "Nashville",
    "state": "TN",
    "zip": "37215",
    "website": "https://cummingsinjurylaw.com/",
    "phone": "615-241-2000",
    "fax": "615-815-1876",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_5056583/pid_1/cummings_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://cummingsinjurylaw.com/?refPageViewId=6c43e805c3e567c8\" class=\"profile-website-body\" target=\"new\"> https://cummingsinjurylaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://cummingsinjurylaw.com/blog/?refPageViewId=6c43e805c3e567c8\"> https://cummingsinjurylaw.com/blog/ </a>"
        },
        {
            "lawyersAtCummingsLawSelectedForASuperLawyers®List": "<ul><li> Cummings, Brian <a href=\"/profile/lawyer/brian-cummings/tn/nashville/MzQ0NTg3MV8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/cummings-law/tn/nashville/NTA1NjU4M18x/PP?refPageViewId=6c43e7daa38d67db",
    "description": "<p>Attorney Brian Cummings is the founder and owner of Cummings Law. Board certified as a medical malpractice attorney by the American Board of Professional Liability Attorneys and possessing more than 20 years of successful legal experience, Mr. Cummings has achieved notable success advocating on behalf of clients who are dealing with complex personal injury and medical malpractice claims.</p><p>Throughout the course of his career, Mr. Cummings has recovered millions of dollars in settlements and awards for his plaintiff clients, including more than $26,000,000.00 in just the past few years, which led to him becoming a Lifetime Member of the Multi-Million Dollar Advocates Forum. This level of success is the direct result of his unwavering commitment to those he serves coupled with his extensive legal knowledge and aggressive trial and negotiation tactics.</p><p>Recognized for this success and his exceptional legal abilities, Mr. Cummings was selected by SuperLawyers for representing plaintiffs for 6 straight years from 2015-2020, and he holds an AV-Preeminent peer-review rating* from Martindale-Hubbell. In addition, The National Trial Lawyers selected him for inclusion into the Top 100 Trial Attorneys list, and The American Lawyer selected him for inclusion into the list of Best Lawyers in Medical Malpractice.</p><p>In 2020, Brian was selected by U.S. Business News as the Best Medical Malpractice Attorney in the Southern United States. This award was earned based on his legal skills and his contributions to the legal profession.</p><p>Active in the legal community, Mr. Cummings is a senior fellow with The Litigation Counsel of America. He is admitted to practice before the United States Supreme Court, the U.S. District Courts in Tennessee and Hawaii, and he is licensed to practice in Tennessee, Hawaii, California, Georgia, and Florida.</p><p>Mr. Cummings graduated with honors from Rutgers University in 1995. He then attended Vanderbilt University Law School, where he obtained his Juris Doctor in 1998. </p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Rating™ fall into two categories – legal ability and general ethical standards.</p>"
}