{
    "companyName": "Stein Whatley Attorneys, PLLC - Louisville, KY",
    "address1": "2525 Bardstown Rd.",
    "address2": "#101",
    "city": "Louisville",
    "state": "KY",
    "zip": "40205",
    "website": "http://www.steinwhatley.com",
    "phone": "502-694-4430",
    "fax": "502-459-2687 (Fax)",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4042574/pid_1/stein_whatley_attorneys_pllc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> Monday - Friday, 9:00 a.m. to 5 p.m. <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.steinwhatley.com?refPageViewId=6bd94401059a67c2\" class=\"profile-website-body\" target=\"new\"> http://www.steinwhatley.com </a>"
        },
        {
            "lawyersAtSteinWhatleyAttorneys,PLLCSelectedForASuperLawyers®List": "<ul><li> Astorino, Rob <a href=\"/profile/lawyer/rob-astorino/ky/louisville/NTA5NDk3N18x/PP#feedback\">On a Super Lawyers® List</a></li><li> Stein, Matthew W. <a href=\"/profile/lawyer/matthew-w-stein/ky/louisville/MTk3NjM5OF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Whatley, John Amos <a href=\"/profile/lawyer/john-amos-whatley/ky/louisville/NDg3NTg5OF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Monday - Friday, 9:00 a.m. to 5 p.m. <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/stein-whatley-attorneys-pllc/ky/louisville/NDA0MjU3NF8x/PP?refPageViewId=6bd9437073e967e6",
    "description": "<p>Located in Louisville, Kentucky, Stein Whatley Attorneys, PLLC, is dedicated to helping you recover the maximum amount of damages for the injuries and losses you sustained as the result of someone else's negligence or wrongdoing.</p><p>Serving clients throughout Jefferson County and the surrounding areas, the law firm's attorneys possess over 40 years of legal experience combined, and through their efforts, they have achieved unprecedented success advocating on behalf of those in need, securing numerous million-dollar and multimillion-dollar settlements and awards for those adversely affected by any of the following:</p><p>• Car, truck and motorcycle accidents<br>• Dangerous property conditions and premises liability claims<br>• Defective products<br>• Farm accidents<br>• Wrongful death</p><p>In addition, the law firm assists injured and disabled employees with securing their rightful workers' compensation and Social Security Disability benefits. They also provide exceptional counsel to business owners facing complex commercial litigation, and they can help you if you have been defrauded by a business or salesperson.</p><p>Partner Matthew W. Stein has practiced law since 1989, and he is board-certified as a civil trial advocate by the National Board of Trial Advocacy and board-certified by the National Board of Civil Pretrial Practice Advocacy as a civil pretrial advocate. Over the course of his long and illustrious career, he has received many awards and honors for his professionalism and service, and The National Trial Lawyers has voted him among the Top 100 trial attorneys in the region.</p><p>Attorney John Amos Whatley, another partner, has practiced law since 2005, and he is licensed to practice in Mississippi as well as Kentucky. A top-rated trial attorney as well, he has helped numerous individuals and families secure a brighter future in the face of a debilitating injury or devastating loss.</p><p>The firm's final partner, Rob Astorino Jr., has achieved multiple six figure settlements since he began practicing in 2013. His results for his clients show the ability to take on difficult cases and come out ahead. He fights hard for average people when they face life altering injuries.</p><p>Working together, they have helped establish Stein Whatley Attorneys, PLLC, as one of the area's premiere personal injury practices, and they promise to treat you with the respect and dignity you deserve as they work toward helping you obtain the justice you seek. For a free evaluation of your claim, you can contact their law office to schedule an appointment.</p>"
}