{
    "companyName": "Titsworth Law Offices, P.A. - Cary, NC",
    "address1": "1135 Kildaire Farm Road",
    "address2": "Suite 301",
    "city": "Cary",
    "state": "NC",
    "zip": "27511",
    "website": "https://www.mynclawyer.com",
    "phone": "919-297-2372",
    "fax": "919-460-9631",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4999776/pid_1/titsworth_law_offices_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice|Auto Accidents|Workers' Compensation"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "officeHours": "<p> Monday - Friday: 8:00AM - 5:00PM <br></p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.mynclawyer.com?refPageViewId=6c3a093677750341\"> https://www.mynclawyer.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice|Auto Accidents|Workers' Compensation",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "<p> Monday - Friday: 8:00AM - 5:00PM <br></p>",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/titsworth-law-offices-pa/nc/cary/NDk5OTc3Nl8x/PP?refPageViewId=6c3a08a627ce09a2",
    "description": "<p>When another person's mistakes upend your physical, emotional and financial health, you can trust Titsworth Law Offices, P.A., to make it right. Our Cary, North Carolina, personal injury lawyers will work closely with you throughout every stage of your case and will treat you as a partner in the pursuit of the compensation you need to recover in comfort. We understand what is at stake for you, and we only agree to take on your case when we know we can devote to it the time, attention and resources it deserves.</p><p>A personal injury can happen at any moment, and while you participate in the most everyday of activities. Since 1994, the founder of our law office, Attorney Daniel B. Titsworth, has represented hundreds of clients in all aspects of personal injury law, including the following:</p><p>• Auto accidents<br>• Medical malpractice<br>• Products liability<br>• Workers' compensation</p><p>When he founded Titsworth Law Offices, P.A., Daniel did so with the goal of creating a practice with \"Lawyers You Can Talk To.\" He believes that accessibility is tantamount to a case's success, which he demonstrates by encouraging you to call him by his first name, speaking in a language you will understand, and always making himself available to answer your phone calls or meet with you in person. For his long list of successful results and superior ethical standards, attorney Titsworth is the recipient of the highest peer rating possible of AV Preeminent* from Martindale-Hubbell.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary.</p><p> Martindale-Hubbell® Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}