{
    "companyName": "The Law Office of Robert H. Kleinschmidt, P.C. - Scottsdale, AZ",
    "address1": "8777 E. Via De Ventura",
    "address2": "Suite 115",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85258",
    "website": "https://www.azinjurymalpractice.com",
    "phone": "480-951-3949",
    "fax": "480-483-7003",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1781659/pid_1/the_law_office_of_robert_h_kleinschmidt_pc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Birth Injury|Wrongful Death"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.azinjurymalpractice.com?refPageViewId=6ba88580f418034d\"> https://www.azinjurymalpractice.com </a><a rel=\"sponsored\" href=\"https://www.azinjurymalpractice.com?refPageViewId=6ba88580f418034d\" class=\"profile-website-body\" target=\"new\"> https://www.azinjurymalpractice.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Birth Injury|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-law-office-of-robert-h-kleinschmidt-pc/az/scottsdale/MTc4MTY1OV8x/PP?refPageViewId=6ba8853d74180992",
    "description": "<p>Located in Scottsdale, Arizona, The Law Office of Robert H. Kleinschmidt, P.C., provides exceptional advocacy and support to those throughout our state who suffered an injury or lost a loved one as the result of another party's negligent, careless or unlawful actions.</p><p>Focusing solely on personal injury and wrongful death claims, our law firm's founder, attorney Robert H. Kleinschmidt, has achieved considerable success fighting for the rights, interests and entitlements of innocent accident victims and their families. A lawyer since 1984, Mr. Kleinschmidt spent the early part of his career working as an insurance defense attorney. Because of this, he has invaluable insight into the industry, which makes him even more effective as an advocate for our plaintiff clients.</p><p>Since opening our law firm in 1994, Mr. Kleinschmidt has helped people from all walks of life face their legal challenges head-on while working hard to improve the likelihood they will receive the full amount of compensation for the damages they suffered. We have secured millions of dollars in settlements and awards for those adversely affected by medical negligence, birth injuries, surgical errors, defective products and other preventable tragedies.</p><p>For our success, we have earned a membership in the Multi-Million Dollar Advocates Forum as well as recognition from The National Trial Lawyers. In addition, we hold an AV-Preeminent* peer-review rating from Martindale-Hubbell, and we have received numerous five-star reviews from satisfied clients.</p><p>To find out more about how The Law Office of Robert H. Kleinschmidt, P.C., can best make a positive change in your life and hold those accountable for your pain and suffering, you can call our office or visit our website to schedule a free initial consultation.</p><p>*AV速, AV Preeminent速, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell速 is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell速 Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}