{
    "companyName": "Evan M. Altman, Attorney at Law - Atlanta, GA",
    "address1": "Northridge 400",
    "address2": "8325 Dunwoody Place",
    "city": "Building Two",
    "state": "Atlanta",
    "zip": ", GA",
    "website": "https://www.evanmaltmanlaw.com",
    "phone": "770-285-7134",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_3409641/pid_1/evan_m_altman_attorney_at_law.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Bankruptcy Law- Consumer and Business, Chapter 7, Chapter 11, Chapter 13|SSDI|Business Law|Wills"
        },
        {
            "proBonoActivities": "<ul><li> Attorney, Fulton County Juvenile Court, appointed to handle cases on behalf of indigent clients </li></ul>"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.evanmaltmanlaw.com?refPageViewId=6b5fb040e4730a3e\"> https://www.evanmaltmanlaw.com </a>"
        }
    ],
    "practiceAreas": "Bankruptcy Law- Consumer and Business, Chapter 7, Chapter 11, Chapter 13|SSDI|Business Law|Wills",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/evan-m-altman-attorney-at-law/ga/atlanta/MzQwOTY0MV8x/PP?refPageViewId=6b5fae5094c62215",
    "description": "<p>Serving clients in Atlanta, Georgia, since 1989, our team at The Law Office of Evan M. Altman handles a range of personal and business law matters. Our law firm has an exceptional history of generating results for clients from all walks of life. We have obtained favorable outcomes in practice areas that include the following:</p><p>• Business and commercial law: Transaction, litigation, contract review and legal planning<br>• Personal injury: Medical malpractice, premises liability and motor vehicle accidents<br>• Bankruptcy: Loan workouts, Chapter 7, Chapter 11, Chapter 13 and debtor/creditor issues</p><p class=\"MsoNormal\"><span>Any of these issues can be highly complex. We understand that clients of our law firm will have questions regarding which path is best for them. As matters unfold, we remain in close contact with the people we represent in order to respond to their concerns and advise them of their options. We carefully craft our strategies to meet each client’s goals while still preserving their time and resources.</span></p><p class=\"MsoNormal\"><span>The founder of our law firm, Evan Altman, has earned widespread recognition for his work. He holds an \"Excellent\" rating on Avvo, and he is AV Preeminent peer-review rated,* the highest rating, through Martindale-Hubbell. Additionally, a number of media outlets have highlighted his work. Mr. Altman can meet with clients virtually when an in-person appointment is not feasible.</span></p><p class=\"MsoNormal\">Evan M. Altman is a debt relief agency. We help people seek bankruptcy protection under the U.S. Bankruptcy Code.</p><p class=\"MsoNormal\">* AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer-review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}