{
    "companyName": "Michael C. Jones & Associates, LLC - Atlanta, GA",
    "address1": "1827 Powers Ferry Road",
    "address2": "Bldg. 11",
    "city": "Suite 200",
    "state": "Atlanta",
    "zip": ", GA",
    "website": "http://www.mikejoneslaw.com",
    "phone": "404-596-6281",
    "fax": "404-601-1845",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4437313/pid_1/michael_c_jones_associates_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Motor Vehicle Accidents|Trucking Accidents"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.mikejoneslaw.com?refPageViewId=6b5fa89cd61e0351\" class=\"profile-website-body\" target=\"new\"> http://www.mikejoneslaw.com </a>"
        }
    ],
    "practiceAreas": "Personal Injury|Motor Vehicle Accidents|Trucking Accidents",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/michael-c-jones--associates-llc/ga/atlanta/NDQzNzMxM18x/PP?refPageViewId=6b5fa8156016031c",
    "description": "<p>Providing prompt, professional and effective real estate law representation, our attorneys at the law firm of Michael C. Jones &amp; Associates, LLC, proudly serve clients in Atlanta, Georgia, as well as throughout the surrounding area. Tenaciously advocating on behalf of our clients' rights and interests, we strive to help those we represent achieve the most favorable solutions possible to the legal challenges they face.</p><p>Whether a first-time homebuyer or an experienced real estate investor, we help clients navigate the ins and outs of buying, selling and owning residential and commercial real estate properties. Our law firm represents clients with a range of real estate-related matters, including those involving contracts, land use and zoning.</p><p>In addition to our real estate services, our law firm also represents those injured due to the negligence or carelessness of others. Aiding clients with cases involving matters such as car and truck accidents, medical malpractice, premises liability and wrongful death, our personal injury attorneys aggressively pursue the maximum compensation for our clients' injury-associated losses.</p><p>At the law firm of Michael C. Jones &amp; Associates, LLC, we offer free initial consultations. During that first meeting, we take time to get to know our clients and to understand their legal needs, before advising them of their options. Our attorneys tailor their counsel to suit the specific needs and legal objectives of each client we represent. Our firm also offers virtual appointment options, and we accept credit card payments.</p>"
}