{
    "companyName": "Reynolds Law Group, LLC - Atlanta, GA",
    "address1": "3390 Peachtree Road",
    "address2": "Suite 1100",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30326",
    "website": "https://www.thomasreynoldslaw.com",
    "phone": "(404) 907-1420",
    "fax": "(888) 677-1453",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4683730/pid_1/reynolds_law_group_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Entertainment Law|Personal Injury|Real Estate Law|Entertainment Law, Personal &amp; Real Estate|Personal Injury, Entertainment Law, Personal &amp; Real Estate"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.thomasreynoldslaw.com?refPageViewId=6b5fb2eba57f2269\"> https://www.thomasreynoldslaw.com </a>"
        },
        {
            "lawyersAtReynoldsLawGroup,LLCSelectedForASuperLawyers®List": "<ul><li> Reynolds, Thomas <a href=\"/profile/lawyer/thomas-reynolds/ga/atlanta/Mzg3NTczNF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Entertainment Law|Personal Injury|Real Estate Law|Entertainment Law, Personal &amp; Real Estate|Personal Injury, Entertainment Law, Personal &amp; Real Estate",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/reynolds-law-group-llc/ga/atlanta/NDY4MzczMF8x/PP?refPageViewId=6b5fb1a0c1c25736",
    "description": "<p><span style=\"font-size: 8pt; color: #333333\">With over 50 years of combined experience including a Rising Star Super Lawyer, Reynolds Law Group provides the focus of a boutique law firm with experience representing a broad range of clients and legal matters, including music producers and artists, professional sports athletes, commercial real estate companies and victims of personal injuries, to name a few. Our firm has a core staff of dedicated and well-trained lawyers and paralegals, many with experience at some of the nation's top law firms and/or law schools.</span></p><p><span style=\"font-size: 8pt; color: #333333\">At Reynolds Law Group, we provide niche legal counsel to musicians and filmmakers as they navigate the entertainment industry. From our law office in Atlanta, Georgia, we help artists throughout the state negotiate publishing deals, maximize capital investments and leverage the full extent of the legal protections available to them for their works. With a client-oriented approach, we take the time to understand individual artist needs and goals to create a custom pathway to success.</span></p><p><span style=\"font-size: 8pt; color: #333333\">Our law office understands talent is valuable, and we go above and beyond to safeguard our clients’ creative property and assets, whether they work in film, music, theatre or another medium. Thanks to our many years of experience representing top artists in the cities of Sandy Springs, College Park, Jonesboro and the Atlanta metropolitan area, we are uniquely equipped to address the complexities of these types of matters. Whether clients are based in Fulton County, Cobb County, DeKalb County or Gwinnett County, they trust us to deliver the best in advice and customer service.</span></p><p><span style=\"font-size: 8pt; color: #333333\">Outside of focused representation for entertainers, Reynolds Law Group also offers fierce advocacy for injured victims that focuses on holding negligent parties responsible for their actions. We perform our own investigation into their auto accident and take on the task of dealing with the insurance company.</span></p><p><span style=\"font-size: 8pt; color: #333333\">Clients always come first at our law office. At the first meeting, we provide an upfront and honest opinion of a case before taking the next steps. Our attorneys handle a wide range of legal issues involving immigration, criminal defense, real estate, employment, government relations, family law, and oil and gas. For utmost convenience, we also accept credit cards.</span></p>"
}