{
    "companyName": "The Law Offices of T. Andrew Miller, LLC - Atlanta, GA",
    "address1": "6111 Peachtree Dunwoody Rd.",
    "address2": "Building G, Suite 102",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "website": "https://www.amillerlegal.com",
    "phone": "678-894-7868",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4856727/pid_1/the_law_offices_of_t_andrew_miller_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Workers Compensation|Personal Injury"
        },
        {
            "languages": "Spanish"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.amillerlegal.com?refPageViewId=6b5fa95744a52263\"> https://www.amillerlegal.com </a>"
        },
        {
            "lawyersAtTheLawOfficesOfT.AndrewMiller,LLCSelectedForASuperLawyers®List": "<ul><li> Miller, T. Andrew <a href=\"/profile/lawyer/t-andrew-miller/ga/atlanta/MzcyNDU5NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Workers Compensation|Personal Injury",
    "litigation": "",
    "languages": "Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/the-law-offices-of-t-andrew-miller-llc/ga/atlanta/NDg1NjcyN18x/PP?refPageViewId=6b5fa8351119031c",
    "description": "<p>At The The Law Offices of T. Andrew Miller, injured workers in the Atlanta area and across Georgia find trustworthy and experienced counsel and guidance with workers' compensation claims. For years, attorney T. Andrew \"Andy\" Miller litigated cases for insurance companies and employers, gaining significant trial experience. Today, he uses that knowledge and experience to vigorously uphold the rights of injured workers and their families. Mr. Miller represents employees statewide who have suffered catastrophic and disabling injuries and other workplace incidents rendering them unable to earn a living. </p><p>Mr. Miller is AV Preeminent* peer-review rated, the highest rating possible, through Martindale-Hubbell. He has also been selected for inclusion as a Rising Star by Georgia Super Lawyers annually since 2014, rated \"Excellent\" on Avvo.com and has a perfect Five-Star rating on Lawyers.com. Here are a few other reasons Georgia’s injured workers choose him as their advocate:</p><ul><li>Mr. Miller provides <strong>personal attention </strong>to clients and works with them one-on-one.</li><li>Mr. Miller is <strong>accessible</strong> and works hard to respond to clients' concerns seven days a week.</li><li>Mr. Miller charges <strong>no upfront fees</strong>, and he only gets paid if he is successful.</li><li>Mr. Miller has in-depth <strong>experience</strong> in these types of injury claims.</li></ul><p>To schedule a <strong>free consultation</strong> about your workers' compensation case, call the Atlanta office today. The The Law Offices of T. Andrew Miller, serves clients in Fulton County, Cobb County and throughout the state.<br>___________________________________________________________________</p><p><em>*AV Preeminent and BV Distinguished are certification marks of Reed Elsevier Properties Inc., used in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell is the facilitator of a peer review rating process. Ratings reflect the confidential opinions of members of the bar and the judiciary. Martindale-Hubbell ratings fall into two categories: legal ability and general ethical standards.</em></p>"
}