{
    "companyName": "Boyers Law Group - Coral Gables, FL",
    "address1": "2333 Ponce De Leon Blvd.",
    "address2": "Penthouse 1120",
    "city": "Coral Gables",
    "state": "FL",
    "zip": "33134",
    "website": "https://www.boyerslaw.com/",
    "phone": "786-600-4061",
    "fax": "786-509-8021",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4982515/pid_1/boyers_law_group.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Medical Malpractice"
        },
        {
            "languages": "Spanish"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.boyerslaw.com/?refPageViewId=6b479e96126a223f\" class=\"profile-website-body\" target=\"new\"> https://www.boyerslaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.floridainjurylawyerblog.net/?refPageViewId=6b479e96126a223f\"> https://www.floridainjurylawyerblog.net/ </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/view/5244333_1\"> Boyers Law Group </a><span class=\"pp_card_street\"> 4700 Millenia Blvd. </span><span class=\"pp_card_street\"> Ste 175 </span><span class=\"pp_card_street\"><span>Orlando</span>, <span>FL</span><span> 32839 </span></span><span class=\"pp_card_street\"> 407-664-1682 </span></p><p><a href=\"/profile/view/5244337_1\"> Boyers Law Group </a><span class=\"pp_card_street\"> 1301 Riverplace Blvd. </span><span class=\"pp_card_street\"> Ste 800 </span><span class=\"pp_card_street\"><span>Jacksonville</span>, <span>FL</span><span> 32207 </span></span><span class=\"pp_card_street\"> 904-780-2012 </span></p>"
        },
        {
            "lawyersAtBoyersLawGroupSelectedForASuperLawyers®List": "<ul><li> Boyers, Robert <a href=\"/profile/lawyer/robert-boyers/fl/coral-gables/NDQ0MjA0OF8x/PP#feedback\">On a Super Lawyers® List</a></li><li> Mazzarella, Matthew <a href=\"/profile/lawyer/matthew-mazzarella/fl/coral-gables/NDE1OTQ5M18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Medical Malpractice",
    "litigation": "",
    "languages": "Spanish",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/boyers-law-group/fl/coral-gables/NDk4MjUxNV8x/PP?refPageViewId=6b479d4e368902ed",
    "description": "<p>When people in Miami and throughout Florida are harmed due to a devastating personal injury, medical malpractice, defective product or the wrongful death of a loved one and need exceptional legal representation to help them achieve justice, they turn to Boyers Law Group. The trial lawyers at Boyers Law Group have successfully represented victims of car accidents, defective products, medical malpractice, wrongful death, hazardous premises, negligent security, boating and aviation accidents, as well as cruise line negligence for over 25 years. <br><br>Firm founder, Robert Boyers, has more than two decades of litigation and trial experience in effectively advocating for his seriously injured clients. He holds the highest rating of AV Preeminent* from Martindale-Hubbell and has been repeatedly named one of the Best Lawyers in America, a Florida Super Lawyer, a Top 100 trial lawyer by the National Trial Lawyers association, one of America's Top 100 Attorneys and has for many years been named a member of Florida’s Legal Elite. Mr. Boyers holds a 10/10 Avvo rating and is also a long-time member of the Million Dollar Advocates Forum. He is a past President of the Miami Dade County Trial Lawyers Association and is a past Director of both the Florida Justice Association and the Dade County Bar Association. He is an active member of the American Association of Justice and the New York State Trial Lawyers’ Association. Mr. Boyers has written and lectured extensively on civil trial matters.<br><br>Mr. Boyers and the team at Boyers Law Group are relentlessly and passionately devoted to the pursuit of justice and substantial compensation for the seriously injured clients who the firm represents. Robert Boyers and his team also pride themselves on being devoted, compassionate and accessible advocates for the firm’s clients. <br><br>Not only is the initial consultation free but if Boyers Law Group takes on a client’s case, there will be no charge for the firm’s services unless the firm wins compensation for its clients. If you or a loved one have been seriously injured, contact Boyers Law Group today for the experienced and capable advocacy that you need and deserve.<br><br>* AV<sup>®</sup>, AV Preeminent<sup>®</sup>, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell<sup>®</sup> is the facilitator of a peer review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell<sup>®</sup> Peer Review Rating<sup>TM</sup> fall into two categories - legal ability and general ethical standards</p>"
}