{
    "companyName": "Scott Merl, P.A. - Coral Gables, FL",
    "address1": "4070 Laguna Street",
    "address2": "1st Floor",
    "city": "Coral Gables",
    "state": "FL",
    "zip": "33146",
    "website": "http://www.merllaw.com",
    "phone": "305-521-1366",
    "fax": "305-671-9050",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4892383/pid_1/scott_merl_pa.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Family Law|Bankruptcy"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://www.merllaw.com?refPageViewId=6b2e962395e41273\" class=\"profile-website-body\" target=\"new\"> http://www.merllaw.com </a>"
        },
        {
            "lawyersAtScottMerl,P.A.SelectedForASuperLawyers®List": "<ul><li> Merl, Scott Jason <a href=\"/profile/lawyer/scott-jason-merl/fl/coral-gables/NDg5MjM4NF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Family Law|Bankruptcy",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/scott-merl-pa/fl/coral-gables/NDg5MjM4M18x/PP?refPageViewId=6b2e950114670a1e",
    "description": "<p>Here at the law office of Scott Merl, P.A., in Coral Gables, Florida, we are ready to assist you with the important and pressing legal challenges affecting your life and livelihood, your finances, your family and your future. </p><p>Serving clients throughout the greater Miami metro area, South Florida and all across the state, our law firm's founder, attorney Scott Jason Merl, has nearly 10 years of legal experience. He established our practice to deliver the highest level of advocacy and support to those dealing with legal issues involving any of the following:</p><ul><li>Personal injury and wrongful death claims arising from automobile accidents, unsafe property conditions and slip-and-fall accidents, pedestrian accidents and other preventable tragedies</li><li>Family law and divorce, including child custody and support, paternity and fathers' rights, property division, alimony and all other related matters</li><li>Chapter 7 and Chapter 13 bankruptcy</li></ul><p>Regardless of how complex your needs or the complications involved with your case, you can rely on us to sit with you and discuss your options to help you make the best-informed decisions. We are fully prepared to fight aggressively on your behalf, whether that is inside or outside the courtroom, to improve the likelihood you will obtain the favorable outcome you expect and deserve as efficiently and cost-effectively as possible.</p><p>From our years of experience, we have a thorough understanding of Florida law, and we have gained a reputation for our tireless work ethic as well as our irreproachable ethical standards. This means you can expect to receive the quality, trustworthy counsel you need directly from a local attorney who has your best interests at heart. We will remain with you until the final resolution of your matter as we support you in any way we can during this difficult and uncertain time in your life.</p><p>To discuss your needs and to begin the process of securing a brighter, safer and more financially stable future for yourself and your loved ones, you can call Scott Merl, P.A., or visit our law firm's website to schedule a consultation.</p>"
}