{
    "companyName": "Hunt & Taylor Law Group, LLC - Gainesville, GA",
    "address1": "1001 Riverside Drive",
    "address2": "Suite A",
    "city": "Gainesville",
    "state": "GA",
    "zip": "30501",
    "website": "https://www.huntandtaylor.com/",
    "phone": "770-831-7770",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4437307/pid_1/hunt_taylor_law_group_llc.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Personal Injury|Estate Planning|Business Law"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.huntandtaylor.com/?refPageViewId=6b5f9beca10967db\" class=\"profile-website-body\" target=\"new\"> https://www.huntandtaylor.com/ </a>"
        },
        {
            "lawyersAtHunt&TaylorLawGroup,LLCSelectedForASuperLawyers®List": "<ul><li> Taylor, Ralph <a href=\"/profile/lawyer/ralph-taylor/ga/gainesville/NTE4OTg3N18x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Personal Injury|Estate Planning|Business Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/hunt--taylor-law-group-llc/ga/gainesville/NDQzNzMwN18x/PP?refPageViewId=6b5f99a7502c5730",
    "description": "<p>From our law office in Gainesville, Georgia, the attorneys at the Hunt &amp; Taylor Law Group, LLC, provide unmatched representation and support to a diverse range of clients throughout northern Georgia who have legal needs involving any of the following:</p><p></p><ul><li>General civil litigation</li><li>Business law, entity formation and planning</li><li>Real estate law and transactions</li><li>Municipal law</li><li>Estate planning, wills and trusts</li><li>Mediation, arbitration and alternative dispute resolution</li></ul><p></p><p>When you work with our law firm, you will receive the benefit of our more than 60 years of collective experience to help you make the best-informed decisions and to increase your chances of obtaining the favorable outcome you expect and deserve efficiently and cost-effectively.</p><p>Adhering to our vision of delivering superior client service, we promise to work closely with you from our initial consultation all the way through to the resolution of your matter. During our time in practice, we have developed long-standing relationship with our clients who return to us time and again for their important and complex legal challenges.</p><p>Recognized for our outstanding professionalism and legal abilities, our attorneys have earned numerous top rankings and endorsements from our peers, and one is AV Preeminent peer-review rated,* the highest rating, through Martindale-Hubbell. In addition, we remain actively involved in both our legal and local communities, and we have gained a reputation as leaders in our field.</p><p>This means you can expect to receive the highest level of counsel directly from a local attorney who has your best interests at heart, and we are ready for the opportunity to assist you with your legal matter in any way we can. To find out more, you can contact the Hunt &amp; Taylor Law Group, LLC, by phone or through our law firm's website to schedule a free initial consultation.</p><p>*AV®, AV Preeminent®, Martindale-Hubbell Distinguished and Martindale-Hubbell Notable are certification marks used under license in accordance with the Martindale-Hubbell certification procedures, standards and policies. Martindale-Hubbell® is the facilitator of a peer-review rating process. Ratings reflect the anonymous opinions of members of the bar and the judiciary. Martindale-Hubbell® Peer Review Ratings<sup>TM</sup> fall into two categories - legal ability and general ethical standards.</p>"
}