{
    "companyName": "Beebe & O'Neil - Norwich, CT",
    "address1": "PO Box 6002",
    "address2": "335 Washington Street",
    "city": "Norwich",
    "state": "CT",
    "zip": "06360",
    "website": "https://www.beebeandoneil.com",
    "phone": "860-222-2021",
    "fax": "860-887-1378",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1258399/pid_1/beebe_oneil.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Family|Criminal Law"
        },
        {
            "offersFreeInitialConsultation": "Yes"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"https://www.beebeandoneil.com?refPageViewId=6bb1b920770267de\"> https://www.beebeandoneil.com </a>"
        }
    ],
    "practiceAreas": "Family|Criminal Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "Yes",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/beebe--oneil/ct/norwich/MTI1ODM5OV8x/PP?refPageViewId=6bb1b90757f4370d",
    "description": "<p>As members of a family-run law firm, the attorneys at Beebe and O'Neil in Norwich, Connecticut, promise to treat you like family as we work hard to help you resolve your legal issues and obtain the favorable outcomes you expect and deserve as efficiently and cost-effectively as possible.</p><p>Backed by decades of combined legal experience and unwavering commitment to see you through your difficult and uncertain time, we provide exceptional advocacy and support for the sensitive, emotional and complex legal challenges affecting your life and future, including matters involving:</p><ul><li>Family law and divorce</li><li>Criminal defense</li><li>Personal injury</li><li>Bankruptcy</li><li>Real estate</li></ul><p>Our law firm is a small practice composed of father, mother and son. Despite our size, we still offer the same level of sophisticated and comprehensive representation found at larger practices, but we are able to devote more of our attention to address your needs and increase the odds of achieving your specific goals.</p><p>As we are all lifelong residents of Norwich, we have a genuine concern for the matters that affect the members of our community, and we are dedicated to making our area a welcoming, safe environment for all. In addition, our knowledge of local courts and procedures means that we can help you find the solutions you seek efficiently, and we promise to remain accessible throughout all legal proceedings to address your questions and concerns promptly while offering regular updates as to the status of your case.</p><p>For more information on how Beebe and O'Neil can best serve your needs as well as those of your family, you can contact our law office or visit our website to schedule a free initial consultation.</p><p>We are a debt relief agency. We help people file for bankruptcy relief under the Bankruptcy Code.</p>"
}