{
    "companyName": "Fronzuto Law Group - Newark, NJ",
    "address1": "45 Bleeker Street",
    "address2": "",
    "city": "Newark",
    "state": "NJ",
    "zip": "07102",
    "website": "https://www.fronzutolaw.com/",
    "phone": "973-869-5851",
    "fax": "",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_4276309/pid_1/fronzuto_law_group.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Medical Malpractice|Pediatric Malpractice|Birth Injury|Personal Injury|Wrongful Death"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"https://www.fronzutolaw.com/?refPageViewId=6c0d06f192e767b7\" class=\"profile-website-body\" target=\"new\"> https://www.fronzutolaw.com/ </a><a rel=\"sponsored\" target=\"new\" class=\"profile-website-body\" href=\"http://www.fronzutolaw.com/blog?refPageViewId=6c0d06f192e767b7\"> http://www.fronzutolaw.com/blog </a>"
        },
        {
            "otherOffices": "<p><a href=\"/profile/lawfirm/fronzuto-law-group/nj/woodland-park/MzY5NDI4Ml8x/PP\"> Fronzuto Law Group </a> (Main Office) <span class=\"pp_card_street\"> 200 Browertown Road </span><span class=\"pp_card_street\"><span>Woodland Park</span>, <span>NJ</span><span> 07424 </span></span><span class=\"pp_card_street\"> 973-869-5851 </span></p>"
        },
        {
            "lawyersAtFronzutoLawGroupSelectedForASuperLawyers®List": "<ul><li> Fronzuto, Ernest P. <a href=\"/profile/lawyer/ernest-p-fronzuto/nj/woodland-park/MzEzMTM4OF8x/PP#feedback\">On a Super Lawyers® List</a></li></ul>"
        }
    ],
    "practiceAreas": "Medical Malpractice|Pediatric Malpractice|Birth Injury|Personal Injury|Wrongful Death",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/fronzuto-law-group/nj/newark/NDI3NjMwOV8x/PP?refPageViewId=6c0d065c84f7227d#otherlocations",
    "description": "<p>At Fronzuto Law Group, our skilled team of attorneys champions the causes of those injured by medical malpractice, defective products, and other forms of negligence throughout New Jersey and New York. When you, your child, or someone else you love has suffered serious harm due to the failures of medical providers or others, we serve as passionate advocates, guides, and trusted counselors through every phase of the legal process. With a personalized approach to client engagement and service, we zealously pursue accountability and maximum compensation for victims and their families harmed by pediatric malpractice, birth injuries, wrongful death, catastrophic injuries, and errors by hospitals and other medical facilities.</p><p>Never hesitating to delve into the most complex medical malpractice claims, we confront the challenges and intricacies of rare conditions affecting infants and children, improper diagnosis of cancer and other illnesses, complications due to negligently handled birth, and preventable deaths resulting from inadequate or mismanaged medical care. Our tireless dedication to providing the most exceptional representation involves extensive investigation, medical assessments, expert evaluations and unwavering advocacy. Although the path to physical and financial recovery is often contentious and demanding, we employ all of our knowledge and resources to deliver the most coveted results, as is evidenced by our demonstrated track record of sustaining multimillion-dollar verdicts and settlements for clients.</p><p>Whether a medical professional's acts or omissions left you injured, you suffered harm as a result of a defective or dangerous pharmaceutical or consumer product, or you experienced catastrophic injuries by other negligent means, you can entrust us with the responsibility of fighting for the resources critical for your future. Standing resolute at the forefront of medical malpractice and product liability law, our team is prepared to pursue all avenues to ensure that our clients obtain the compensation they deserve.</p><p>Our law firm focuses on customer satisfaction first and foremost. As of recently, and to ensure the utmost comfort of our clients, we now offer virtual appointments.</p>"
}