{
    "companyName": "McKinney, Tucker and Lemel - Rock Hill, SC",
    "address1": "303 Saluda St.",
    "address2": "",
    "city": "Rock Hill",
    "state": "SC",
    "zip": "29731",
    "website": "http://mtllawfirm.com/",
    "phone": "803-325-7678",
    "fax": "803-328-1622",
    "profilePhotoUrl": "https://images.findlawresources.com/env_prod/type_profile/firmwld_1242499/pid_1/mckinney_tucker_and_lemel.jpg",
    "moreBlocks": [
        {
            "practiceAreas": "Criminal Defense|Family Law"
        },
        {
            "acceptsCreditCards": "<p>Yes</p>"
        },
        {
            "websites": "<a rel=\"sponsored\" href=\"http://mtllawfirm.com/?refPageViewId=6c43be42801c12a3\" class=\"profile-website-body\" target=\"new\"> http://mtllawfirm.com/ </a>"
        }
    ],
    "practiceAreas": "Criminal Defense|Family Law",
    "litigation": "",
    "languages": "",
    "classesAndSeminars": "",
    "offersFreeInitialConsultation": "",
    "officeHours": "",
    "honors": "",
    "articles": "",
    "social_fb": "",
    "social_twitter": "",
    "social_linkedin": "",
    "social_instagram": "",
    "scrapeUrl": "https://lawyers.findlaw.com/profile/lawfirm/mckinney-tucker-and-lemel/sc/rock-hill/MTI0MjQ5OV8x/PP?refPageViewId=6c43be2215f30a22",
    "description": "<p>Protecting the rights of people like you, who are facing criminal charges or family law issues, is the priority at McKinney, Tucker, &amp; Lemel Law Firm, serving Rock Hill, South Carolina, and the surrounding areas. The firm’s attorneys know the uncertainty you may experience as you contemplate what the future holds for you. After going over your options, the staff will develop a plan that gives you clarity and focuses on securing the best possible outcome for your case.</p><p>Clients who approach the law firm with a family law matter, such as divorce, property division, child support and child custody, can expect compassionate representation. The attorneys understand that you may feel emotional and distraught as you tackle these important decisions. They will guide you through every phase of the process, whether that includes mediation or litigation.</p><p>When it comes to criminal defense, the firm has a reputation for aggressively guarding clients' freedom. As skilled litigators, the lawyers have successfully defended clients like you against alleged drug offenses, sex offenses and DUI charges. They take the time to get to know you on a personal level, determining with you what your best interests are and then constructing a strategy to protect them. No matter your situation, at McKinney, Tucker, &amp; Lemel Law Firm, you will work with an attorney who truly cares about your future.</p><p>&nbsp;</p>"
}